Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetBase Class
 The CurvedDimensionSetBase class is the base class for curved dimension sets which are defined by an arc and a point list.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionSetBase
 Tekla.Structures.Drawing.CurvedDimensionSetBase
 Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal
 Tekla.Structures.Drawing.CurvedDimensionSetRadial
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class CurvedDimensionSetBase : DimensionSetBase
<SerializableAttribute>
Public MustInherit Class CurvedDimensionSetBase
	Inherits DimensionSetBase
The CurvedDimensionSetBase type exposes the following members.
Properties
Name | Description
ArcPoint1
 Gets the first arc point.
ArcPoint2
 Gets the second arc point.
ArcPoint3
 Gets the third arc point.
Attributes
 Gets or sets the dimension set attributes.
DimensionPoints
 Gets a list of the dimension points.
Distance
 Gets the distance. The distance is measured in paper millimeters.
Top
Methods
Name | Description
Delete
 Deletes the dimension set and its child dimensions from the database.
 (Overrides DatabaseObject.Delete().)
Insert
 Curved dimensions are created using the curved dimension set handler.
 (Overrides DatabaseObject.Insert().)
Modify
 Modifies the existing dimension set in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the dimension set from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace