Tekla Open API Reference for Tekla Structures 2025
BaseComponent Properties
The BaseComponent type exposes the following members.
Properties
Name | Description
Name
 The name of the component. The name identifies custom components or plug-ins.
Number
 The number of the component. A number greater than zero identifies system components, for custom components the number is CUSTOM_OBJECT_NUMBER, and for plug-ins the number is PLUGIN_OBJECT_NUMBER.
Top
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace