Tekla Open API Reference for Tekla Structures 2025
ComponentFilterExpressions.ConnectionCode Class
 The ConnectionCode class represents the connection code filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.ConnectionCode
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ConnectionCode : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class ConnectionCode
	Inherits StringFilterExpression
The ComponentFilterExpressions.ConnectionCode type exposes the following members.
Constructors
Name | Description
ComponentFilterExpressions.ConnectionCode
 Initializes a new instance of the ConnectionCode class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace