Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedNodeLoad Class
 The AnalysisDecomposedNodeLoad class contains information related to decomposed node loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedNodeLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDecomposedNodeLoad : AnalysisDecomposedLoad
Public NotInheritable Class AnalysisDecomposedNodeLoad
	Inherits AnalysisDecomposedLoad
The AnalysisDecomposedNodeLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedNodeLoad
 Initializes a new instance of the AnalysisDecomposedNodeLoad class.
Top
Properties
Name | Description
F
 Gets or sets the force of the analysis decomposed node load.
M
 Gets or sets the moment of the analysis decomposed node load.
Top
Methods
Name | Description
Select
 Selects an analysis decomposed node load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace