Tekla Open API Reference for Tekla Structures 2025
DrawingObject Methods
The DrawingObject type exposes the following members.
Methods
Name | Description
GetDrawing
 Gets the drawing where the drawing object is.
GetRelatedObjects()
 Gets the related objects of the current object.
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
GetView
 Gets the view where the drawing object is.
IsEqual
 Compares the current object with the given object. Checks every field of both objects for equality.
ToString
 Changes the string presentation of the drawing object.
 (Overrides Object.ToString().)
Top
See Also
Reference
DrawingObject Class
Tekla.Structures.Drawing Namespace