Tekla Open API Reference for Tekla Structures 2025
Polyline Class
 The Polyline class defines a polyline that is a multipoint line. It can also have a bulge (curved lines).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.OpenGraphicObject
 Tekla.Structures.Drawing.Polyline
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Polyline : OpenGraphicObject
<SerializableAttribute>
Public NotInheritable Class Polyline
	Inherits OpenGraphicObject
The Polyline type exposes the following members.
Constructors
Name | Description
Polyline(ViewBase, PointList)
 Creates a new polyline instance with the point list using standard attributes.
Polyline(ViewBase, PointList, Polyline.PolylineAttributes)
 Creates a new polyline instance with the point list using the given attributes.
Top
Properties
Name | Description
Attributes
 The attributes for the polyline.
Bulge
 The bulge (curve) to use for the polyline (a bulge is the ratio between the height and width of an object).
Bulges
 The list of individual bulges for the polygon.
Points
 The list of points for the polyline.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if(MyDrawingHandler.GetConnectionStatus())
           {
               Polyline MyPolyline;
               PointList PolygonPoints = new PointList();
               PolygonPoints.Add(new Point(10,10));
               PolygonPoints.Add(new Point(50,10));
               PolygonPoints.Add(new Point(50,50));
               PolygonPoints.Add(new Point(10,50));
               DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
               while(views.MoveNext())
               {
                   MyPolyline = new Polyline(views.Current as ViewBase, PolygonPoints);
                   MyPolyline.Insert();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace