Tekla Open API Reference for Tekla Structures 2025
MarkSet.MarkSetAttributes Class
 The MarkSetAttributes class is the attribute class for the mark set.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes
 Tekla.Structures.Drawing.MarkSet.MarkSetAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class MarkSetAttributes : MarkBase.MarkBaseAttributes
<SerializableAttribute>
Public Class MarkSetAttributes
	Inherits MarkBase.MarkBaseAttributes
The MarkSet.MarkSetAttributes type exposes the following members.
Constructors
Name | Description
MarkSet.MarkSetAttributes
Initializes a new instance of the MarkSet.MarkSetAttributes class
Top
Properties
Name | Description
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file. Not implemented yet.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace