Tekla Open API Reference for Tekla Structures 2025
WeldFilterExpressions.SizeAboveLine Class
 The SizeAboveLine class represents the size above line filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.SizeAboveLine
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SizeAboveLine : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class SizeAboveLine
	Inherits NumericFilterExpression
The WeldFilterExpressions.SizeAboveLine type exposes the following members.
Constructors
Name | Description
WeldFilterExpressions.SizeAboveLine
 Initializes a new instance of the SizeAboveLine class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace