Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameter Class
 The AnalysisDesignParameter class contains information related to analysis design parameters.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDesignParameterBase
 Tekla.Structures.Analysis.AnalysisDesignParameter
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDesignParameter : AnalysisDesignParameterBase
Public NotInheritable Class AnalysisDesignParameter
	Inherits AnalysisDesignParameterBase
The AnalysisDesignParameter type exposes the following members.
Constructors
Name | Description
AnalysisDesignParameter(Int32)
 Initializes a new instance of the AnalysisDesignParameter class.
AnalysisDesignParameter(String, Int32, Identifier, Double)
 Initializes a new instance of the AnalysisDesignParameter class.
Top
Properties
Name | Description
Value
 Gets or sets the value of the analysis design parameter.
Top
Methods
Name | Description
Modify
 Modifies an analysis design parameter. The ID has to be set.
 (Overrides AnalysisDesignParameterBase.Modify().)
Select
 Selects an analysis design parameter.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace