Tekla Open API Reference for Tekla Structures 2025
Assembly Properties
The Assembly type exposes the following members.
Properties
Name | Description
AssemblyNumber
 Defines the numbering in the assembly sense. If the members are empty and zero, the main part attributes are used.
Name
 The name of the assembly.
Top
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace