Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadialAttributes Properties
The CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes type exposes the following members.
Properties
Name | Description
CurvedDimensionType
 The curved dimension type.
DimensionType
 The dimension type.
Top
See Also
Reference
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes Class
Tekla.Structures.Drawing Namespace