Tekla Open API Reference for Tekla Structures 2025
SurfaceObject Class
 The SurfaceObject class represents a surface object in the model. Currently this class only support dynamic surfaces whose geometries are determined by the parts or pours they associate to. It is not allowed to modify the geometry of a dynamic surface on Open API. The polymesh setter of this class throws .
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.SurfaceObject
 Tekla.Structures.Model.RebarLegSurfaceObject
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class SurfaceObject : ModelObject
<SerializableAttribute>
Public Class SurfaceObject
	Inherits ModelObject
The SurfaceObject type exposes the following members.
Constructors
Name | Description
SurfaceObject
 Initializes a new instance of the SurfaceObject class.
Top
Properties
Name | Description
Class
 Gets or sets the class of the surface object.
CreateHoles
 Gets or sets a value indicating whether CreateHoles parameter of the surface object.
Father
 Gets or sets the father object of the surface object. The father can be set only before the Insert(), otherwise exception is thrown.
Name
 Gets or sets the name of the surface object.
Polymesh
 Gets or sets the surface geometry brep.
Type
 Gets or sets the type of the surface object.
Top
Methods
Name | Description
Delete
 Deletes the model object from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts a new model object. The geometry of the object needs to be set by using the public Polymesh function, before calling insert.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing model object in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the model object from the model by the identifier of this instance.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
using System.Collections.Generic;
public class Example
{
   public void Example1()
   {
      Point startPointBeam = new Point(0.0, 0.0, 0.0);
      Point endPointBeam = new Point(10000.0, 0.0, 0.0);
      Beam Beam = new Beam(startPointBeam, endPointBeam)
      {
         Profile = { ProfileString = "400*400" },
         Material = { MaterialString = "Concrete_Undefined" }
      };
      Beam.Insert();
      SurfaceObject surfaceObject = new SurfaceObject();
      surfaceObject.Polymesh = CreateSingleFacePolymeshGeometry(
                      new[]
                      {
                          new Vector(    0.0, -200.0, 0.0), // 0
                          new Vector(10000.0, -200.0, 0.0), // 1
                          new Vector(10000.0,  200.0, 0.0), // 2
                          new Vector(    0.0,  200.0, 0.0)  // 3
                      });
      surfaceObject.Father = this.Beam;
      surfaceObject.Insert();
   }
   private static FacetedBrep CreateSingleFacePolymeshGeometry(Vector[] vertices)
   {
       var outerWires = new int[1][];
       outerWires[0] = new int[vertices.Length];
       for (int i = 0; i < vertices.Length; i++)
           outerWires[0][i] = i;
       var innerWires = new Dictionary<int, int[][]> { };
       return new FacetedBrep(vertices, outerWires, innerWires);
   }
}
See Also
Reference
Tekla.Structures.Model Namespace