Tekla Open API Reference for Tekla Structures 2025
WeldMark Properties
The WeldMark type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the weld mark. For more information see WeldMark.WeldMarkAttributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
InsertionPoint
 The insertion point of the mark.
ModelIdentifier
 When instance refers to welding mark related to a weld in model database, ModelIdentifier has a value. When instance refers to weld mark created with drawing editor UI, value is zero.
Top
See Also
Reference
WeldMark Class
Tekla.Structures.Drawing Namespace