Tekla Open API Reference for Tekla Structures 2025
LoadLine Properties
The LoadLine type exposes the following members.
Properties
Name | Description
DistanceA
 The distance a (for shortening or dividing the length of a line load).
DistanceB
 The distance b (for shortening or dividing the length of a line load).
LoadForm
 The load form.
P1
 The load magnitude vector at the start position. The values are given in the local coordinate system of the load (not in the current coordinate system).
P2
 The load magnitude vector at the end position. The values are given in the local coordinate system of the load (not in the current coordinate system).
Position1
 The first input position point.
Position2
 The second input position point.
Torsion1
 The first torsion.
Torsion2
 The second torsion.
Top
See Also
Reference
LoadLine Class
Tekla.Structures.Model Namespace