Tekla Open API Reference for Tekla Structures 2025
View Methods
The View type exposes the following members.
Methods
Name | Description
Create3dView(Drawing, Point, View.ViewAttributes, View)
 Generates a new 3d view on the sheet of the given active drawing.
Create3dView(Drawing, CoordinateSystem, CoordinateSystem, AABB, Point, View.ViewAttributes, View)
 Generates a new 3d view on the sheet of the given active drawing using given view plane and display plane.
CreateBackView
 Generates a new back view on the sheet of the given active drawing.
CreateBottomView
 Generates a new bottom view on the sheet of the given active drawing.
CreateCurvedSectionView
 Generates a new curved section view on the sheet of the active drawing and the associated section mark for the specified view.
CreateDetailView
 Generates a new detail view on the sheet of the active drawing and the associated detail mark for the specified view.
CreateFrontView
 Generates a new front view on the sheet of the given active drawing.
CreateSectionView
 Generates a new section view on the sheet of the active drawing and the associated section mark for the specified view.
CreateTopView
 Generates a new top view on the sheet of the given active drawing.
GetModelObjects()
 Gets the model objects that are in the view.
GetVisibleAreaRestrictionBoxes
 Gets the restriction boxes that represent the visible areas of the view.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewBase.IsEqual(Object).)
RotateViewOnAxisX
 Rotate the view on the X axis.
RotateViewOnAxisY
 Rotate the view on the Y axis.
RotateViewOnAxisZ
 Rotate the view on the Z axis.
RotateViewOnDrawingPlane
 Rotate the view on the drawings plane. This works just like the user interface command "Rotate view".
Top
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace