Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionRadial Class
 The CurvedDimensionRadial class defines a curved dimension with radial reference points. The dimension text on the line can be either a distance or an angle value.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.CurvedDimensionBase
 Tekla.Structures.Drawing.CurvedDimensionRadial
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedDimensionRadial : CurvedDimensionBase
<SerializableAttribute>
Public NotInheritable Class CurvedDimensionRadial
	Inherits CurvedDimensionBase
The CurvedDimensionRadial type exposes the following members.
Constructors
Name | Description
CurvedDimensionRadial(ViewBase, Point, Point, Point, Point, Point, Double)
 Creates a new curved dimension with radial reference points using standard attributes.
CurvedDimensionRadial(ViewBase, Point, Point, Point, Point, Point, Double, CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes)
 Creates a new curved dimension with radial reference points.
Top
Properties
Name | Description
Top
Methods
Name | Description
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides CurvedDimensionBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace