Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectBase Class
 The EmbeddedObjectBase class defines an embedded object in a drawing. The object refers to another file in the file system and its drawing representation is updated when a drawing is opened.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.EmbeddedObjectBase
 Tekla.Structures.Drawing.DwgObject
 Tekla.Structures.Drawing.Image
 Tekla.Structures.Drawing.TextFile
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class EmbeddedObjectBase : DrawingObject,
	IResizeable, IMovableRelative, IAxisAlignedBoundingBox, IObjectAlignedBoundingBox
<SerializableAttribute>
Public MustInherit Class EmbeddedObjectBase
	Inherits DrawingObject
	Implements IResizeable, IMovableRelative, IAxisAlignedBoundingBox, IObjectAlignedBoundingBox
The EmbeddedObjectBase type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the angle (in degrees).
Attributes
 Gets or sets the attributes.
FileName
 Gets or sets the file name defining the embedded object.
InsertionPoint
 Gets or sets the insertion point.
Size
 Gets or sets the size of the frame of the embedded object.
Top
Methods
Name | Description
Delete
 Deletes the embedded object.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Gets the bounding box for the current object in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Gets the bounding box for the current object in its local coordinate system.
Insert
 Inserts the embedded object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the embedded object.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object according to the given move vector.
Resize
 Resizes the object. The scaling type is changed to ScaleToFit.
Select
 Selects the embedded object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace