Tekla Open API Reference for Tekla Structures 2025
SectionMarkTagAttributes Properties
The SectionMarkBase.SectionMarkTagAttributes type exposes the following members.
Properties
Name | Description
ShowOnSide
 The side(s) on which the tag is shown.
TagRotation
 The policy for the tag rotation.
Top
See Also
Reference
SectionMarkBase.SectionMarkTagAttributes Class
Tekla.Structures.Drawing Namespace