Tekla Open API Reference for Tekla Structures 2025
LogicalWeld Methods
The LogicalWeld type exposes the following members.
Methods
Name | Description
AddWeld
 Adds a weld to the logical weld.
Delete
 Deletes the logical weld instance with the given identifier from the model database and also the children welds.
 (Overrides ModelObject.Delete().)
Explode
 Removes the logical weld from the model but not the children welds.
GetMainWeld
 Returns the main weld of the logical weld.
Insert
 Inserts the logical weld into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing logical weld in the model database to match the current one.
 (Overrides ModelObject.Modify().)
RemoveWeld
 Removes a weld from the logical weld.
Select()
 Selects a logical weld from the model database. The logical weld identifier must be set.
 (Overrides ModelObject.Select().)
Select(BaseWeld)
 Selects the logical weld that a child weld belongs to.
SetMainWeld
 Sets the main weld for the logical weld.
Top
See Also
Reference
LogicalWeld Class
Tekla.Structures.Model Namespace