Tekla Open API Reference for Tekla Structures 2025
GADrawing Methods
The GADrawing type exposes the following members.
Methods
Name | Description
Insert
 Inserts an empty general arrangement drawing. Views must be added separately. A drawing can be inserted only when there is no active drawing.
 (Overrides DatabaseObject.Insert().)
Modify
 Applies the changes made to the drawing attributes.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
GADrawing Class
Tekla.Structures.Drawing Namespace