Tekla Open API Reference for Tekla Structures 2025
RebarLegSurfaceObject Class
 The RebarLegSurfaceObject class represents a polymesh surface for generating rebar legs in a RebarSet.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.SurfaceObject
 Tekla.Structures.Model.RebarLegSurfaceObject
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarLegSurfaceObject : SurfaceObject
<SerializableAttribute>
Public Class RebarLegSurfaceObject
	Inherits SurfaceObject
The RebarLegSurfaceObject type exposes the following members.
Constructors
Name | Description
RebarLegSurfaceObject
 Initializes a new instance of the RebarLegSurfaceObject class.
Top
Properties
Name | Description
AdditionalOffset
 Gets or sets the user defined offset of the rebar legs from the leg surface object.
LayerNumber
 Gets or sets the layer number of the leg surface object.
RebarSet
 Gets or sets the RebarSet to which the leg surface object belongs.
Top
Methods
Name | Description
Insert
 Inserts the leg surface object into the model database.
 (Overrides SurfaceObject.Insert().)
Modify
 Modifies the existing leg surface object in the model database to match the current one.
 (Overrides SurfaceObject.Modify().)
Select
 Selects the leg surface object from the model database. The identifier must be set.
 (Overrides SurfaceObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
    public void Example1(Vector[] vertices, int[][] outerWires, IDictionary<int, int[][]> innerWires)
    {
        var beam = new Beam();
        // Set Beam properties (code omitted)...
        beam.Insert();
        var rebarSet = new RebarSet();
        // Set RebarSet properties (code omitted)...
        rebarSet.Insert();
        var legSurface = new RebarLegSurfaceObject();
        legSurface.Polymesh = new FacetedBrep(vertices, outerWires, innerWires);
        legSurface.Father = beam;
        legSurface.RebarSet = rebarSet;
        legSurface.LayerNumber = 1;
        legSurface.AdditionalOffset = 25.0;
        legSurface.Insert();
    }
}
See Also
Reference
Tekla.Structures.Model Namespace