Tekla Open API Reference for Tekla Structures 2025
PlateIntersectsWithIntersectionLineException Class
 The PlateIntersectsWithIntersectionLineException class represents an error when, plate polygon extends beyond intersection line.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.PlateIntersectsWithIntersectionLineException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PlateIntersectsWithIntersectionLineException : ConnectiveGeometryException
<SerializableAttribute>
Public Class PlateIntersectsWithIntersectionLineException
	Inherits ConnectiveGeometryException
The PlateIntersectsWithIntersectionLineException type exposes the following members.
Constructors
Name | Description
PlateIntersectsWithIntersectionLineException
 Initializes a new instance of the PlateIntersectsWithIntersectionLineException class with "Plate polygon extends beyond intersection line" error message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace