Tekla Open API Reference for Tekla Structures 2025
ReinforcingBarFilterExpressions.Diameter Class
 The Diameter class represents the diameter filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Diameter
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Diameter : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class Diameter
	Inherits NumericFilterExpression
The ReinforcingBarFilterExpressions.Diameter type exposes the following members.
Constructors
Name | Description
ReinforcingBarFilterExpressions.Diameter
 Initializes a new instance of the Diameter class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace