Tekla Open API Reference for Tekla Structures 2025
LoadUniform Methods
The LoadUniform type exposes the following members.
Methods
Name | Description
Delete
 Deletes the load uniform instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the load uniform into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing load uniform in the model database to match the current one. At the moment it is not possible to change the load attachment or the father.
 (Overrides ModelObject.Modify().)
Select
 Selects a load uniform from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
LoadUniform Class
Tekla.Structures.Model Namespace