Tekla Open API Reference for Tekla Structures 2025
Drawing Methods
The Drawing type exposes the following members.
Methods
Name | Description
CommitChanges()
 Commits the changes made to the drawings database so far. Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo. Commit also executes all messages. Please note that you need to also to save the drawings database to persists the changes to disk.
CommitChanges(String)
 Commits the changes made to the drawings database so far. Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo. Commit also executes all messages. Please note that you need to also to save the drawings database to persists the changes to disk.
Delete
 Deletes the drawing. An active drawing cannot be deleted.
 (Overrides DatabaseObject.Delete().)
GetIdsOfUnnumberedDrawings
 Returns the list of identifiers of those drawings in the input that are NOT up to date regarding numbering in the drawing
GetPlotFileName
Get plot file name.
GetPlotFileNameExt
Get plot file name.
GetSheet
 Gets the sheet of the drawing.
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Overrides DatabaseObject.IsSameDatabaseObject(DatabaseObject).)
PlaceViews
 Places views on the sheet. Computes the required size of the views to fit the parts, then places the views so that they fit on the sheet and do not overlap. Adjusts the sheet size if needed.
Top
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace