Tekla Open API Reference for Tekla Structures 2025
MarkBase.MarkBaseAttributes Class
 The MarkBaseAttributes class is the attributes class for the mark base.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes
 Tekla.Structures.Drawing.Mark.MarkAttributes
 Tekla.Structures.Drawing.MarkSet.MarkSetAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class MarkBaseAttributes : AttributesBase,
	IPreferredPlacing
<SerializableAttribute>
Public MustInherit Class MarkBaseAttributes
	Inherits AttributesBase
	Implements IPreferredPlacing
The MarkBase.MarkBaseAttributes type exposes the following members.
Constructors
Name | Description
MarkBase.MarkBaseAttributes()
 Creates a new default mark base attributes instance that loads standard attributes.
MarkBase.MarkBaseAttributes(String)
 Creates a new mark base attributes instance with the given attributes file's filename.
Top
Properties
Name | Description
Angle
 The actual angle of the mark, in degrees. Can differ from the rotation angle set by the user for marks, e.g. 45-degree column marks in GA drawings or when placing mark along part edges.
ArrowHead
 The arrowhead of the leader line(s).
CustomPresentation
 Custom presentation GUID to be applied to the object type
Frame
 The frame attributes of the mark's labels.
PlacingAttributes
 The placing attributes that the object should use. Using these you can specify whether the object is automatically arranged in the drawing or not.
PreferredPlacing
 The type of placing the object should use. See the preferred placing types for different types of placing.
RotationAngle
 The mark rotation angle set by the user. Unit is degrees.
TextAlignment
 The mark text alignment.
TransparentBackground
 The mark text background transparency. (transparent/opaque)
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace