Tekla Open API Reference for Tekla Structures 2025
GridBase Methods
The GridBase type exposes the following members.
Methods
Name | Description
Delete
 Deletes the grid with the given ID.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the grid into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the grid with the given ID.
 (Overrides ModelObject.Modify().)
Select
 Selects the grid with the given ID.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
GridBase Class
Tekla.Structures.Model Namespace