Tekla Open API Reference for Tekla Structures 2025
DrawingLink Methods
The DrawingLink type exposes the following members.
Methods
Name | Description
Delete
 Deletes the link.
 (Overrides DatabaseObject.Delete().)
Insert
 Inserts the link.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the link.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the link.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
DrawingLink Class
Tekla.Structures.Drawing Namespace