Tekla Open API Reference for Tekla Structures 2025
View Properties
The View type exposes the following members.
Properties
Name | Description
Attributes
 The view attributes.
DisplayCoordinateSystem
 The coordinate system of the display plane. This can be used to transform global points from the model that is to be inserted in the view.
Name
 The name of the view.
RestrictionBox
 The axis aligned bounding box that represents the volume of the view.
ViewCoordinateSystem
 The coordinate system of the view plane.
ViewType
 The view type information.
Top
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace