Tekla Open API Reference for Tekla Structures 2025
LoadArea Class
 The LoadArea class defines a linearly-distributed force bound by a triangle or a quadrangle.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Load
 Tekla.Structures.Model.LoadArea
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LoadArea : Load
<SerializableAttribute>
Public NotInheritable Class LoadArea
	Inherits Load
The LoadArea type exposes the following members.
Constructors
Name | Description
LoadArea
 Creates a new load area instance.
Top
Properties
Name | Description
DistanceA
 The distance a (for enlarging or reducing the loaded area).
LoadForm
 The load form.
P1
 The load magnitude vector P1. The values are given in the local coordinate system of the load (not in the current coordinate system).
P2
 The load magnitude vector P2. The values are given in the local coordinate system of the load (not in the current coordinate system).
P3
 The load magnitude vector P3. The values are given in the local coordinate system of the load (not in the current coordinate system).
P4
 The load magnitude vector P4. This one cannot be set. The values are given in the local coordinate system of the load (not in the current coordinate system).
Position1
 The first position point.
Position2
 The second position point.
Position3
 The third position point.
Top
Methods
Name | Description
Delete
 Deletes the load area instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the load area into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing load area in the model database to match the current one. At the moment it is not possible to change the load attachment or the father.
 (Overrides ModelObject.Modify().)
Select
 Selects a load area from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           LoadArea L = new LoadArea();
           L.P1 = new Vector(1000,2000,3000);
           L.P2 = new Vector(4000,5000,6000);
           L.P3 = new Vector(7000,8000,9000);
           L.DistanceA = 5;
           L.Position1 = new Point(6000,6000,0);
           L.Position2 = new Point(8000,6000,0);
           L.Position3 = new Point(8000,9000,0);
           L.LoadForm = LoadArea.AreaLoadFormEnum.LOAD_FORM_AREA_PARALLELOGRAM;
           L.AutomaticPrimaryAxisWeight = true;
           L.BoundingBoxDx = 500;
           L.BoundingBoxDy = 500;
           L.BoundingBoxDz = 500;
           L.LoadDispersionAngle = 5;
           L.PartFilter = "testing";
           L.PartNames = Load.LoadPartNamesEnum.LOAD_PART_NAMES_INCLUDE;
           L.PrimaryAxisDirection = new Vector(1000, 500, 0);
           L.Spanning = Load.LoadSpanningEnum.LOAD_SPANNING_SINGLE;
           L.Weight = 2;
           L.CreateFixedSupportConditionsAutomatically = true;
           if (!L.Insert())
               Console.WriteLine("LoadArea Insert failed!");
       }
}
See Also
Reference
Tekla.Structures.Model Namespace