Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection Properties
The BinaryFilterExpressionCollection type exposes the following members.
Properties
Name | Description
Count
 Gets the number of elements actually contained in the collection.
IsReadOnly
 Gets a value indicating whether the collection is read-only.
IsSynchronized
 Gets a value indicating whether the collection supports multithreading.
Item
 Gets or sets the item at a specific index.
SyncRoot
 Gets the root for synchronization.
Top
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace