Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_TShapeProfile Class
 The IFC2X3_ParametricObject_TShapeProfile class contains the T-shape profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_TShapeProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_TShapeProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_TShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
FilletRadius
 The fillet radius.
FlangeEdgeRadius
 The flange edge radius.
FlangeSlope
 The flange slope.
FlangeThickness
 The flange thickness.
FlangeWidth
 The flange width.
WebEdgeRadius
 The web edge radius.
WebSlope
 The web slope.
WebThickness
 The web thickness.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace