Tekla Open API Reference for Tekla Structures 2025
ReferenceModel Properties
The ReferenceModel type exposes the following members.
Properties
Name | Description
ActiveFilePath
 Gets the path to the local copy of the current revision of the reference model.
BasePointGuid
 The GUID of the used base point. Empty if base point is not used.
Filename
 The path to the original location of the reference file.
ModelGUID |  Obsolete.
 The ModelGUID of the reference model in the Project Center.
Position
 The position of the reference model.
ProjectGUID |  Obsolete.
 The ProjectGUID of the reference model in the Project Center.
Rotation |  Obsolete.
Gets or sets value of rotation around Z axis (degrees).
Rotation3D
Gets or sets value of 3d rotation.
Scale
 The scale of the reference model.
Title
 The reference model name(title).
UseWorkplane
Sets whether workplane is used.
VersionGUID |  Obsolete.
 The VersionGUID of the reference model in the Project Center.
Visibility
 The visibility of the reference model in the model view.
Top
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace