Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_UShapeProfile Class
 The IFC2X3_ParametricObject_UShapeProfile class contains the U-shape profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_UShapeProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_UShapeProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_UShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
EdgeRadius
 The edge radius.
FilletRadius
 The fillet radius.
FlangeSlope
 The flange slope.
FlangeThickness
 The flange thickness.
FlangeWidth
 The flange width.
WebThickness
 The web thickness.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace