Tekla Open API Reference for Tekla Structures 2025
Plugin Properties
The Plugin type exposes the following members.
Properties
Name | Description
Name
 Gets the name of the plug-in.
Top
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace