Tekla Open API Reference for Tekla Structures 2025
RebarGroup Properties
The RebarGroup type exposes the following members.
Properties
Name | Description
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
ExcludeType
 Defines which bars to omit from the group. The options are:
EXCLUDE_TYPE_NONE
EXCLUDE_TYPE_FIRST
EXCLUDE_TYPE_LAST
Polygons
 An array list of polygons to define the reinforcing bar group shape. Use 1 polygon when defining non-tapered or spiral rebar groups. Use 2 to 99 polygons when defining tapered rebar groups. Each polygon must have an equal number of points.
SpacingType
 The type of spacing. The options are (BaseRebarGroup.RebarGroupSpacingTypeEnum.):
SPACING_TYPE_UNDEFINED
SPACING_TYPE_EXACT_SPACINGS
SPACING_TYPE_EXACT_NUMBER
SPACING_TYPE_TARGET_SPACE
SPACING_TYPE_EXACT_SPACE_FLEX_AT_START
SPACING_TYPE_EXACT_SPACE_FLEX_AT_END
SPACING_TYPE_EXACT_SPACE_FLEX_AT_BOTH
StirrupType
 The type of the stirrup. The options are:
STIRRUP_TYPE_POLYGONAL
STIRRUP_TYPE_SPIRAL
STIRRUP_TYPE_TAPERED_CURVED
Top
See Also
Reference
RebarGroup Class
Tekla.Structures.Model Namespace