Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpression Class
 The BinaryFilterExpression class represents a binary expression between two filter expressions. This class cannot be inherited.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.FilterExpression
 Tekla.Structures.Filtering.BinaryFilterExpression
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BinaryFilterExpression : FilterExpression
<SerializableAttribute>
Public NotInheritable Class BinaryFilterExpression
	Inherits FilterExpression
The BinaryFilterExpression type exposes the following members.
Constructors
Name | Description
BinaryFilterExpression(BooleanFilterExpression, BooleanOperatorType, BooleanConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
BinaryFilterExpression(DateTimeFilterExpression, DateTimeOperatorType, DateTimeConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
BinaryFilterExpression(NumericFilterExpression, NumericOperatorType, NumericConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
BinaryFilterExpression(StringFilterExpression, StringOperatorType, StringConstantFilterExpression)
 Initializes a new instance of the BinaryFilterExpression class.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Examples
 The following example creates this BinaryFilterExpression: PartName == BEAM1
using System;
using Tekla.Structures.Filtering;
using Tekla.Structures.Filtering.Categories;
public class FilterExample
{
       // Creates a binary filter expression:
       // PartName == BEAM1
       public BinaryFilterExpression CreateBinaryFilterExpression()
       {
           // Creates the filter expressions
           PartFilterExpressions.Name PartName = new PartFilterExpressions.Name();
           StringConstantFilterExpression Beam1 = new StringConstantFilterExpression("BEAM1");
           // Creates the binary filter expression
           return new BinaryFilterExpression(PartName, StringOperatorType.IS_EQUAL, Beam1);
       }
}
See Also
Reference
Tekla.Structures.Filtering Namespace
Tekla.Structures.Filtering.BinaryFilterExpressionCollection