Tekla Open API Reference for Tekla Structures 2025
Surfacing Properties
The Surfacing type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the surfacing. For more information see Surfacing.SurfacingAttributes.
Top
See Also
Reference
Surfacing Class
Tekla.Structures.Drawing Namespace