Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem Methods
The ParametricProfileItem type exposes the following members.
Methods
Name | Description
CreateProfileString
 Gets the parametric profile item prefix and adds parameter values.
GetParametricProfilePrefix
 Gets the parametric profile item prefix using the given subtype. This can be used after retrieving a library profile that has a parametric user-defined type.
Select(String)
 Selects the parametric profile item in the profile database using the given name.
SelectByPrefix
 Selects the parametric profile item in the profile database using the given prefix.
SelectByProfileName
 Selects the parametric profile item in the profile database using the given name.
SelectByTypeAndSubtype
 Selects the parametric profile item in the profile database using the given type and subtype.
Top
See Also
Reference
ParametricProfileItem Class
Tekla.Structures.Catalogs Namespace