Tekla Open API Reference for Tekla Structures 2025
RebarSetAddition Methods
The RebarSetAddition type exposes the following members.
Methods
Name | Description
Delete
 Deletes the rebar set addition with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the rebar set addition into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the rebar set addition in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the rebar set addition from the model database. The rebar set addition identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
RebarSetAddition Class
Tekla.Structures.Model Namespace