Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroupAttributes Methods
The ReinforcementBase.ReinforcementSetGroupAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ReinforcementBase.ReinforcementBaseAttributes.IsEqual(Object).)
Top
See Also
Reference
ReinforcementBase.ReinforcementSetGroupAttributes Class
Tekla.Structures.Drawing Namespace