Tekla Open API Reference for Tekla Structures 2025
ReferenceModel Methods
The ReferenceModel type exposes the following members.
Methods
Name | Description
Delete
 Deletes the reference model with the given identifier.
 (Overrides ModelObject.Delete().)
GetChildren
 Returns an enumerator of all the children reference model objects.
 (Overrides ModelObject.GetChildren().)
GetConvertedObjects
 Returns an enumerator of model object converted from the reference model.
GetCurrentRevision
 Gets the current revision.
GetReferenceModelObjectByExternalGuid
 Gets reference model object by external (IFC) guid from this reference model.
GetReferenceModelObjectGuidsByExternalGuids
 Gets reference model object guids by external guids.
GetRevisions
 Gets the reference models available revisions.
Insert
 Inserts the reference model into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the reference model with the given identifier.
 (Overrides ModelObject.Modify().)
RefreshFile
 Reload the reference file from the location specified by Filename. If the file has changed, a new revision will be created and taken into use. Note that if a new revision was successfully created, the ActiveFilePath is changed.
RemoveRevision
 Removes the given revision from the reference model.
Select
 Selects the reference model with the given identifier.
 (Overrides ModelObject.Select().)
SetAsCurrentRevision(ReferenceModel.Revision)
 Sets the given revision as current revision.
SetAsCurrentRevision(Int32, Int32)
 Sets the given revision as current revision.
Top
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace