Tekla Open API Reference for Tekla Structures 2025
ApplicationWindowBase Methods
The ApplicationWindowBase type exposes the following members.
Methods
Name | Description
InitializeDataStorage
 Initializes the datastorage and registers property bindings for defined viewmodel.
Top
See Also
Reference
ApplicationWindowBase Class
Tekla.Structures.Dialog Namespace