Tekla Open API Reference for Tekla Structures 2025
NumericFilterExpression Class
 The NumericFilterExpression class represents a numeric filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 More...
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class NumericFilterExpression : DataFilterExpression
<SerializableAttribute>
Public Class NumericFilterExpression
	Inherits DataFilterExpression
The NumericFilterExpression type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.Length
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.Phase
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.Size
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.Phase
 Tekla.Structures.Filtering.Categories.ConstructionObjectFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.ConstructionObjectFilterExpressions.Phase
 Tekla.Structures.Filtering.Categories.ConstructionObjectFilterExpressions.Type
 Tekla.Structures.Filtering.Categories.LoadFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.LoadFilterExpressions.Phase
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.IdNumber
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.IsComponent
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.Phase
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.Type
 Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.Class
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.Lot
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.Phase
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.PourPhase
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.StartNumber
 Tekla.Structures.Filtering.Categories.PourBreakFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.PourUnitFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.ReferenceObjectFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Class
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Diameter
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Length
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Phase
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.StartNumber
 Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.Class
 Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.Completeness
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.TemplateFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.CustomNumber
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.Phase
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.SizeAboveLine
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.SizeBelowLine
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.TypeAboveLine
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.TypeBelowLine
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.WeldingSite