Tekla Open API Reference for Tekla Structures 2025
DwgObject Class
 The DwgObject class defines a DWG or DXF object that can be inserted into a drawing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.EmbeddedObjectBase
 Tekla.Structures.Drawing.DwgObject
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DwgObject : EmbeddedObjectBase
<SerializableAttribute>
Public NotInheritable Class DwgObject
	Inherits EmbeddedObjectBase
The DwgObject type exposes the following members.
Constructors
Name | Description
DwgObject(ViewBase, Point, String)
 Creates a new DwgObject instance with the given parameters.
DwgObject(ViewBase, Point, String, EmbeddedObjectAttributes)
 Creates a new DwgObject instance using the specified attributes.
DwgObject(ViewBase, Point, Size, String)
 Creates a new DwgObject instance with the given parameters.
DwgObject(ViewBase, Point, Size, String, EmbeddedObjectAttributes)
 Creates a new DwgObject instance using the specified attributes.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Examples
 The following example shows how to embed a DXF file to a drawing with the scale 0.5:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System.IO;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           ViewBase _view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
           EmbeddedObjectAttributes attributes = new EmbeddedObjectAttributes();
           attributes.XScale = 0.5;
           attributes.YScale = 0.5;
           DwgObject dxf = new DwgObject(_view, new Point(100, 100),
                                         Path.GetFullPath("my_dxf.dxf"), attributes);
           dxf.Insert();
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace