Tekla Open API Reference for Tekla Structures 2025
BaseWeld Methods
The BaseWeld type exposes the following members.
Methods
Name | Description
GetSolid
 Method for getting the weld solid.
GetWeldGeometries
 Method for getting weld seam geometries. Every result represents one individual seam geometry in current weld.
Top
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace