Tekla Open API Reference for Tekla Structures 2025
Part Properties
The Part type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the part. For more information see Part.PartAttributes.
Top
See Also
Reference
Part Class
Tekla.Structures.Drawing Namespace