Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase Class
 The ReinforcementBase class contains methods related to reinforcements. A reinforcement is a drawing object derived from a model object. It represents a drawing reinforcement that has a reference to the actual reinforcement in the model database.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.ReinforcementBase
 Tekla.Structures.Drawing.ReinforcementGroup
 Tekla.Structures.Drawing.ReinforcementMesh
 Tekla.Structures.Drawing.ReinforcementSetGroup
 Tekla.Structures.Drawing.ReinforcementSingle
 Tekla.Structures.Drawing.ReinforcementStrand
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ReinforcementBase : ModelObject
<SerializableAttribute>
Public MustInherit Class ReinforcementBase
	Inherits ModelObject
The ReinforcementBase type exposes the following members.
Properties
Name | Description
Attributes
 The common attributes of all reinforcements. For more information see ReinforcementBase.ReinforcementBaseAttributes.
Top
Methods
Name | Description
Delete
 Deletes the drawing reinforcement from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 Inserts the drawing reinforcement into the current drawing database. NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
Modify
 Modifies the drawing reinforcement in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing reinforcement from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace