Tekla Open API Reference for Tekla Structures 2025
GridPlane Methods
The GridPlane type exposes the following members.
Methods
Name | Description
Delete
 Deletes the grid surface with the given ID.
 (Overrides GridSurface.Delete().)
Insert
 Inserts the grid surface into the model.
 (Overrides GridSurface.Insert().)
Modify
 Modifies the grid plane with the given ID.
 (Overrides GridSurface.Modify().)
Select
 Selects the grid surface with the given ID.
 (Overrides GridSurface.Select().)
Top
See Also
Reference
GridPlane Class
Tekla.Structures.Model Namespace