Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_TShapeProfile Properties
The IFC2X3_ParametricObject_TShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
FilletRadius
 The fillet radius.
FlangeEdgeRadius
 The flange edge radius.
FlangeSlope
 The flange slope.
FlangeThickness
 The flange thickness.
FlangeWidth
 The flange width.
WebEdgeRadius
 The web edge radius.
WebSlope
 The web slope.
WebThickness
 The web thickness.
Top
See Also
Reference
IFC2X3_ParametricObject_TShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace