Tekla Open API Reference for Tekla Structures 2025
LevelMark Methods
The LevelMark type exposes the following members.
Methods
Name | Description
Delete
 Deletes the level mark from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Returns the axis aligned bounding box of the level mark (rectangle format).
GetObjectAlignedBoundingBox
 Returns the bounding box of the level mark (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
Insert
 Inserts the level mark into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the level mark in the current drawing database.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object using the move vector.
Select
 Selects the level mark from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
LevelMark Class
Tekla.Structures.Drawing Namespace