Tekla Open API Reference for Tekla Structures 2025
ControlArc Properties
The ControlArc type exposes the following members.
Properties
Name | Description
Color
 Gets or sets color of the control arc.
Geometry
 Gets or sets the arc geometry. The arc must not represent a complete circle (i.e. the arc angle must be less than 360 degrees).
LineType
 The line type of the control arc.
Top
See Also
Reference
ControlArc Class
Tekla.Structures.Model Namespace