Tekla Open API Reference for Tekla Structures 2025
ReinforcementStrandAttributes Properties
The ReinforcementBase.ReinforcementStrandAttributes type exposes the following members.
Properties
Name | Description
HookedEndSymbolType
 Defines how the hooked ends of reinforcing bars should look like.
ReinforcementVisibility
 Defines which bars in the group appear in drawings.
StraightEndSymbolType
 Defines how the straight ends of reinforcing bars should look like.
Top
See Also
Reference
ReinforcementBase.ReinforcementStrandAttributes Class
Tekla.Structures.Drawing Namespace