Tekla Open API Reference for Tekla Structures 2025
DimensionBase Class
 The DimensionBase class is the common base class for all the different dimensions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.AngleDimension
 Tekla.Structures.Drawing.CurvedDimensionBase
 Tekla.Structures.Drawing.RadiusDimension
 Tekla.Structures.Drawing.StraightDimension
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class DimensionBase : DrawingObject,
	IHideable
<SerializableAttribute>
Public MustInherit Class DimensionBase
	Inherits DrawingObject
	Implements IHideable
The DimensionBase type exposes the following members.
Properties
Name | Description
Hideable
 Accesses the information if this object is hidden or not or if it should be.
Top
Methods
Name | Description
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace