Tekla Open API Reference for Tekla Structures 2025
PourObjectFilterExpressions.CustomBoolean Class
 The CustomBoolean class represents a custom Boolean filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.BooleanFilterExpression
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.CustomBoolean
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CustomBoolean : BooleanFilterExpression
<SerializableAttribute>
Public Class CustomBoolean
	Inherits BooleanFilterExpression
The PourObjectFilterExpressions.CustomBoolean type exposes the following members.
Constructors
Name | Description
PourObjectFilterExpressions.CustomBoolean
 Initializes a new instance of the CustomBoolean class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace