Tekla Open API Reference for Tekla Structures 2025
Part Properties
The Part type exposes the following members.
Properties
Name | Description
AssemblyNumber
 Gets or sets the assembly number. Defines the numbering in the assembly sense.
CastUnitType
 Gets or sets the cast unit type of the part.
Class
 Gets or sets the class of the part.
DeformingData
 Gets or sets the deforming data of the part.
Finish
 Gets or sets the finish of the part.
Material
 Gets or sets the material the part is made of.
Name
 Gets or sets the name of the part.
PartNumber
 Gets or sets the part number. Defines the numbering in the part sense.
Position
 Gets or sets the part position. Defines the way the part is positioned in the model.
PourPhase
 Gets or sets the pour phase of the part.
Profile
 Gets or sets the profile of the part.
Top
See Also
Reference
Part Class
Tekla.Structures.Model Namespace