Tekla Open API Reference for Tekla Structures 2025
ControlPolycurve Methods
The ControlPolycurve type exposes the following members.
Methods
Name | Description
Delete
 Deletes a polycurve with given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts a polycurve into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies a polycurve with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects a polycurve with the given Identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
ControlPolycurve Class
Tekla.Structures.Model Namespace