Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetOrthogonal Methods
The CurvedDimensionSetOrthogonal type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
See Also
Reference
CurvedDimensionSetOrthogonal Class
Tekla.Structures.Drawing Namespace