Tekla Open API Reference for Tekla Structures 2025
GridSurface Methods
The GridSurface type exposes the following members.
Methods
Name | Description
Delete
 Deletes the grid surface with the given ID.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the grid surface into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the grid surface with the given ID.
 (Overrides ModelObject.Modify().)
Select
 Selects the grid surface with the given ID.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
GridSurface Class
Tekla.Structures.Model Namespace