Tekla Open API Reference for Tekla Structures 2025
DimensionLink Methods
The DimensionLink type exposes the following members.
Methods
Name | Description
Delete
 Unlinks the dimensions in the current drawing.
 (Overrides DatabaseObject.Delete().)
GetDimension1
 Gets the first one of the linked dimensions.
GetDimension2
 Gets the second one of the linked dimensions.
Insert
 Links the dimensions in the drawing.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing DimensionLink from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
DimensionLink Class
Tekla.Structures.Drawing Namespace