Tekla Open API Reference for Tekla Structures 2025
HierarchicObject Properties
The HierarchicObject type exposes the following members.
Properties
Name | Description
Definition
 The hierarchical definition which the hierarchical object is associated with.
Father
 The father of the hierarchical object.
HierarchicChildren
 An array list that contains the hierarchical object's hierarchical children (of the type hierarchical object).
Name
 The name of the hierarchical object.
Top
See Also
Reference
HierarchicObject Class
Tekla.Structures.Model Namespace