Tekla Open API Reference for Tekla Structures 2025
ReinforcingBarFilterExpressions.Position Class
 The Position class represents the position filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Position
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Position : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Position
	Inherits StringFilterExpression
The ReinforcingBarFilterExpressions.Position type exposes the following members.
Constructors
Name | Description
ReinforcingBarFilterExpressions.Position
 Initializes a new instance of the Position class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace