Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionBase.GetDimensionSet Method
Overload List
Name | Description
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet().)
Top
See Also
Reference
CurvedDimensionBase Class
Tekla.Structures.Drawing Namespace