Tekla Open API Reference for Tekla Structures 2025
Circle.CircleAttributes Class
 The CircleAttributes class is the attributes class of the circle.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes
 Tekla.Structures.Drawing.Circle.CircleAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CircleAttributes : ClosedGraphicObject.ClosedGraphicObjectAttributes
<SerializableAttribute>
Public NotInheritable Class CircleAttributes
	Inherits ClosedGraphicObject.ClosedGraphicObjectAttributes
The Circle.CircleAttributes type exposes the following members.
Constructors
Name | Description
Circle.CircleAttributes()
 Creates a new default circle attributes instance that loads standard attributes.
Circle.CircleAttributes(String)
 Creates a new circle attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace