Tekla Open API Reference for Tekla Structures 2025
Detail Properties
The Detail type exposes the following members.
Properties
Name | Description
AutoDirectionType
 The auto direction type. Default value is AUTODIR_DETAIL. Value should be AUTODIR_NA to set direction with UpVector property. Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with detail attribute file.
Class
 The class of the detail.
Code
 The code of the detail. The code can be used to classify the detail. The code can be reported and shown in drawings. The maximum length of the string is 20 characters.
DetailType
 The detail type.
PositionType
 The position type.
Status
 The read only status of the detail. The status can be reported and shown in drawings. The color of the detail symbol in the model indicates the status of the detail.
UpVector
 A vector indicating which direction is considered the up direction.
Top
See Also
Reference
Detail Class
Tekla.Structures.Model Namespace