Tekla Open API Reference for Tekla Structures 2025
MarkSet Class
 The MarkSet class defines mark set objects that contain several mark objects merged to one mark set.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.MarkBase
 Tekla.Structures.Drawing.MarkSet
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class MarkSet : MarkBase
<SerializableAttribute>
Public Class MarkSet
	Inherits MarkBase
The MarkSet type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the mark set attributes.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 Mark sets cannot be inserted.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace