Tekla Open API Reference for Tekla Structures 2025
WeldMark Methods
The WeldMark type exposes the following members.
Methods
Name | Description
Delete
 Deletes the weld mark from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Returns the axis aligned bounding box of the weld mark (rectangle format).
GetObjectAlignedBoundingBox
 Returns the object aligned bounding box of the weld mark (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
Insert
 NOT YET IMPLEMENTED. Welding marks connected with welds in the model database appear when drawing views are created/updated. Weld marks created with drawing editor UI cannot be inserted with API code.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the weld mark in the current drawing database. Attributes can be modified with .wel setting files.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object using the move vector.
Select
 Selects the weld mark from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
WeldMark Class
Tekla.Structures.Drawing Namespace