Tekla Open API Reference for Tekla Structures 2025
ExtensionIntersectsWithPlateException Class
 The ExtensionIntersectsWithPlateException class represents an error when extension plate clashes with plates.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.ExtensionIntersectsWithPlateException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ExtensionIntersectsWithPlateException : ConnectiveGeometryException
<SerializableAttribute>
Public Class ExtensionIntersectsWithPlateException
	Inherits ConnectiveGeometryException
The ExtensionIntersectsWithPlateException type exposes the following members.
Constructors
Name | Description
ExtensionIntersectsWithPlateException
 Initializes a new instance of the ExtensionIntersectsWithPlateException class with "extension plate clashes with plates" error message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace