Tekla Open API Reference for Tekla Structures 2025
StringConstantFilterExpression Class
 The StringConstantFilterExpression class represents a constant string filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringConstantFilterExpression
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class StringConstantFilterExpression : DataFilterExpression
<SerializableAttribute>
Public NotInheritable Class StringConstantFilterExpression
	Inherits DataFilterExpression
The StringConstantFilterExpression type exposes the following members.
Constructors
Name | Description
StringConstantFilterExpression(IEnumerable<String>)
 Initializes a new instance of the StringConstantFilterExpression class.
StringConstantFilterExpression(String)
 Initializes a new instance of the StringConstantFilterExpression class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace