Tekla Open API Reference for Tekla Structures 2025
ContourPoint Class
 The ContourPoint class defines a point with possible chamfering information, used, for example, to define a contour plate.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Point
 Tekla.Structures.Model.ContourPoint
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ContourPoint : Point
<SerializableAttribute>
Public NotInheritable Class ContourPoint
	Inherits Point
The ContourPoint type exposes the following members.
Constructors
Name | Description
ContourPoint()
 Creates a new contour point instance.
ContourPoint(Point, Chamfer)
 Creates a new contour point using the given point and chamfer.
Top
Properties
Name | Description
Chamfer
 The chamfer for the contour point.
Top
Methods
Name | Description
SetPoint
 Sets the point's coordinates for the contour point.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace