Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet Properties
The StraightDimensionSet type exposes the following members.
Properties
Name | Description
Attributes
 The straight dimension set attributes.
Distance
 The distance from the first dimension point to the dimension line. The distance is measured in paper millimeters.
LeftTagLineOffset
 The offset of the left tag line. The offset is measured in paper millimeters.
RightTagLineOffset
 The offset of the right tag line. The offset is measured in paper millimeters.
Top
See Also
Reference
StraightDimensionSet Class
Tekla.Structures.Drawing Namespace