Tekla Open API Reference for Tekla Structures 2025
DrawingObject Class
 The DrawingObject class is an abstract base class for all the objects in the drawing. All drawing objects have a database identifier and belong to some view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 More...
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class DrawingObject : DatabaseObject,
	IIsEqual, IRelatedObjects
<SerializableAttribute>
Public MustInherit Class DrawingObject
	Inherits DatabaseObject
	Implements IIsEqual, IRelatedObjects
The DrawingObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
Top
Methods
Name | Description
GetDrawing
 Gets the drawing where the drawing object is.
GetRelatedObjects()
 Gets the related objects of the current object.
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
GetView
 Gets the view where the drawing object is.
IsEqual
 Compares the current object with the given object. Checks every field of both objects for equality.
ToString
 Changes the string presentation of the drawing object.
 (Overrides Object.ToString().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DetailMark
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.DimensionLink
 Tekla.Structures.Drawing.DimensionSetBase
 Tekla.Structures.Drawing.EmbeddedObjectBase
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.LeaderLine
 Tekla.Structures.Drawing.LevelMark
 Tekla.Structures.Drawing.LinkBase
 Tekla.Structures.Drawing.MarkBase
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.Plugin
 Tekla.Structures.Drawing.SectionMarkBase
 Tekla.Structures.Drawing.Symbol
 Tekla.Structures.Drawing.Text
 Tekla.Structures.Drawing.ViewBase
 Tekla.Structures.Drawing.WeldMark