Tekla Open API Reference for Tekla Structures 2025
Arc Class
 The Arc class defines an arc that is a two-point line with an optional curve radius. It can be created using either two points and a radius or three points.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.OpenGraphicObject
 Tekla.Structures.Drawing.Arc
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Arc : OpenGraphicObject
<SerializableAttribute>
Public NotInheritable Class Arc
	Inherits OpenGraphicObject
The Arc type exposes the following members.
Constructors
Name | Description
Arc(ViewBase, Point, Point, Double)
 Creates a new arc instance with standard attributes and the given two points and radius.
Arc(ViewBase, Point, Point, Point)
 Creates a new arc instance with standard attributes and the given three points.
Arc(ViewBase, Point, Point, Double, Arc.ArcAttributes)
 Creates a new arc instance with the given two points, radius and specified attributes.
Arc(ViewBase, Point, Point, Point, Arc.ArcAttributes)
 Creates a new arc instance with the given three points and specified attributes.
Top
Properties
Name | Description
Attributes
 The attributes of the arc.
EndPoint
 The end point of the arc.
Radius
 The radius of the arc.
StartPoint
 The start point of the arc.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if(MyDrawingHandler.GetConnectionStatus())
           {
               Arc MyArc;
               DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
               while(views.MoveNext())
               {
                   MyArc = new Arc(views.Current as ViewBase, new Point(10, 10), new Point(200, 200), 300);
                   MyArc.Insert();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace