Tekla Open API Reference for Tekla Structures 2025
Beam Methods
The Beam type exposes the following members.
Methods
Name | Description
Delete
 Deletes the beam instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the beam into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing beam in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a beam from the model database. The beam identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Beam Class
Tekla.Structures.Model Namespace