Tekla Open API Reference for Tekla Structures 2025
GraphicObjectHatchAttributes Class
 The GraphicObjectHatchAttributes class contains hatch attributes for graphic object hatches.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.HatchAttributes
 Tekla.Structures.Drawing.GraphicObjectHatchAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class GraphicObjectHatchAttributes : HatchAttributes
<SerializableAttribute>
Public NotInheritable Class GraphicObjectHatchAttributes
	Inherits HatchAttributes
The GraphicObjectHatchAttributes type exposes the following members.
Properties
Name | Description
OffsetX
 The offset from the origin in the X-direction.
OffsetY
 The offset from the origin in the Y-direction.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace