Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroupAttributes Properties
The ReinforcementBase.ReinforcementSetGroupAttributes type exposes the following members.
Properties
Name | Description
HookedEndSymbolType
 Gets or sets how the hooked ends of reinforcing bars should look like.
ReinforcementVisibility
 Gets or sets which bars in the group appear in drawings.
StraightEndSymbolType
 Gets or sets how the straight ends of reinforcing bars should look like.
Top
See Also
Reference
ReinforcementBase.ReinforcementSetGroupAttributes Class
Tekla.Structures.Drawing Namespace