Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer Methods
The EdgeChamfer type exposes the following members.
Methods
Name | Description
Delete
 Deletes the drawing chamfer from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the drawing chamfer.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing chamfer from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
EdgeChamfer Class
Tekla.Structures.Drawing Namespace