Tekla Open API Reference for Tekla Structures 2025
WeldFilterExpressions.SizeBelowLine Class
 The SizeBelowLine class represents the size below line filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.SizeBelowLine
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SizeBelowLine : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class SizeBelowLine
	Inherits NumericFilterExpression
The WeldFilterExpressions.SizeBelowLine type exposes the following members.
Constructors
Name | Description
WeldFilterExpressions.SizeBelowLine
 Initializes a new instance of the SizeBelowLine class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace