Tekla Open API Reference for Tekla Structures 2025
CurvedSectionMark Properties
The CurvedSectionMark type exposes the following members.
Properties
Name | Description
MiddlePoint
 The middle arc point of a curved section mark.
Top
See Also
Reference
CurvedSectionMark Class
Tekla.Structures.Drawing Namespace