Tekla Open API Reference for Tekla Structures 2025
GraphicObjectHatchAttributes Properties
The GraphicObjectHatchAttributes type exposes the following members.
Properties
Name | Description
OffsetX
 The offset from the origin in the X-direction.
OffsetY
 The offset from the origin in the Y-direction.
Top
See Also
Reference
GraphicObjectHatchAttributes Class
Tekla.Structures.Drawing Namespace