Tekla Open API Reference for Tekla Structures 2025
Fitting Methods
The Fitting type exposes the following members.
Methods
Name | Description
Delete
 Deletes the fitting instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the fitting into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing fitting in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a fitting from the model database. The fitting ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Fitting Class
Tekla.Structures.Model Namespace