Tekla Open API Reference for Tekla Structures 2025
Grid Class
 The Grid class contains methods related to grids. A drawing grid is inserted/removed using the view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.Grid
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Grid : ModelObject, IHasChildren
<SerializableAttribute>
Public NotInheritable Class Grid
	Inherits ModelObject
	Implements IHasChildren
The Grid type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the grid. For more information see Grid.GridAttributes.
Top
Methods
Name | Description
Delete
 Grids cannot be deleted.
 (Overrides DatabaseObject.Delete().)
GetObjects()
 Retrieves a DrawingObjectEnumerator for all the grid lines of the grid.
GetObjects(Type[])
 Retrieves a DrawingObjectEnumerator for all the grid lines of the grid that are of certain TypeFilter.
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Drawing MyDrawing = new GADrawing();
           View curview = new View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(),
               new AABB(new Point(), new Point(30000, 30000, 10000)));
           Grid curGrid;
           DrawingObjectEnumerator allObjects = curview.GetAllObjects();
           while(allObjects.MoveNext())
           {
               if(allObjects.Current is Grid)
               {
                   curGrid = allObjects.Current as Grid;
                   curGrid.Attributes.DrawTextAtTopOfGrid = true;
                   curGrid.Attributes.Font.Color = DrawingColors.Red;
                   curGrid.Modify(); /* Apply changes */
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace