Tekla Open API Reference for Tekla Structures 2025
Component Methods
The Component type exposes the following members.
Methods
Name | Description
Delete
 Deletes the component instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetAssembly
 Returns the assembly that the component belongs to.
GetBooleans
 Returns an enumerator of all the connected boolean objects.
GetComponentInput
 Returns the component input object.
GetComponents
 Returns an enumerator of all the connected components.
Insert
 Inserts the component into the model database. The component input needs to be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing component in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a component from the model database. The component ID must be set.
 (Overrides ModelObject.Select().)
SetComponentInput
 Sets the component input object for the component. The component input object contains all the input objects and positions that are needed for the component creation.
Top
See Also
Reference
Component Class
Tekla.Structures.Model Namespace