Tekla Open API Reference for Tekla Structures 2025
DetailMark Class
 The DetailMark class defines a drawing object that illustrates a detail in a specific view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DetailMark
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DetailMark : DrawingObject
<SerializableAttribute>
Public NotInheritable Class DetailMark
	Inherits DrawingObject
The DetailMark type exposes the following members.
Constructors
Name | Description
DetailMark(View, Point, Point, Point)
 Creates a new detail mark instance with the given positions.
DetailMark(View, Point, Point, Point, DetailMark.DetailMarkAttributes)
 Creates a new detail mark instance with the given positions and attributes.
Top
Properties
Name | Description
Attributes
 The attributes for the detail mark.
BoundaryPoint
 The boundary point of the mark.
CenterPoint
 The center point of the mark.
LabelPoint
 The label point of the mark.
Top
Methods
Name | Description
Delete
 Deletes the detail mark from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 Inserts the detail mark into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the detail mark in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the detail mark from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
Examples
 The following code inserts a new detail mark in the current drawing:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class DetailMarkExample
{
    public void DetailMarkInsert()
    {
        DrawingHandler myDrawingHandler = new DrawingHandler();
        if (myDrawingHandler.GetConnectionStatus())
        {
            DrawingObjectEnumerator viewsEnumerator = myDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
            View view = null;
            if (viewsEnumerator.MoveNext())
                view = viewsEnumerator.Current as View;
            if (view != null)
            {
                DetailMark detailMark = new DetailMark(view, new Point(50, 100), new Point(100, 150), new Point(200, 200));
                detailMark.Insert();
            }
        }
    }
}
See Also
Reference
Tekla.Structures.Drawing Namespace