Tekla Open API Reference for Tekla Structures 2025
PolyBeam Methods
The PolyBeam type exposes the following members.
Methods
Name | Description
AddContourPoint
 Adds a contour point to the polybeam.
Delete
 Deletes the polybeam instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetCenterLinePolycurve
 Get centerline as polycurve
GetPolybeamCoordinateSystems
 Returns a list of coordinate systems for the polybeam segments.
Insert
 Inserts the polybeam into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing polybeam in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a polybeam from the model database. The identifier of the polybeam must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
PolyBeam Class
Tekla.Structures.Model Namespace