Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadGroup Class
 The AnalysisLoadGroup class contains information related to analysis load groups.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisLoadGroup
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisLoadGroup : AnalysisObject
Public NotInheritable Class AnalysisLoadGroup
	Inherits AnalysisObject
The AnalysisLoadGroup type exposes the following members.
Constructors
Name | Description
AnalysisLoadGroup
 Initializes a new instance of the AnalysisLoadGroup class.
Top
Properties
Name | Description
Compatible
 Gets or sets a value indicating whether the load group is compatible.
CompatibleNumber
 Gets or sets the load group compatible number.
Direction
 Gets or sets the direction of the load group.
Incompatible
 Gets or sets a value indicating whether the load group is incompatible.
IncompatibleNumber
 Gets or sets the load group incompatible number.
LoadGroupID
 Gets or sets the identifier of the load group.
Name
 Gets or sets the name of the load group.
Type
 Gets or sets the type of the load group.
Top
Methods
Name | Description
GetTypeName
 Get load group type name, translated to current language.
IsEmpty
 Check if load group is empty (no loading exists).
IsSelfWeight
 Check if load group is self weight load group.
Select
 Selects an AnalysisLoadGroup. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace