Tekla Open API Reference for Tekla Structures 2025
Part Methods
The Part type exposes the following members.
Methods
Name | Description
CompareTo(Part)
 Compares the instantiated part with another one.
GetAssembly
 Returns the assembly that the part belongs to.
GetBolts
 Returns an enumerator of all the connected bolts.
GetBooleans
 Returns an enumerator of all the connected boolean objects.
GetCenterLine
 Returns the center line for the given part.
GetComponents
 Returns an enumerator of all the connected components, connections, seams and details inherited from the base component.
GetDSTVCoordinateSystem
 Get DSTV coordinate system.
GetPartMark
 Returns the part mark.
GetPours
 Returns an enumerator of all the pours that the part belongs to.
GetReferenceLine
 Returns the reference line for the given part.
GetReinforcements
 Returns an enumerator of all the connected reinforcements.
GetSolid()
 Returns the solid of the part.
GetSolid(FormingStates)
 Returns the solid of the part.
GetSolid(Solid.SolidCreationTypeEnum)
 Returns the solid of the part.
GetSurfaceObjects
 Returns an enumerator of all the connected surface objects.
GetSurfaceTreatments
 Returns an enumerator of all the connected surface treatments.
GetWelds
 Returns an enumerator of all the connected welds.
Top
See Also
Reference
Part Class
Tekla.Structures.Model Namespace