Tekla Open API Reference for Tekla Structures 2025
PourObjectFilterExpressions.PourPhase Class
 The PourPhase class represents the pour phase filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.PourPhase
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PourPhase : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class PourPhase
	Inherits StringFilterExpression
The PourObjectFilterExpressions.PourPhase type exposes the following members.
Constructors
Name | Description
PourObjectFilterExpressions.PourPhase
 Initializes a new instance of the PourPhase class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace