Tekla Open API Reference for Tekla Structures 2025
PickerInputThreePoints Class
 The PickerInputThreePoints class represents a pick of three points in a view. Used for values asked by UI.Picker.PickThreePoints(string FirstPrompt, string SecondPrompt, string ThirdPrompt, out Point FirstPickedPoint, out Point SecondPickedPoint, out Point ThirdPickedPoint, out ViewBase PickedView).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputWithinAView
 Tekla.Structures.Drawing.PickerInputPointsWithinAView
 Tekla.Structures.Drawing.PickerInputThreePoints
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PickerInputThreePoints : PickerInputPointsWithinAView
Public Class PickerInputThreePoints
	Inherits PickerInputPointsWithinAView
The PickerInputThreePoints type exposes the following members.
Constructors
Name | Description
PickerInputThreePoints
 Creates a new PickerInputThreePoints instance with one point selected in a view.
Top
Properties
Name | Description
FirstPickedPoint
 The first picked point in the view coordinates.
SecondPickedPoint
 The second picked point in the view coordinates.
ThirdPickedPoint
 The third picked point in the view coordinates.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PickerInputPointsWithinAView.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace