Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadial Class
 The CurvedDimensionSetRadial class defines a curved dimension set with radial reference lines.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionSetBase
 Tekla.Structures.Drawing.CurvedDimensionSetBase
 Tekla.Structures.Drawing.CurvedDimensionSetRadial
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedDimensionSetRadial : CurvedDimensionSetBase
<SerializableAttribute>
Public NotInheritable Class CurvedDimensionSetRadial
	Inherits CurvedDimensionSetBase
The CurvedDimensionSetRadial type exposes the following members.
Properties
Name | Description
Attributes
 The curved dimension set radial attributes.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
Examples
 The following code asks the user to pick three points and then creates a dimension between the points with a 50 mm distance:
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.UI;
using Tekla.Structures.Geometry3d;
public class Example
{
       static void PickPoints(int numberToPick, ref PointList pointList, ref ViewBase view)
       {
           Picker picker = new DrawingHandler().GetPicker();
           Point point;
           while (--numberToPick != -1)
           {
               picker.PickPoint("Pick point", out point, out view);
               pointList.Add(point);
           }
       }
       static void CreateDimension()
       {
           double Distance = 50.0;
           PointList pointList = new PointList();
           ViewBase view = null;
           PickPoints(3, ref pointList, ref view);
           new CurvedDimensionSetHandler().CreateCurvedDimensionSetRadial(view,
                                                                          pointList[0],
                                                                          pointList[1],
                                                                          pointList[2],
                                                                          pointList,
                                                                          Distance);
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace