Tekla Open API Reference for Tekla Structures 2025
Brep Methods
The Brep type exposes the following members.
Methods
Name | Description
Delete
 Deletes the brep instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the brep into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing brep in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a brep from the model database. The brep identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Brep Class
Tekla.Structures.Model Namespace