Tekla Open API Reference for Tekla Structures 2025
HyperLink Properties
The HyperLink type exposes the following members.
Properties
Name | Description
Target
 Gets or sets the target.
Top
See Also
Reference
HyperLink Class
Tekla.Structures.Drawing Namespace