Tekla Open API Reference for Tekla Structures 2025
Reinforcement Properties
The Reinforcement type exposes the following members.
Properties
Name | Description
Class
 Gets or sets the class of the reinforcement. The class is used to group reinforcements.
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
OFFSET_TYPE_COVER_THICKNESS
EndPointOffsetValue
 Gets or sets the concrete cover thickness or leg length at the second end of the bar.
Father
 Gets or sets the father object of the reinforcement; the model object instance to operate on.
FromPlaneOffset
 Gets or sets the offset value from the part surface.
Grade
 Gets or sets the steel grade of the reinforcing bar. The grade indicates the strength of the steel used in reinforcing bars. It can also indicate other factors, such as the weldability or surface deformations of the bar.
InputPointDeformingState
 Gets or sets the reinforcement input point deforming state.
Name
 Gets or sets the name of the reinforcement.
NumberingSeries
 Gets or sets the numbering series of the reinforcement.
OnPlaneOffsets
 Gets or sets the double offset value for each leg on the same plane as the bar.
RadiusValues
 Gets or sets the radius value(s) of the bends in the bar.
StartPointOffsetType
 Gets or sets the type of the start point offset is either OFFSET_TYPE_LEG_LENGTH or OFFSET_TYPE_COVER_THICKNESS.
StartPointOffsetValue
 Gets or sets the concrete cover thickness or leg length at the first end of the bar.
Top
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace