Tekla Open API Reference for Tekla Structures 2025
LinkBase Methods
The LinkBase type exposes the following members.
Methods
Name | Description
GetAxisAlignedBoundingBox
 Gets the bounding box for the current object in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Gets the bounding box for the current object in its local coordinate system.
MoveObjectRelative
 Moves the object according to the given move vector.
Resize
 Resizes the object. The scaling type is changed to ScaleToFit.
Top
See Also
Reference
LinkBase Class
Tekla.Structures.Drawing Namespace