Tekla Open API Reference for Tekla Structures 2025
LogicalAreaFilterExpressions.Section Class
 The Section class represents the section filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Section
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Section : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Section
	Inherits StringFilterExpression
The LogicalAreaFilterExpressions.Section type exposes the following members.
Constructors
Name | Description
LogicalAreaFilterExpressions.Section
 Initializes a new instance of the Section class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace