Tekla Open API Reference for Tekla Structures 2025
GridLine Methods
The GridLine type exposes the following members.
Methods
Name | Description
Delete
 GridLines cannot be deleted.
 (Overrides DatabaseObject.Delete().)
Insert
 GridLines cannot be inserted.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
GridLine Class
Tekla.Structures.Drawing Namespace