Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionOrthogonal Properties
The CurvedDimensionOrthogonal type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the curved dimension set orthogonal attributes.
Top
See Also
Reference
CurvedDimensionOrthogonal Class
Tekla.Structures.Drawing Namespace