Tekla Open API Reference for Tekla Structures 2025
Plugin Methods
The Plugin type exposes the following members.
Methods
Name | Description
ApplyStandardValues
 Applies the values of the specified file as the default values for the dialog belonging to this plug-in. This will affect each Insert call of the plug-ins with the same name.
Delete
 Deletes the plug-in from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetDoubleAttribute
 Gets the value of the specified double attribute of the plug-in.
GetIntAttribute
 Gets the value of the specified int attribute of the plug-in.
GetStringAttribute
 Gets the value of the specified string attribute of the plug-in.
Insert
 Inserts the plug-in into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
LoadStandardValues
 Sets the values from the specified file to this plug-in.
Modify
 Modifies the plug-in in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the plug-in from the current drawing database.
 (Overrides DatabaseObject.Select().)
SetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetPickerInput
 Defines the sequence of inputs to use in place of interactive picks when the plug-in is inserted to a drawing.
TryGetAttribute(String, Double)
 Gets the value of the specified double attribute of the plug-in.
TryGetAttribute(String, Int32)
 Gets the value of the specified int attribute of the plug-in.
TryGetAttribute(String, String)
 Gets the value of the specified string attribute of the plug-in.
TrySetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
Top
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace