Tekla Open API Reference for Tekla Structures 2025
RebarStrand Properties
The RebarStrand type exposes the following members.
Properties
Name | Description
EndPoint
 The end point of the single strand (the start point and end point define the length of the strand).
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
OnPlaneOffsets
 Not supported.
Patterns
 An array list of polygons that represents the patterns of the rebar strand. Give the strand positions in the same order as for the first pattern. The maximum number of patterns is 20.
PullPerStrand
 The pull per strand (N).
Size
 The size of the reinforcement.
StartPoint
 The start point of the single strand (the start point and end point define the length of the strand).
Unbondings
 An array list of StrandUnbondingData items.
Top
See Also
Reference
RebarStrand Class
Tekla.Structures.Model Namespace