Tekla Open API Reference for Tekla Structures 2025
ReinforcingBarFilterExpressions.Length Class
 The Length class represents the length filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Length
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Length : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class Length
	Inherits NumericFilterExpression
The ReinforcingBarFilterExpressions.Length type exposes the following members.
Constructors
Name | Description
ReinforcingBarFilterExpressions.Length
 Initializes a new instance of the Length class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace