Tekla Open API Reference for Tekla Structures 2025
TaskDependency Class
 The TaskDependency class represents a dependency between two task objects. Each task may depend on many other tasks, but between two specific tasks only one type of a dependency may exist.
 There are four types of dependencies:
FINISH_TO_FINISH (FF)
FINISH_TO_START (FS)
START_TO_FINISH (SF)
START_TO_START (SS)
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.TaskDependency
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class TaskDependency : ModelObject
<SerializableAttribute>
Public NotInheritable Class TaskDependency
	Inherits ModelObject
The TaskDependency type exposes the following members.
Constructors
Name | Description
TaskDependency()
 Creates a new task dependency instance.
TaskDependency(Task, Task)
 Creates a new task dependency instance with the given primary and secondary tasks.
Top
Properties
Name | Description
DependencyType
 The type of the task dependency.
Lag
 The lag of the task dependency represented in whole hours.
Local
 The locality indicates if the dependency was created in Tekla Structures and Task Manager or imported.
Primary
 The primary task of the task dependency.
Secondary
 The secondary task of the task dependency.
Top
Methods
Name | Description
Delete
 Deletes the task dependency instance from the model.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the task dependency instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the task dependency instance in the model. The identifier must be set.
 (Overrides ModelObject.Modify().)
Select
 Selects the task dependency instance from the model. The identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Tekla.Structures.Model Namespace