Tekla Open API Reference for Tekla Structures 2025
ReinforcementStrand Class
 The ReinforcementStrand class defines a reinforcement mesh in the drawing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.ReinforcementBase
 Tekla.Structures.Drawing.ReinforcementStrand
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ReinforcementStrand : ReinforcementBase
<SerializableAttribute>
Public Class ReinforcementStrand
	Inherits ReinforcementBase
The ReinforcementStrand type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementStrandAttributes.
ReinforcementCustomPosition
 Defines the location of the reinforcement bar when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized. This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace