Tekla Open API Reference for Tekla Structures 2025
Vector Methods
The Vector type exposes the following members.
Methods
Name | Description
Cross(Vector)
 Returns a new cross product vector of the current vector and the given vector.
Cross(Vector, Vector)
 Returns a new cross product vector of the given two vectors.
Dot(Vector)
 Returns a dot product of the current vector and the given vector.
Dot(Vector, Vector)
 Returns a dot product of the given two vectors.
GetAngleBetween
 Gets the angle (in radians) between the current vector and the given vector.
GetLength
 Gets the length (magnitude) of a vector.
GetNormal
 Returns a new normalized equivalent of the current vector.
Normalize()
 Normalizes the vector using the length 1.0 (the length of a unit vector).
Normalize(Double)
 Normalizes the vector using the given length.
ToString
 Formats the 3D vector into a string with fixed decimals, in the following way: "(X, Y, Z)".
 (Overrides Point.ToString().)
Top
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace