Tekla Open API Reference for Tekla Structures 2025
StringFilterExpression Class
 The StringFilterExpression class represents a string filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 More...
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class StringFilterExpression : DataFilterExpression
<SerializableAttribute>
Public Class StringFilterExpression
	Inherits DataFilterExpression
The StringFilterExpression type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Guid
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.IdNumber
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Level
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Name
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Phase
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.PositionNumber
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Prefix
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Series
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.StartNumber
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Type
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.SiteWorkshop
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.Standard
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.ConnectionCode
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.Name
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.RunningNumber
 Tekla.Structures.Filtering.Categories.ConstructionObjectFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.LoadFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.LoadFilterExpressions.Group
 Tekla.Structures.Filtering.Categories.LoadFilterExpressions.Type
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Building
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Section
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Site
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Story
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.Guid
 Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.CategoryName
 Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.EntityName
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.Finish
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.Material
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.Name
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.NumberingSeries
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.PositionNumber
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.Prefix
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.PrimaryPart
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.Profile
 Tekla.Structures.Filtering.Categories.PourBreakFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.ConcreteMixture
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.Material
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.PourNumber
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.PourPhase
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.PourType
 Tekla.Structures.Filtering.Categories.PourUnitFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.PourUnitFilterExpressions.Guid
 Tekla.Structures.Filtering.Categories.PourUnitFilterExpressions.Name
 Tekla.Structures.Filtering.Categories.ReferenceObjectFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.JoinType
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Material
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Name
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.NumberingSeries
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Position
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.PositionNumber
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Prefix
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Shape
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Size
 Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.Name
 Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.Type
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.Critical
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.Local
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.Name
 Tekla.Structures.Filtering.Categories.TemplateFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.CustomString
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.PositionNumber
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.ReferenceText