Tekla Open API Reference for Tekla Structures 2025
SpiralBeam Class
 A class for the spiral beam part.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Part
 Tekla.Structures.Model.SpiralBeam
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class SpiralBeam : Part
<SerializableAttribute>
Public Class SpiralBeam
	Inherits Part
The SpiralBeam type exposes the following members.
Constructors
Name | Description
SpiralBeam()
 Initializes a new instance of the SpiralBeam class.
SpiralBeam(Point, Point, Double, Double)
 Initializes a new instance of the SpiralBeam class with the given parameters. Rotation axis direction is current positive Z direction.
SpiralBeam(Point, Point, Point, Double, Double)
 Initializes a new instance of the SpiralBeam class with the given parameters.
SpiralBeam(Point, Point, Point, Double, Double, Double, Double)
 Initializes a new instance of the SpiralBeam class with the given parameters.
Top
Properties
Name | Description
EndPoint
 Gets the spiral beam end point.
RotationAngle
 Gets or sets the rotation of the spiral beam in degrees. Each range of 360.0 degrees adds a full rotation.
RotationAxisBasePoint
 Gets or sets the first definition point of the spiral beam rotation axis.
RotationAxisDirection
 Gets the direction of the spiral beam rotation axis.
RotationAxisUpPoint
 Gets or sets the second definition point of the spiral beam rotation axis.
RotationCenterPoint
 Gets the geometric rotation center point at the start of the spiral beam.
StartPoint
 Gets or sets the start point of the spiral beam.
TotalRise
 Gets or sets the difference between the spiral beam start and end point in the direction of the rotation axis.
TwistAngleEnd
 Gets or sets the twist angle in degrees at the end of the spiral beam.
TwistAngleStart
 Gets or sets the twist angle in degrees at the start of the spiral beam.
Top
Methods
Name | Description
Delete
 Deletes the spiral beam with this instance identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the spiral beam into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the spiral beam object values in the database.
 (Overrides ModelObject.Modify().)
Select
 Selects a spiral beam object from the database.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public bool SimpleExample()
       {
           var startPoint = new Point(0.0, 0.0, 0.0);
           var centerPoint = new Point(200.0, 0.0, 0.0);
           var totalRise = 100.0;
           var rotationAngle = 90.0;
           SpiralBeam spiral = new SpiralBeam(startPoint, centerPoint, totalRise, rotationAngle);
           spiral.Profile.ProfileString = "U300";
           return spiral.Insert();
       }
       public bool FullExample()
       {
           var startPoint = new Point(0.0, 0.0, 0.0);
           var rotationAxisPoint1 = new Point(200.0, 0.0, 0.0);
           var rotationAxisPoint2 = new Point(200.0, 0.0, 1000.0);
           var totalRise = 1000.0;
           var rotationAngle = 1080.0;
           var twistAngleStart = 10.0;
           var twistAngleEnd = 30.0;
           SpiralBeam spiral = new SpiralBeam(startPoint, rotationAxisPoint1, rotationAxisPoint2, totalRise, rotationAngle, twistAngleStart, twistAngleEnd);
           spiral.Profile.ProfileString = "HEA400";
           spiral.Material.MaterialString = "Steel_Undefined";
           bool result = spiral.Insert();
           return result;
       }
}
See Also
Reference
Tekla.Structures.Model Namespace