Tekla Open API Reference for Tekla Structures 2025
PickerInputPointsWithinAView Class
 The PickerInputPointsWithinAView class is the base class of PickerInput instances that represent a pick of one or more points in a view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputWithinAView
 Tekla.Structures.Drawing.PickerInputPointsWithinAView
 Tekla.Structures.Drawing.PickerInputNPoints
 Tekla.Structures.Drawing.PickerInputPoint
 Tekla.Structures.Drawing.PickerInputThreePoints
 Tekla.Structures.Drawing.PickerInputTwoPoints
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract class PickerInputPointsWithinAView : PickerInputWithinAView
Public MustInherit Class PickerInputPointsWithinAView
	Inherits PickerInputWithinAView
The PickerInputPointsWithinAView type exposes the following members.
Constructors
Name | Description
PickerInputPointsWithinAView
 Creates a new PickerInputPointsWithinAView instance representing N points selected in a view.
Top
Properties
Name | Description
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PickerInputWithinAView.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace