Tekla Open API Reference for Tekla Structures 2025
ControlArc Methods
The ControlArc type exposes the following members.
Methods
Name | Description
Delete
 Deletes the control arc with the given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control arc into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control arc with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the control arc with the given Identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
ControlArc Class
Tekla.Structures.Model Namespace