Tekla Open API Reference for Tekla Structures 2025
LoadPoint Class
 The LoadPoint class defines a concentrated force or a bending moment.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Load
 Tekla.Structures.Model.LoadPoint
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LoadPoint : Load
<SerializableAttribute>
Public NotInheritable Class LoadPoint
	Inherits Load
The LoadPoint type exposes the following members.
Constructors
Name | Description
LoadPoint
 Creates a new load point instance.
Top
Properties
Name | Description
Moment
 The moment vector. The values are given in the local coordinate system of the load (not in the current coordinate system).
P
 The load vector. The values are given in the local coordinate system of the load (not in the current coordinate system).
Position
 The position.
Top
Methods
Name | Description
Delete
 Deletes the load point instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the load point into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing load point in the model database to match the current one. At the moment it is not possible to change the load attachment or the father.
 (Overrides ModelObject.Modify().)
Select
 Selects a load point from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           Beam FatherBeam = new Beam(new Point(3000,6000,0), new Point(4000,6000,0));
           if (!FatherBeam.Insert())
               Console.WriteLine("Father Beam Insert failed!");
           LoadPoint L = new LoadPoint();
           L.P = new Vector(3000,4000,5000);
           L.Moment = new Vector(6000,7000,8000);
           L.Position = new Point(3000,6000,0);
           L.FatherId = FatherBeam.Identifier;
           L.AutomaticPrimaryAxisWeight = true;
           L.BoundingBoxDx = 500;
           L.BoundingBoxDy = 500;
           L.BoundingBoxDz = 500;
           L.LoadDispersionAngle = 1;
           L.PartFilter = "testing";
           L.PartNames = Load.LoadPartNamesEnum.LOAD_PART_NAMES_INCLUDE;
           L.PrimaryAxisDirection = new Vector(1000, 500, 0);
           L.Spanning = Load.LoadSpanningEnum.LOAD_SPANNING_SINGLE;
           L.Weight = 2;
           L.CreateFixedSupportConditionsAutomatically = true;
           if (!L.Insert())
               Console.WriteLine("LoadPoint Insert failed!");
       }
}
See Also
Reference
Tekla.Structures.Model Namespace