Tekla Open API Reference for Tekla Structures 2025
FilterExpression Class
 The FilterExpression class represents a filter expression. This is a base class for other filter expressions and should not be used directly.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.FilterExpression
 Tekla.Structures.Filtering.BinaryFilterExpression
 Tekla.Structures.Filtering.BinaryFilterExpressionCollection
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class FilterExpression : Expression
<SerializableAttribute>
Public MustInherit Class FilterExpression
	Inherits Expression
The FilterExpression type exposes the following members.
Properties
Name | Description
IsEnable
 Gets or sets the enabled state of the filter expression.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace
Tekla.Structures.Filtering.BinaryFilterExpression
Tekla.Structures.Filtering.BinaryFilterExpressionCollection