Tekla Open API Reference for Tekla Structures 2025
DetailMark Methods
The DetailMark type exposes the following members.
Methods
Name | Description
Delete
 Deletes the detail mark from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 Inserts the detail mark into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the detail mark in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the detail mark from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
DetailMark Class
Tekla.Structures.Drawing Namespace