Tekla Open API Reference for Tekla Structures 2025
PourBreak Class
 The PourBreak class contains methods related to pour breaks. A pour break is a drawing object derived from a model object. It represents a drawing pour break that has a reference to the actual pour break in the model database.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.PourBreak
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PourBreak : ModelObject
<SerializableAttribute>
Public NotInheritable Class PourBreak
	Inherits ModelObject
The PourBreak type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the pour break. For more information see PourBreak.PourBreakAttributes.
Top
Methods
Name | Description
Delete
 Deletes the drawing pour break from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the drawing pour break.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing pour break from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
    public void Example1()
    {
        Drawing MyDrawing = new GADrawing();
        View curview = new View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(),
                                    new AABB(new Point(), new Point(30000, 30000, 10000)));
        PourBreak curBreak;
        DrawingObjectEnumerator allObjects = curview.GetAllObjects();
        while(allObjects.MoveNext())
        {
            if(allObjects.Current is PourBreak)
            {
                curBreak = allObjects.Current as PourBreak;
                pourBreak.Attributes.VisibleLines = new LineTypeAttributes(LineTypes.DashDoubleDot,
                                                                           DrawingColors.Blue);
                curBreak.Modify(); /* Apply changes */
            }
        }
    }
}
See Also
Reference
Tekla.Structures.Drawing Namespace