Tekla Open API Reference for Tekla Structures 2025
BooleanPart Class
 The BooleanPart class represents a part cut or an add. This means that a model object is, for example, cut with a part instance to create a void to the father part. Typically the operative part is deleted after the boolean cut operation. In case of boolean add, operative part is deleted automatically.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Boolean
 Tekla.Structures.Model.BooleanPart
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BooleanPart : Boolean
<SerializableAttribute>
Public NotInheritable Class BooleanPart
	Inherits Boolean
The BooleanPart type exposes the following members.
Constructors
Name | Description
BooleanPart
 Instantiates an empty cut operation.
Top
Properties
Name | Description
OperativePart
 The part that does the boolean operation. When Insert() is called, this field is overwritten with a new part instance which is a copy of the original operative part. This part has the same identifier as the boolean part. Modifications (such as profile change) have to be made through the part instance and not the boolean part instance. The operative part's class must be BooleanOperativeClass.
Type
 Defines the boolean operation: an add or a cut.
Top
Methods
Name | Description
Delete
 Deletes the boolean part instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the boolean part into the model database. All the attributes must be set. The operative part is overwritten by a copy of the original part.
 (Overrides ModelObject.Insert().)
Modify
 Currently it is not possible to modify the boolean part as there is nothing that can be modified for it. Calling this function will actually call modify for the operative part member.
 (Overrides ModelObject.Modify().)
Select
 Selects a boolean part from the model database. The part ID must be set.
 (Overrides ModelObject.Select().)
SetOperativePart
 Sets the part to operate with. The operative part's class member must be defined to be BooleanOperativeClass.
Top
Fields
Name | Description
BooleanOperativeClassName
 A constant string that defines a part class name to be the boolean operative part. This class must be used when inserting the operative part to the database.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           Point point = new Point(0, 7000, 0);
           Point point2 = new Point(1000, 7000, 0);
           Beam Beam1 = new Beam();
           Beam1.StartPoint = point;
           Beam1.Profile.ProfileString = "400*400";
           Beam1.EndPoint = point2;
           Beam1.Insert();
           Beam Beam2 = new Beam();
           Beam2.Profile.ProfileString = "400*400";
           Beam2.StartPoint = new Point(500, 6000, 0);
           Beam2.EndPoint = new Point(500, 8000, 0);
           Beam2.Class = BooleanPart.BooleanOperativeClassName;
           Beam2.Insert();
           BooleanPart Beam = new BooleanPart();
           Beam.Father = Beam1;
           Beam.SetOperativePart(Beam2);
           // Beam.Type = BooleanPart.BooleanTypeEnum.BOOLEAN_ADD; // BOOLEAN_CUT is default type.
           if(!Beam.Insert())
               Console.WriteLine("Insert failed!");
           Beam2.Delete(); // Not needed when using BOOLEAN_ADD, operative part is deleted automatically.
       }
}
See Also
Reference
Tekla.Structures.Model Namespace