Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedBarLoad Properties
The AnalysisDecomposedBarLoad type exposes the following members.
Properties
Name | Description
CSCode
 The CS code of the decomposed bar load.
EndDistance
 The end distance of the decomposed bar load.
EndValue
 The end value of the decomposed bar load.
StartDistance
 The start distance of the decomposed bar load.
StartValue
 The start value of the decomposed bar load.
Top
See Also
Reference
AnalysisDecomposedBarLoad Class
Tekla.Structures.Analysis Namespace