Tekla Open API Reference for Tekla Structures 2025
ControlLine Properties
The ControlLine type exposes the following members.
Properties
Name | Description
Color
 The color of the control line.
Extension
 The extension of the control line.
IsMagnetic
 Determines whether the line is magnetic or not.
Line
 The line segment defining the position of the control line.
LineType
 The line type of the control line.
Top
See Also
Reference
ControlLine Class
Tekla.Structures.Model Namespace