Tekla Open API Reference for Tekla Structures 2025
LogicalAreaFilterExpressions.Story Class
 The Story class represents the story filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Story
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Story : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Story
	Inherits StringFilterExpression
The LogicalAreaFilterExpressions.Story type exposes the following members.
Constructors
Name | Description
LogicalAreaFilterExpressions.Story
 Initializes a new instance of the Story class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace