Tekla Open API Reference for Tekla Structures 2025
View.GetModelObjects Method
Overload List
Name | Description
GetModelObjects()
 Gets the model objects that are in the view.
Top
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace