Tekla Open API Reference for Tekla Structures 2025
TaskFilterExpressions.Local Class
 The Local class represents the local filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.Local
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Local : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Local
	Inherits StringFilterExpression
The TaskFilterExpressions.Local type exposes the following members.
Constructors
Name | Description
TaskFilterExpressions.Local
 Initializes a new instance of the Local class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace