Tekla Open API Reference for Tekla Structures 2025
Reinforcement Methods
The Reinforcement type exposes the following members.
Methods
Name | Description
GetAssembly
 Returns the assembly that the reinforcement belongs to.
GetFatherPour
 Returns the pour that the rebar is associated to.
GetFatherPourUnit
 Returns the pour unit that the rebar is associated to.
GetNumberOfRebars
 Returns the number of rebars in the reinforcing group.
GetRebarComplexGeometries(Boolean, Boolean, Boolean)
 Retrieves a list of physical reinforcing bars (of type RebarComplexGeometry). These objects contain physical curves in the 3D space of each reinforcing bar as shown in model view. RebarComplexGeometry only differs from RebarGeometry by containing a polycurve rather than a polyline.
GetRebarComplexGeometries(Boolean, Boolean, Boolean, Reinforcement.RebarGeometrySimplificationTypeEnum)
 Retrieves a list of physical reinforcing bars (of type RebarComplexGeometry). These objects contain physical curves in the 3D space of each reinforcing bar as shown in model view. RebarComplexGeometry only differs from RebarGeometry by containing a polycurve (of Arc and LineSegment objects) rather than a polyline. The polycurve only contains arcs if the "simplified" parameter is RATIONALIZED or FABRICATION. If "simplified" is NONE, any arcs will be returned as a series of line segments.
GetRebarGeometries(Boolean)
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar.
GetRebarGeometries(Reinforcement.RebarGeometryOptionEnum)
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar.
GetRebarGeometriesWithoutClashes
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar as shown in model view. In case rebar polygon clashes with itself, physical points are moved to avoid clashing.
GetSingleRebar
 Returns a single rebar inside the rebar group located by the given index. The indexing starts from the start point. The rebar represents a physical reinforcing bar and contains physical points in the 3D space of the bar. The method returns null on error, for example if given an erroneous index. The number of rebars in the group can be requested with GetNumberOfRebars().
GetSingleRebarWithoutClash
 Returns a single rebar inside the rebar group located by the given index. The indexing starts from the start point. The rebar represents a physical reinforcing bar and contains physical, non-clashing points in the 3D space of the bar. The method returns null on error, for example if given an erroneous index. The number of rebars in the group can be requested with GetNumberOfRebars().
GetSolid
 Method for getting the solid information of the reinforcement.
IsGeometryValid
 Tells whether the geometry of a reinforcement object is valid or not.
Top
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace