Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_CircleProfile Properties
The IFC2X3_ParametricObject_CircleProfile type exposes the following members.
Properties
Name | Description
Radius
 The radius.
Top
See Also
Reference
IFC2X3_ParametricObject_CircleProfile Class
Tekla.Structures.Model.Collaboration Namespace