Tekla Open API Reference for Tekla Structures 2025
AngleDimension Class
 The AngleDimension class defines an angle dimension between two lines. The dimension can be shown by a triangle or in degrees. You can also enter the triangle base length.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.AngleDimension
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class AngleDimension : DimensionBase
<SerializableAttribute>
Public NotInheritable Class AngleDimension
	Inherits DimensionBase
The AngleDimension type exposes the following members.
Constructors
Name | Description
AngleDimension(ViewBase, Point, Point, Point, Double)
 Creates a new angle dimension instance using three points.
AngleDimension(ViewBase, Point, Vector, Vector, Double)
 Creates a new angle dimension instance using the origin and two vectors relative to the origin.
AngleDimension(ViewBase, Point, Point, Point, Double, AngleDimensionAttributes)
 Creates a new angle dimension instance using three points.
AngleDimension(ViewBase, Point, Vector, Vector, Double, AngleDimensionAttributes)
 Creates a new angle dimension instance using the origin and two vectors relative to the origin.
Top
Properties
Name | Description
Attributes
 Gets or sets the angle dimension attributes.
Distance
 Gets or sets the distance (from the origin to the second point's direction). The distance is measured in paper millimeters.
Origin
 Gets or sets the origin of the dimension.
Point1
 Gets or sets the first point.
Point2
 Gets or sets the second point.
Top
Methods
Name | Description
Delete
 Deletes the dimension from the database.
 (Overrides DatabaseObject.Delete().)
GetAngle
 Gets the angle value (in degrees).
GetDimensionSet()
 The angle dimension doesn't have a dimension set.
 (Overrides DimensionBase.GetDimensionSet().)
GetDimensionSet(Boolean)
 The angle dimension doesn't have a dimension set.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Insert
 Inserts the dimension into the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the existing dimension in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the angle dimension from the database.
 (Overrides DatabaseObject.Select().)
Top
Examples
 The following code inserts an angle dimension:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           ViewBase _view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
           Point origin = new Point(2000, 2000);
           Point point1 = new Point(3000, 5000);
           Point point2 = new Point(6000, 2000);
           AngleDimension myAngle = new AngleDimension(_view, origin, point1, point2, 200);
           myAngle.Insert();
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace