Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase Properties
The SectionMarkBase type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the section mark.
LeftPoint
 The starting point of the left symbol of the section mark.
RightPoint
 The starting point of the right symbol of the section mark.
Top
See Also
Reference
SectionMarkBase Class
Tekla.Structures.Drawing Namespace