Tekla Open API Reference for Tekla Structures 2025
CurvedRebarGroup Properties
The CurvedRebarGroup type exposes the following members.
Properties
Name | Description
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
ExcludeType
 Defines which bars to omit from the group. The options are:
EXCLUDE_TYPE_NONE
EXCLUDE_TYPE_FIRST
EXCLUDE_TYPE_LAST
Polygon
 A polygon definition for the curved reinforcing bar group shape. The polygon must have 3 points.
SpacingType
 The type of spacing. The options are (BaseRebarGroup.RebarGroupSpacingTypeEnum.):
SPACING_TYPE_UNDEFINED
SPACING_TYPE_EXACT_SPACINGS
SPACING_TYPE_EXACT_NUMBER
SPACING_TYPE_TARGET_SPACE
SPACING_TYPE_EXACT_SPACE_FLEX_AT_START
SPACING_TYPE_EXACT_SPACE_FLEX_AT_END
SPACING_TYPE_EXACT_SPACE_FLEX_AT_BOTH
Top
See Also
Reference
CurvedRebarGroup Class
Tekla.Structures.Model Namespace