Tekla Open API Reference for Tekla Structures 2025
BoltGroup Methods
The BoltGroup type exposes the following members.
Methods
Name | Description
AddOtherPartToBolt
 Adds the given part to the list of the other parts that should be bolted.
GetFatherPour
 Returns the pour that the bolt group is associated to.
GetFatherPourUnit
 Returns the pour unit that the bolt group is associated to.
GetOtherPartsToBolt
 Returns an array list containing all the other parts that are bolted.
GetSolid()
 Method for getting the solid information of the bolt group.
GetSolid(Boolean)
 Method for getting the solid information of the bolt group.
RemoveOtherPartToBolt
 Removes the given part from the list of the other bolted parts.
Top
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace