Tekla Open API Reference for Tekla Structures 2025
OrganizerDialog Class
 The OrganizerDialog class represents a "template" of an organizer dialog.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.FormBase
 Tekla.Structures.Dialog.ApplicationFormBase
 Tekla.Structures.Dialog.UIControls.OrganizerDialog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class OrganizerDialog : ApplicationFormBase
Public Class OrganizerDialog
	Inherits ApplicationFormBase
The OrganizerDialog type exposes the following members.
Constructors
Name | Description
OrganizerDialog
 Initializes a new instance of the OrganizerDialog class.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace