Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_EllipseProfile Class
 The IFC2X3_ParametricObject_EllipseProfile class contains the ellipse profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_EllipseProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_EllipseProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_EllipseProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_EllipseProfile type exposes the following members.
Properties
Name | Description
SemiAxis1
 The first semi-axis.
SemiAxis2
 The second semi-axis.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace