Tekla Open API Reference for Tekla Structures 2025
AnalysisEdge Properties
The AnalysisEdge type exposes the following members.
Properties
Name | Description
Connectivity
 The connectivity of the analysis edge.
Radius
 The radius of the analysis edge.
SplitPositions
 The split positions of the analysis edge.
Top
See Also
Reference
AnalysisEdge Class
Tekla.Structures.Analysis Namespace