Tekla Open API Reference for Tekla Structures 2025
BooleanFilterExpression Class
 The BooleanFilterExpression class represents a Boolean filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.BooleanFilterExpression
 More...
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class BooleanFilterExpression : DataFilterExpression
<SerializableAttribute>
Public Class BooleanFilterExpression
	Inherits DataFilterExpression
The BooleanFilterExpression type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.BooleanFilterExpression
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.ConstructionObjectFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.LoadFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.PourBreakFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.PourUnitFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.ReferenceObjectFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.TemplateFilterExpressions.CustomBoolean
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.CustomBoolean