Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadCombination Class
 The AnalysisLoadCombination class contains information related to analysis load combinations.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisLoadCombination
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisLoadCombination : AnalysisObject
Public NotInheritable Class AnalysisLoadCombination
	Inherits AnalysisObject
The AnalysisLoadCombination type exposes the following members.
Constructors
Name | Description
AnalysisLoadCombination
 Initializes a new instance of the AnalysisLoadCombination class.
Top
Properties
Name | Description
GroupIDs
 Gets or sets the identifiers of the groups of the analysis load combination.
Name
 Gets or sets the name of the analysis load combination.
PartialSafetyFactors
 Gets or sets the partial safety factors of the analysis load combination.
ReductionFactors
 Gets or sets the reduction factors of the analysis load combination.
ScalingFactors
 Gets or sets the scaling factors of the analysis load combination.
Type
 Gets or sets the combination type of the analysis load combination.
Top
Methods
Name | Description
Delete
 Deletes an analysis load combination. The AnalysisModelName and ID have to be set.
Insert
 Inserts an analysis load combination. The AnalysisModelName has to be set.
Modify
 Modifies an analysis load combination. The AnalysisModelName and ID have to be set.
Select
 Selects an analysis load combination. The AnalysisModelName and ID have to be set.
 (Overrides AnalysisObject.Select().)
SetLoads
 Sets the loads.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace