Tekla Open API Reference for Tekla Structures 2025
BoltCircle Class
 The BoltCircle class defines a bolt group with a circle shape.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BoltGroup
 Tekla.Structures.Model.BoltCircle
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BoltCircle : BoltGroup
<SerializableAttribute>
Public NotInheritable Class BoltCircle
	Inherits BoltGroup
The BoltCircle type exposes the following members.
Constructors
Name | Description
BoltCircle
 Creates a new bolt circle instance.
Top
Properties
Name | Description
Diameter
 The diameter of the circle.
NumberOfBolts
 The number of bolts in the circle.
Top
Methods
Name | Description
Delete
 Deletes the bolt circle instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the bolt circle into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing bolt circle in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
 (Overrides ModelObject.Modify().)
Select
 Selects a bolt circle from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           ContourPlate cp = new ContourPlate();
           cp.Profile.ProfileString = "PL20";
           cp.AddContourPoint(new ContourPoint(new Point( 9000,  6000, 0),null));
           cp.AddContourPoint(new ContourPoint(new Point(12000,  6000, 0),null));
           cp.AddContourPoint(new ContourPoint(new Point(12000, 12000, 0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 9000, 12000, 0),null));
           if (!cp.Insert())
               Console.WriteLine("ContourPlate Insert failed!");
           BoltCircle B = new BoltCircle();
           B.PartToBeBolted = cp;
           B.PartToBoltTo   = cp;
           B.FirstPosition  = new Point( 9200,  6200, 0);
           B.SecondPosition = new Point(12000, 12000, 0);
           B.BoltSize     = 16;
           B.Tolerance    = 3.00;
           B.BoltStandard = "7968";
           B.BoltType     = BoltGroup.BoltTypeEnum.BOLT_TYPE_WORKSHOP;
           B.CutLength    = 105;
           B.Length       = 100;
           B.ExtraLength  = 15;
           B.ThreadInMaterial = BoltGroup.BoltThreadInMaterialEnum.THREAD_IN_MATERIAL_NO;
           B.Position.Depth          = Position.DepthEnum.MIDDLE;
           B.Position.Plane          = Position.PlaneEnum.MIDDLE;
           B.Position.Rotation       = Position.RotationEnum.FRONT;
           B.Bolt    = true;
           B.Washer1 = true;
           B.Washer2 = true;
           B.Washer3 = true;
           B.Nut1    = true;
           B.Nut2    = true;
           B.Hole1   = true;
           B.Hole2   = true;
           B.Hole3   = true;
           B.Hole4   = true;
           B.Hole5   = true;
           B.NumberOfBolts = 7;
           B.Diameter      = 160;
           if (!B.Insert())
               Console.WriteLine("BoltCircle Insert failed!");
       }
}
See Also
Reference
Tekla.Structures.Model Namespace