Tekla Open API Reference for Tekla Structures 2025
ViewMarkTagAttributes Properties
The View.ViewMarkTagAttributes type exposes the following members.
Properties
Name | Description
TagAlignment
 The tag text alignment.
Top
See Also
Reference
View.ViewMarkTagAttributes Class
Tekla.Structures.Drawing Namespace