Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_IShapeProfile Class
 The IFC2X3_ParametricObject_IShapeProfile class contains the I-shape profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_IShapeProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_IShapeProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_IShapeProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_IShapeProfile type exposes the following members.
Properties
Name | Description
FilletRadius
 The fillet radius.
FlangeThickness
 The flange thickness.
OverallDepth
 The overall depth.
OverallWidth
 The overall width.
WebThickness
 The web thickness.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace