Tekla Open API Reference for Tekla Structures 2025
MarkBase Properties
The MarkBase type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the mark base attributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
InsertionPoint
 The insertion point of the mark.
IsAssociativeNote
 Gets a value indicating whether the mark is an associative note.
Placing
 The current placing of the object. See the placing types for different placing options.
Top
See Also
Reference
MarkBase Class
Tekla.Structures.Drawing Namespace