Tekla Open API Reference for Tekla Structures 2025
Image Class
 The Image class defines an image that can be inserted into a drawing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.EmbeddedObjectBase
 Tekla.Structures.Drawing.Image
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Image : EmbeddedObjectBase
<SerializableAttribute>
Public NotInheritable Class Image
	Inherits EmbeddedObjectBase
The Image type exposes the following members.
Constructors
Name | Description
Image(ViewBase, Point, String)
 Initializes a new instance of the Image class with the given parameters.
Image(ViewBase, Point, String, EmbeddedObjectAttributes)
 Initializes a new instance of the Image class using the specified attributes.
Image(ViewBase, Point, Size, String)
 Initializes a new instance of the Image class with the given parameters.
Image(ViewBase, Point, Size, String, EmbeddedObjectAttributes)
 Initializes a new instance of the Image class using the specified attributes.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace