Tekla Open API Reference for Tekla Structures 2025
Line Class
 The Line class defines a line that is a two-point line with an optional bulge (curve).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.OpenGraphicObject
 Tekla.Structures.Drawing.Line
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Line : OpenGraphicObject
<SerializableAttribute>
Public NotInheritable Class Line
	Inherits OpenGraphicObject
The Line type exposes the following members.
Constructors
Name | Description
Line(ViewBase, Point, Point)
 Creates a new line instance with two points and no bulge (straight line) using standard attributes.
Line(ViewBase, Point, Point, Double)
 Creates a new line instance with two points and a bulge using standard attributes.
Line(ViewBase, Point, Point, Line.LineAttributes)
 Creates a new line instance with two points and no bulge (straight line) using the given attributes.
Line(ViewBase, Point, Point, Double, Line.LineAttributes)
 Creates a new line instance with two points and a bulge using the given attributes.
Top
Properties
Name | Description
Attributes
 The attributes for the line.
Bulge
 The bulge (curve) to use for the line (a bulge is the ratio between the height and width of an object).
EndPoint
 The end point of the line.
StartPoint
 The start point of the line.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if(MyDrawingHandler.GetConnectionStatus())
           {
               Tekla.Structures.Drawing.Line MyLine;
               DrawingObjectEnumerator myviews = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
               while(myviews.MoveNext())
               {
                   MyLine = new Tekla.Structures.Drawing.Line(myviews.Current as ViewBase,
                       new Point(10, 10), new Point(200, 200), 0.5);
                   MyLine.Insert();
                   MyLine.Bulge = 0.0;
                   MyLine.Modify();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace