Tekla Open API Reference for Tekla Structures 2025
BoltGroup Class
 The BoltGroup class is an abstract base class for all bolt shapes, such as array, circle and XY list. See the Tekla Structures help file for further information about the attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BoltGroup
 Tekla.Structures.Model.BoltArray
 Tekla.Structures.Model.BoltCircle
 Tekla.Structures.Model.BoltXYList
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class BoltGroup : ModelObject
<SerializableAttribute>
Public MustInherit Class BoltGroup
	Inherits ModelObject
The BoltGroup type exposes the following members.
Constructors
Name | Description
BoltGroup
 Creates a new bolt group instance with the given shape.
Top
Properties
Name | Description
BlindHoleDepth
 Gets or sets the blind hole depth.
Bolt
 Indicates whether the instance is a bolt or just a hole.
BoltHolesAttributes
 The bolt holes attributes.
BoltPositions
 Gets the single bolt positions. All the bolt positions are in the XY-plane defined by the bolt group coordinate system. The given positions are in relation to the transformation plane in which the bolt group was selected.
BoltSize
 The size of the bolts in the group.
BoltStandard
 The standard of the bolt group.
BoltType
 The type of the bolt group.
ConnectAssemblies
 Defines whether to connect a part or an assembly as a secondary part (false) or as a sub-assembly (true).
CutLength
 The cut length.
EndPointOffset
 The end point offset values of the bolt group.
ExtraLength
 The extra length for the bolts.
FirstPosition
 The first position point.
Hole1
 Indicates whether the hole 1 is used.
Hole2
 Indicates whether the hole 2 is used.
Hole3
 Indicates whether the hole 3 is used.
Hole4
 Indicates whether the hole 4 is used.
Hole5
 Indicates whether the hole 5 is used.
HoleType
 The special hole type: oversized, slotted, blind or no hole.
Length
 The length. An extra variable that is only set when the bolt group is made of studs instead of bolts.
Nut1
 Indicates whether the nut 1 is used in the assembly.
Nut2
 Indicates whether the nut 2 is used in the assembly.
OtherPartsToBolt
 The other parts to be bolted (read-only).
PartToBeBolted
 The part to be bolted.
PartToBoltTo
 The part to bolt to.
PlainHoleType
 Gets or sets the plain hole type.
Position
 The position attributes.
RotateSlots
 Gets or sets the rotation of the slots: odd, even or parallel.
SecondPosition
 The second position point.
SlotOffsetX
 Gets or sets the slotted hole offset X.
SlotOffsetY
 Gets or sets the slotted hole offset Y.
SlottedHoleX
 Gets or sets the X allowance of the slotted hole.
SlottedHoleY
 Gets or sets the Y allowance of the slotted hole.
StartPointOffset
 The start point offset values of the bolt group.
ThreadInMaterial
 Whether the thread goes inside the materal or not.
Tolerance
 The hole tolerance.
Washer1
 Indicates whether the washer 1 is used in the assembly.
Washer2
 Indicates whether the washer 2 is used in the assembly.
Washer3
 Indicates whether the washer 3 is used in the assembly.
Top
Methods
Name | Description
AddOtherPartToBolt
 Adds the given part to the list of the other parts that should be bolted.
GetFatherPour
 Returns the pour that the bolt group is associated to.
GetFatherPourUnit
 Returns the pour unit that the bolt group is associated to.
GetOtherPartsToBolt
 Returns an array list containing all the other parts that are bolted.
GetSolid()
 Method for getting the solid information of the bolt group.
GetSolid(Boolean)
 Method for getting the solid information of the bolt group.
RemoveOtherPartToBolt
 Removes the given part from the list of the other bolted parts.
Top
See Also
Reference
Tekla.Structures.Model Namespace