Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObject Methods
The ReferenceModelObject type exposes the following members.
Methods
Name | Description
Delete
 At the moment reference objects cannot be deleted.
 (Overrides ModelObject.Delete().)
GetFather
 Returns the reference hierarchy father.
GetReferenceModel
 Gets the reference model that the reference object belongs to.
Insert
 At the moment reference objects cannot be inserted.
 (Overrides ModelObject.Insert().)
Modify
 At the moment reference objects cannot be modified.
 (Overrides ModelObject.Modify().)
Select
 Selects the reference model with the given identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
ReferenceModelObject Class
Tekla.Structures.Model Namespace