Tekla Open API Reference for Tekla Structures 2025
ObjectTypesFilterExpressions.CategoryName Class
 The CategoryName class represents the category name filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.CategoryName
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CategoryName : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class CategoryName
	Inherits StringFilterExpression
The ObjectTypesFilterExpressions.CategoryName type exposes the following members.
Constructors
Name | Description
ObjectTypesFilterExpressions.CategoryName
 Initializes a new instance of the CategoryName class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace