Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedTemperatureLoad Properties
The AnalysisDecomposedTemperatureLoad type exposes the following members.
Properties
Name | Description
AxialTemperatureDifference
 The axial temperature difference of the decomposed temperature load.
HorizontalTemperatureDifference
 The horizontal temperature difference of the decomposed temperature load.
Strain
 The strain of the decomposed temperature load.
VerticalTemperatureDifference
 The vertical temperature difference of the decomposed temperature load.
Top
See Also
Reference
AnalysisDecomposedTemperatureLoad Class
Tekla.Structures.Analysis Namespace