Tekla Open API Reference for Tekla Structures 2025
ControlPoint Class
 The ControlPoint class defines a user defined point helping in modeling work.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.ControlPoint
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ControlPoint : ModelObject
<SerializableAttribute>
Public NotInheritable Class ControlPoint
	Inherits ModelObject
The ControlPoint type exposes the following members.
Constructors
Name | Description
ControlPoint()
 Initializes a new instance of the ControlPoint class with zero members.
ControlPoint(Point)
 Initializes a new instance of the ControlPoint class with an existing point.
Top
Properties
Name | Description
Point
 Gets or sets the position of the control point.
Top
Methods
Name | Description
Delete
 Deletes the control point with the given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control point into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control point with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the control point with the given Identifier.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           Point point = new Point(6000,6000,0);
           ControlPoint controlpoint = new ControlPoint(point);
           bool Result = false;
           Result = controlpoint.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace