Tekla Open API Reference for Tekla Structures 2025
TextFile Methods
The TextFile type exposes the following members.
Methods
Name | Description
Delete
 Deletes the text file object.
 (Overrides EmbeddedObjectBase.Delete().)
Insert
 Inserts the text file object.
 (Overrides EmbeddedObjectBase.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides EmbeddedObjectBase.IsEqual(Object).)
Modify
 Modifies the text file object.
 (Overrides EmbeddedObjectBase.Modify().)
Select
 Selects the text file object.
 (Overrides EmbeddedObjectBase.Select().)
Top
See Also
Reference
TextFile Class
Tekla.Structures.Drawing Namespace