Tekla Open API Reference for Tekla Structures 2025
ObjectTypesFilterExpressions.EntityName Class
 The EntityName class represents the entity name filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.EntityName
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class EntityName : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class EntityName
	Inherits StringFilterExpression
The ObjectTypesFilterExpressions.EntityName type exposes the following members.
Constructors
Name | Description
ObjectTypesFilterExpressions.EntityName
 Initializes a new instance of the EntityName class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace