Tekla Open API Reference for Tekla Structures 2025
RadialGrid Class
 The RadialGrid class defines a user defined (possibly magnetic) set; radial grid has grid planes and cylindrical grid planes as children
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.GridBase
 Tekla.Structures.Model.RadialGrid
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RadialGrid : GridBase
<SerializableAttribute>
Public NotInheritable Class RadialGrid
	Inherits GridBase
The RadialGrid type exposes the following members.
Constructors
Name | Description
RadialGrid
 Creates a new radial grid instance. Overrides the default creation parameters by forcing the angular coordinates to be "0.0 6*15.0"
Top
Properties
Name | Description
AngularCoordinates
 The angular coordinates of the grid lines
AngularLabels
 The labels for the angular grid lines.
AngularLinesEndExtension
 The extension of the angular grid lines at their end point.
AngularLinesStartExtension
 The extension of the angular grid lines at their start point.
ArcEndExtension
 The extension of the grid arcs at their end point.
ArcStartExtension
 The extension of the grid arcs at their start point.
Color
 Gets or sets the color of the grid.
CoordinateZ
 The coordinates for the Z-axis.
ExtensionAboveZ
 The extension above Z-axis.
ExtensionBelowZ
 The extension below the Z-axis.
IsMagnetic
 Gets or sets whether the grid is magnetic or not
 (Overrides GridBase.IsMagnetic.)
LabelZ
 The labels for the Z-axis.
RadialCoordinates
 The distances between the radii of the arcs
RadialLabels
 The labels for the grid arcs.
Top
Methods
Name | Description
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           RadialGrid grid = new RadialGrid();
           grid.IsMagnetic = true;
           bool Result = Grid.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace