Tekla Open API Reference for Tekla Structures 2025
Polygon Properties
The Polygon type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the polygon.
Bulge
 The bulge (curve) to use for the polygon (a bulge is the ratio between the height and width of an object).
Bulges
 The list of individual bulges for the polygon.
Points
 The list of points for the polygon.
Top
See Also
Reference
Polygon Class
Tekla.Structures.Drawing Namespace