Tekla Open API Reference for Tekla Structures 2025
Bolt Class
 The Bolt class contains methods related to bolts. A bolt is a drawing object derived from a model object. It represents a drawing bolt that has a reference to the actual bolt in the model database.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.Bolt
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Bolt : ModelObject
<SerializableAttribute>
Public NotInheritable Class Bolt
	Inherits ModelObject
The Bolt type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the bolt. For more information see Bolt.BoltAttributes.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace