Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition Class
 The HierarchicDefinition class defines a hierarchy structure. This hierarchy structure can be instantiated and extended by hierarchical objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.HierarchicDefinition
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class HierarchicDefinition : ModelObject
<SerializableAttribute>
Public NotInheritable Class HierarchicDefinition
	Inherits ModelObject
The HierarchicDefinition type exposes the following members.
Constructors
Name | Description
HierarchicDefinition()
 Creates a new hierarchical definition instance.
HierarchicDefinition(Identifier)
 Instantiates a hierarchical definition with a known identifier. The instantiation has to be done before the hierarchical definition instance can be selected.
Top
Properties
Name | Description
CustomType
 The custom type of the hierarchical definition.
Drawable
 Defines whether the hierarchical definition is a drawable area in the model.
Father
 The father of the hierarchical definition.
HierarchicChildren
 An array list that contains the hierarchical definition's children.
HierarchyIdentifier
 The GUID of the hierarchical definition.
HierarchyType
 The type of the hierarchical definition.
Name
 The name of the hierarchical definition.
Top
Methods
Name | Description
AddObjects
 Associates hierarchical objects with the hierarchical definition. Fails if the hierarchical definition doesn't exist in the model.
Delete
 Deletes the hierarchical definition instance from the model. The ID must be set.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the hierarchical definition instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the hierarchical definition instance in the model. The ID must be set.
 (Overrides ModelObject.Modify().)
RemoveObjects
 Removes associations to the given list of hierarchical objects. Fails if the hierarchical definition doesn't exist in the model.
Select
 Selects the hierarchical definition instance from the model. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           HierarchicDefinition scenarioDefinition = new HierarchicDefinition();
           scenarioDefinition.Name = "Scenario type";
           scenarioDefinition.HierarchyType = HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_TASK_SCENARIO;
           scenarioDefinition.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace
Tekla.Structures.Model.HierarchicObject