Tekla Open API Reference for Tekla Structures 2025
PolyBeam Properties
The PolyBeam type exposes the following members.
Properties
Name | Description
Contour
 Gets or sets the contour for the polybeam.
Type
 Gets the read only type of the polybeam. The default type for a new polybeam instance is beam.
Top
See Also
Reference
PolyBeam Class
Tekla.Structures.Model Namespace