Tekla Open API Reference for Tekla Structures 2025
BoltFilterExpressions.Standard Class
 The Standard class represents the standard filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.Standard
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Standard : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Standard
	Inherits StringFilterExpression
The BoltFilterExpressions.Standard type exposes the following members.
Constructors
Name | Description
BoltFilterExpressions.Standard
 Initializes a new instance of the Standard class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace