Tekla Open API Reference for Tekla Structures 2025
GridPlane Properties
The GridPlane type exposes the following members.
Properties
Name | Description
Color |  Obsolete.
 The color of the grid plane. This works only in wireframe views. The color of grid planes in rendered views can be changed using the advanced option XS_GRID_COLOR.
DrawingVisibility
 The visibility of the grid surface in drawings.
ExtensionAbove
 The line extension above.
ExtensionBelow
 The line extension below.
ExtensionForMagneticArea |  Obsolete.
 The extension for the magnetic area.
ExtensionLeft
 The line extension on the left.
ExtensionRight
 The line extension on the right.
Father |  Obsolete.
 The father grid of the grid plane.
IsMagnetic
 Whether the grid surface is magnetic or not.
Label
 The label for the grid surface.
Plane
 The plane defining the position of the grid plane.
Top
See Also
Reference
GridPlane Class
Tekla.Structures.Model Namespace