Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterBase Properties
The AnalysisDesignParameterBase type exposes the following members.
Properties
Name | Description
IsGeneral
 Gets or sets a value indicating whether the design parameter is general.
Name
 Gets or sets the name of the analysis design parameter.
Unit
 Gets or sets the unit of the analysis design parameter.
Top
See Also
Reference
AnalysisDesignParameterBase Class
Tekla.Structures.Analysis Namespace