Tekla Open API Reference for Tekla Structures 2025
ModelObject Properties
The ModelObject type exposes the following members.
Properties
Name | Description
Hideable
 Accesses the information if this object is hidden or not or if it should be.
ModelIdentifier
 The database identifier of the model object in the model database. By using this identifier, it is possible to select the actual object in the Tekla Structures model.
Top
See Also
Reference
ModelObject Class
Tekla.Structures.Drawing Namespace