Tekla Open API Reference for Tekla Structures 2025
FacesTooNearEachOtherException Class
 The FacesTooNearEachOtherException class represents an error when, faces to be connected overlap.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.FacesTooNearEachOtherException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class FacesTooNearEachOtherException : ConnectiveGeometryException
<SerializableAttribute>
Public Class FacesTooNearEachOtherException
	Inherits ConnectiveGeometryException
The FacesTooNearEachOtherException type exposes the following members.
Constructors
Name | Description
FacesTooNearEachOtherException
 Initializes a new instance of the ExtensionIntersectsWithPlateException class with "faces to be connected overlap" error message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace