Tekla Open API Reference for Tekla Structures 2025
GraphicObject Class
 The GraphicObject class is the abstract base class for all graphic objects (the arc, the circle, the cloud, the line, the polygon, the polyline and the rectangle).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.ClosedGraphicObject
 Tekla.Structures.Drawing.OpenGraphicObject
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class GraphicObject : DrawingObject,
	IHideable
<SerializableAttribute>
Public MustInherit Class GraphicObject
	Inherits DrawingObject
	Implements IHideable
The GraphicObject type exposes the following members.
Properties
Name | Description
Hideable
 Accesses the information if this object is hidden or not or if it should be.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace