Tekla Open API Reference for Tekla Structures 2025
DateTimeConstantFilterExpression Class
 The DateTimeConstantFilterExpression class represents a constant DateTime filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.DateTimeConstantFilterExpression
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DateTimeConstantFilterExpression : DataFilterExpression
<SerializableAttribute>
Public NotInheritable Class DateTimeConstantFilterExpression
	Inherits DataFilterExpression
The DateTimeConstantFilterExpression type exposes the following members.
Constructors
Name | Description
DateTimeConstantFilterExpression(IEnumerable<DateTime>)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
DateTimeConstantFilterExpression(DateTime)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
DateTimeConstantFilterExpression(IEnumerable<DateTime>, IFormatProvider)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
DateTimeConstantFilterExpression(DateTime, IFormatProvider)
 Initializes a new instance of the DateTimeConstantFilterExpression class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace