Tekla Open API Reference for Tekla Structures 2025
BaseComponent Class
 The BaseComponent class is an abstract base class that represents generic components. The generic components derived from the base component are the component, the connection, the detail and the seam.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseComponent
 Tekla.Structures.Model.Component
 Tekla.Structures.Model.Connection
 Tekla.Structures.Model.CustomPart
 Tekla.Structures.Model.Detail
 Tekla.Structures.Model.Seam
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class BaseComponent : ModelObject
<SerializableAttribute>
Public MustInherit Class BaseComponent
	Inherits ModelObject
The BaseComponent type exposes the following members.
Constructors
Name | Description
BaseComponent
 Creates a base component instance with default attributes.
Top
Properties
Name | Description
Name
 The name of the component. The name identifies custom components or plug-ins.
Number
 The number of the component. A number greater than zero identifies system components, for custom components the number is CUSTOM_OBJECT_NUMBER, and for plug-ins the number is PLUGIN_OBJECT_NUMBER.
Top
Methods
Name | Description
GetAttribute(String, Double)
 Retrieves the attribute with the given name.
GetAttribute(String, Int32)
 Retrieves the attribute with the given name.
GetAttribute(String, String)
 Retrieves the attribute with the given name.
LoadAttributesFromFile
 Loads the attributes for the component from the given file. These attributes will be loaded before all the attributes that have been set with the SetAttribute methods, so any attributes that are set with SetAttribute will override those loaded from the given standard file.
SetAttribute(String, Double)
 Sets the attribute's value to the given value.
SetAttribute(String, Int32)
 Sets the attribute's value to the given value.
SetAttribute(String, String)
 Sets the attribute's value to the given value.
Top
Fields
Name | Description
ClassFromAttributeFile
 A constant integer defining that the class is to be read from the attribute file. The class must be set to this constant value before inserting the component.
ConnectionCodeFromAttributeFile
 A constant string defining that the connection code is to be read from the attribute file. The connection code must be set to this constant value before inserting the component.
CUSTOM_OBJECT_NUMBER
 The component number to be used when calling a custom component.
PLUGIN_OBJECT_NUMBER
 The component number to be used when calling a plug-in or a type derived from the connection base.
Top
See Also
Reference
Tekla.Structures.Model Namespace