Tekla Open API Reference for Tekla Structures 2025
PickerInputNPoints Class
 The PickerInputNPoints class represents a pick of several points in a view. Used for values asked by UI.Picker.PickPoints(StringList Prompts, out PointList PickedPoints, out ViewBase PickedView) and UI.Picker.PickPoints(int NumberOfPicks, StringList Prompts, out PointList PickedPoints, out ViewBase PickedView).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputWithinAView
 Tekla.Structures.Drawing.PickerInputPointsWithinAView
 Tekla.Structures.Drawing.PickerInputNPoints
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PickerInputNPoints : PickerInputPointsWithinAView
Public Class PickerInputNPoints
	Inherits PickerInputPointsWithinAView
The PickerInputNPoints type exposes the following members.
Constructors
Name | Description
PickerInputNPoints
 Creates a new PickerInputNPoints instance representing N points selected in a view.
Top
Properties
Name | Description
PickedPoints
 Gets or sets the list of picked points in the view coordinates.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace