Tekla Open API Reference for Tekla Structures 2025
ConicalSurfaceNode Properties
The ConicalSurfaceNode type exposes the following members.
Properties
Name | Description
Surface
 Gets the conical surface geometry.
Top
See Also
Reference
ConicalSurfaceNode Class
Tekla.Structures.Model Namespace