Tekla Open API Reference for Tekla Structures 2025
ModelObject Class
 The ModelObject class is an abstract class for all model objects in the drawing side. The model objects of the drawing side contain identifiers of the actual model objects in the model database. The model objects appear and disappear based on current view properties (view size, settings).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 More...
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ModelObject : DrawingObject,
	IHideable
<SerializableAttribute>
Public MustInherit Class ModelObject
	Inherits DrawingObject
	Implements IHideable
The ModelObject type exposes the following members.
Properties
Name | Description
Hideable
 Accesses the information if this object is hidden or not or if it should be.
ModelIdentifier
 The database identifier of the model object in the model database. By using this identifier, it is possible to select the actual object in the Tekla Structures model.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.Bolt
 Tekla.Structures.Drawing.Connection
 Tekla.Structures.Drawing.EdgeChamfer
 Tekla.Structures.Drawing.Grid
 Tekla.Structures.Drawing.GridLine
 Tekla.Structures.Drawing.Part
 Tekla.Structures.Drawing.PourBreak
 Tekla.Structures.Drawing.PourObject
 Tekla.Structures.Drawing.ReferenceModel
 Tekla.Structures.Drawing.ReinforcementBase
 Tekla.Structures.Drawing.Surfacing
 Tekla.Structures.Drawing.Weld