Tekla Open API Reference for Tekla Structures 2025
ReinforcementStrand Methods
The ReinforcementStrand type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
See Also
Reference
ReinforcementStrand Class
Tekla.Structures.Drawing Namespace