Tekla Open API Reference for Tekla Structures 2025
DimensionSetBase Properties
The DimensionSetBase type exposes the following members.
Properties
Name | Description
Attributes
 The dimension set attributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
Top
See Also
Reference
DimensionSetBase Class
Tekla.Structures.Drawing Namespace