Tekla Open API Reference for Tekla Structures 2025
ControlPolycurve Properties
The ControlPolycurve type exposes the following members.
Properties
Name | Description
Color
 Gets or sets color of the Polycurve.
Geometry
 Gets or sets geometry list that defines geometry of the polycurve.
LineType
 Gets or sets the line type of the polycurve.
Top
See Also
Reference
ControlPolycurve Class
Tekla.Structures.Model Namespace