Tekla Open API Reference for Tekla Structures 2025
AnalysisNode Properties
The AnalysisNode type exposes the following members.
Properties
Name | Description
CoordinateSystem
 The coordinate system of the analysis node.
IsUserNode
 Indicates whether the analysis node is a user node.
IsUserSupport
 Indicates whether the analysis node has a user node.
Label
 The label of the analysis node.
Position
 The position of the analysis node (in the global coordinate system).
Support
 The support of the analysis node.
Top
See Also
Reference
AnalysisNode Class
Tekla.Structures.Analysis Namespace