Tekla Open API Reference for Tekla Structures 2025
RebarLegSurfaceObject Methods
The RebarLegSurfaceObject type exposes the following members.
Methods
Name | Description
Insert
 Inserts the leg surface object into the model database.
 (Overrides SurfaceObject.Insert().)
Modify
 Modifies the existing leg surface object in the model database to match the current one.
 (Overrides SurfaceObject.Modify().)
Select
 Selects the leg surface object from the model database. The identifier must be set.
 (Overrides SurfaceObject.Select().)
Top
See Also
Reference
RebarLegSurfaceObject Class
Tekla.Structures.Model Namespace