Tekla Open API Reference for Tekla Structures 2025
CylindricalSurface Properties
The CylindricalSurface type exposes the following members.
Properties
Name | Description
Radius
 Gets radius of the cylindrical surface.
Top
See Also
Reference
CylindricalSurface Class
Tekla.Structures.Model Namespace