Tekla Open API Reference for Tekla Structures 2025
BooleanPart Methods
The BooleanPart type exposes the following members.
Methods
Name | Description
Delete
 Deletes the boolean part instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the boolean part into the model database. All the attributes must be set. The operative part is overwritten by a copy of the original part.
 (Overrides ModelObject.Insert().)
Modify
 Currently it is not possible to modify the boolean part as there is nothing that can be modified for it. Calling this function will actually call modify for the operative part member.
 (Overrides ModelObject.Modify().)
Select
 Selects a boolean part from the model database. The part ID must be set.
 (Overrides ModelObject.Select().)
SetOperativePart
 Sets the part to operate with. The operative part's class member must be defined to be BooleanOperativeClass.
Top
See Also
Reference
BooleanPart Class
Tekla.Structures.Model Namespace