Tekla Open API Reference for Tekla Structures 2025
Boolean Properties
The Boolean type exposes the following members.
Properties
Name | Description
Father
 The father object of the boolean operation; the model object instance to operate on.
Top
See Also
Reference
Boolean Class
Tekla.Structures.Model Namespace