Tekla Open API Reference for Tekla Structures 2025
ReferenceModel Class
 The ReferenceModel class represents a reference model object in a drawing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.ReferenceModel
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReferenceModel : ModelObject
<SerializableAttribute>
Public NotInheritable Class ReferenceModel
	Inherits ModelObject
The ReferenceModel type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the reference model object attributes.
Top
Methods
Name | Description
Delete
 Reference model objects cannot be deleted.
 (Overrides DatabaseObject.Delete().)
Insert
 Reference model objects cannot be inserted.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the reference model object.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the reference model object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace