Tekla Open API Reference for Tekla Structures 2025
BoltXYList Class
 The BoltXYList class defines a bolt group with an XY list shape. The bolt group is the most generic one of the bolt groups.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BoltGroup
 Tekla.Structures.Model.BoltXYList
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BoltXYList : BoltGroup
<SerializableAttribute>
Public NotInheritable Class BoltXYList
	Inherits BoltGroup
The BoltXYList type exposes the following members.
Constructors
Name | Description
BoltXYList
 Creates a new bolt XY list instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
AddBoltDistX
 Adds an X distance to the bolt XY list.
AddBoltDistY
 Adds a Y distance to the bolt XY list.
Delete
 Deletes the bolt XY list instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetBoltDistX
 Returns the X distance defined by the argument.
GetBoltDistXCount
 Returns the amount of X distances in the bolt XY list.
GetBoltDistY
 Returns the Y distance defined by the argument.
GetBoltDistYCount
 Returns the amount of Y distances in the bolt XY list.
Insert
 Inserts the bolt XY list into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing bolt XY list in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
 (Overrides ModelObject.Modify().)
Select
 Selects a bolt XY list from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           ContourPlate cp = new ContourPlate();
           cp.Profile.ProfileString = "PL20";
           cp.AddContourPoint(new ContourPoint(new Point( 6000,  6000, 0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 9000,  6000, 0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 9000, 12000, 0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 6000, 12000, 0),null));
           if (!cp.Insert())
               Console.WriteLine("ContourPlate Insert failed!");
           BoltXYList B = new BoltXYList();
           B.PartToBeBolted = cp;
           B.PartToBoltTo   = cp;
           B.FirstPosition =  new Point(6200,  6200, 0);
           B.SecondPosition = new Point(9000, 12000, 0);
           B.BoltSize     = 16;
           B.Tolerance    = 3.00;
           B.BoltStandard = "7968";
           B.BoltType     = BoltGroup.BoltTypeEnum.BOLT_TYPE_WORKSHOP;
           B.CutLength    = 105;
           B.Length       = 50;
           B.ExtraLength  = 15;
           B.ThreadInMaterial = BoltGroup.BoltThreadInMaterialEnum.THREAD_IN_MATERIAL_NO;
           B.Position.Depth          = Position.DepthEnum.MIDDLE;
           B.Position.Plane          = Position.PlaneEnum.MIDDLE;
           B.Position.Rotation       = Position.RotationEnum.FRONT;
           B.Bolt    = true;
           B.Washer1 = true;
           B.Washer2 = true;
           B.Washer3 = true;
           B.Nut1    = true;
           B.Nut2    = true;
           B.Hole1   = true;
           B.Hole2   = true;
           B.Hole3   = true;
           B.Hole4   = true;
           B.Hole5   = true;
           B.AddBoltDistX(100);
           B.AddBoltDistX(200);
           B.AddBoltDistX(300);
           B.AddBoltDistY(100);
           B.AddBoltDistY(200);
           B.AddBoltDistY(300);
           if (!B.Insert())
               Console.WriteLine("BoltXYList Insert failed!");
       }
}
See Also
Reference
Tekla.Structures.Model Namespace