Tekla Open API Reference for Tekla Structures 2025
RebarStrand Methods
The RebarStrand type exposes the following members.
Methods
Name | Description
Delete
 Deletes the strand instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the strand into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing strand in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the strand from the model database. The reinforcement identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
RebarStrand Class
Tekla.Structures.Model Namespace