Tekla Open API Reference for Tekla Structures 2025
StraightDimension Class
 The StraightDimension class defines straight dimensions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.StraightDimension
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class StraightDimension : DimensionBase
<SerializableAttribute>
Public NotInheritable Class StraightDimension
	Inherits DimensionBase
The StraightDimension type exposes the following members.
Constructors
Name | Description
StraightDimension(ViewBase, Point, Point, Vector, Double)
 Initializes a new instance of the StraightDimension class using "standard" attributes.
StraightDimension(ViewBase, Point, Point, Vector, Double, StraightDimensionSet.StraightDimensionSetAttributes)
 Initializes a new instance of the StraightDimension class.
Top
Properties
Name | Description
Attributes
 Gets or sets the dimension's attributes.
Distance
 Gets or sets the distance of the dimension line from the start point of the dimension.
EndPoint
 Gets or sets the end point of the dimension.
StartPoint
 Gets or sets the start point of the dimension.
UpDirection
 Gets or sets the direction from the dimension points to the dimension line.
Value
 Gets the content of the dimension mark.
Top
Methods
Name | Description
Delete
 Deletes the straight dimension from the database.
 (Overrides DatabaseObject.Delete().)
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet().)
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Insert
 Inserts the straight dimension to the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the existing straight dimension in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the straight dimension from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace