Tekla Open API Reference for Tekla Structures 2025
ViewBase Class
 The ViewBase class is a base class for both the ContainerView class and the View class.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ViewBase
 Tekla.Structures.Drawing.ContainerView
 Tekla.Structures.Drawing.View
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ViewBase : DrawingObject,
	IHasChildren, IAxisAlignedBoundingBox
<SerializableAttribute>
Public MustInherit Class ViewBase
	Inherits DrawingObject
	Implements IHasChildren, IAxisAlignedBoundingBox
The ViewBase type exposes the following members.
Properties
Name | Description
ExtremaCenter
 Gets the view extrema center.
FrameOrigin
 The vector from the view origin to the frame origin.
Height
 The height of the view frame in paper coordinates.
IsSheet
 Gets a value indicating whether the container view is the drawing's sheet.
Origin
 The view origin coordinates in the sheet.
Width
 The width of the view frame in paper coordinates.
Top
Methods
Name | Description
Delete
 Deletes the view and its children objects from the database.
 (Overrides DatabaseObject.Delete().)
GetAllObjects()
 Gets all the objects and their children objects in the view.
GetAllObjects(Type)
 Gets all the objects and their children objects in the view that are of a certain type.
GetAllObjects(Type[])
 Gets all the objects and their children objects in the view that are of certain types.
GetAxisAlignedBoundingBox
 The view size in paper coordinates.
GetModelObjects
 Gets the drawing model objects based on given model object identifier. If used from sheet model objects from all views are returned.
GetObjects()
 Gets the objects in the view. Does not return child objects (single dimensions, grid lines, views).
GetObjects(Type[])
 Gets the objects in the view that are of certain types. Does not return child objects (single dimensions, grid lines, views).
GetOriginalDrawing
 Gets the drawing on which the view was originally created. @see DrawingObject.GetDrawing() for retrieving the current drawing the object resides on.
Insert
 Inserts the view to the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the view in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the view from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace