Tekla Open API Reference for Tekla Structures 2025
AnalysisVolume Class
 The AnalysisVolume class contains information related to analysis volumes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisVolume
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisVolume : AnalysisObject
Public NotInheritable Class AnalysisVolume
	Inherits AnalysisObject
The AnalysisVolume type exposes the following members.
Constructors
Name | Description
AnalysisVolume
Initializes a new instance of the AnalysisVolume class
Top
Properties
Name | Description
Material
 The material of the analysis volume.
Profile
 The profile of the analysis volume.
Volume
 The volume item.
VolumeHoles
 The volume holes.
Top
Methods
Name | Description
Select
 Selects an analysis volume. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace