Tekla Open API Reference for Tekla Structures 2025
PourObject Properties
The PourObject type exposes the following members.
Properties
Name | Description
Class
 Gets or sets the class of the pour object.
ConcreteMixture
 Gets or sets the concrete mixture of the pour.
PourNumber
 Gets or sets the pour number of the pour.
PourType
 Gets or sets the pour type of the pour.
Top
See Also
Reference
PourObject Class
Tekla.Structures.Model Namespace