Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadial Properties
The CurvedDimensionSetRadial type exposes the following members.
Properties
Name | Description
Attributes
 The curved dimension set radial attributes.
Top
See Also
Reference
CurvedDimensionSetRadial Class
Tekla.Structures.Drawing Namespace