Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionBase Class
 The CurvedDimensionBase class is the base class for radial and orthogonal curved dimensions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.CurvedDimensionBase
 Tekla.Structures.Drawing.CurvedDimensionOrthogonal
 Tekla.Structures.Drawing.CurvedDimensionRadial
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class CurvedDimensionBase : DimensionBase
<SerializableAttribute>
Public MustInherit Class CurvedDimensionBase
	Inherits DimensionBase
The CurvedDimensionBase type exposes the following members.
Properties
Name | Description
ArcPoint1
 Gets the first arc point.
ArcPoint2
 Gets the second arc point.
ArcPoint3
 Gets the third arc point.
Attributes
 Gets or sets the curved dimension set base attributes.
Distance
 Gets the distance.
EndPoint
 The end point of the dimension.
StartPoint
 The start point of the dimension.
Top
Methods
Name | Description
Delete
 Deletes the straight dimension from the database.
 (Overrides DatabaseObject.Delete().)
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet().)
Insert
 Inserts the dimension to the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 The single dimension cannot be modified.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the straight dimension from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace