Tekla Open API Reference for Tekla Structures 2025
TaskDependency Properties
The TaskDependency type exposes the following members.
Properties
Name | Description
DependencyType
 The type of the task dependency.
Lag
 The lag of the task dependency represented in whole hours.
Local
 The locality indicates if the dependency was created in Tekla Structures and Task Manager or imported.
Primary
 The primary task of the task dependency.
Secondary
 The secondary task of the task dependency.
Top
See Also
Reference
TaskDependency Class
Tekla.Structures.Model Namespace