Tekla Open API Reference for Tekla Structures 2025
Boolean Class
 The Boolean class is an abstract base class for boolean operations such as a part cut, an add, a fitting or a cut plane.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Boolean
 Tekla.Structures.Model.BooleanPart
 Tekla.Structures.Model.CutPlane
 Tekla.Structures.Model.EdgeChamfer
 Tekla.Structures.Model.Fitting
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class Boolean : ModelObject
<SerializableAttribute>
Public MustInherit Class Boolean
	Inherits ModelObject
The Boolean type exposes the following members.
Constructors
Name | Description
Boolean
 Constructs an empty boolean.
Top
Properties
Name | Description
Father
 The father object of the boolean operation; the model object instance to operate on.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace