Tekla Open API Reference for Tekla Structures 2025
Plugin Class
 The Plugin class represents a drawing plug-in.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.Plugin
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Plugin : DrawingObject
<SerializableAttribute>
Public NotInheritable Class Plugin
	Inherits DrawingObject
The Plugin type exposes the following members.
Constructors
Name | Description
Plugin
 Creates a new plug-in instance.
Top
Properties
Name | Description
Name
 Gets the name of the plug-in.
Top
Methods
Name | Description
ApplyStandardValues
 Applies the values of the specified file as the default values for the dialog belonging to this plug-in. This will affect each Insert call of the plug-ins with the same name.
Delete
 Deletes the plug-in from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetDoubleAttribute
 Gets the value of the specified double attribute of the plug-in.
GetIntAttribute
 Gets the value of the specified int attribute of the plug-in.
GetStringAttribute
 Gets the value of the specified string attribute of the plug-in.
Insert
 Inserts the plug-in into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
LoadStandardValues
 Sets the values from the specified file to this plug-in.
Modify
 Modifies the plug-in in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the plug-in from the current drawing database.
 (Overrides DatabaseObject.Select().)
SetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
SetPickerInput
 Defines the sequence of inputs to use in place of interactive picks when the plug-in is inserted to a drawing.
TryGetAttribute(String, Double)
 Gets the value of the specified double attribute of the plug-in.
TryGetAttribute(String, Int32)
 Gets the value of the specified int attribute of the plug-in.
TryGetAttribute(String, String)
 Gets the value of the specified string attribute of the plug-in.
TrySetAttribute(String, Double)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, Int32)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
TrySetAttribute(String, String)
 Sets the specified attribute of the plug-in to the given value. NOTE! Only works on already inserted plug-ins.
Top
Examples
 The following example demonstrates how to insert a plug-in into a view. The plug-in used in this example is the Center of gravity dimensions plug-in (COGDimensioning).
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
    public void Example1()
    {
        DrawingHandler MyDrawingHandler = new DrawingHandler();
        DrawingObjectEnumerator allViews = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
        allViews.MoveNext();
        ViewBase curView = allViews.Current as ViewBase;
        Plugin myPlugin = new Plugin(curView, "COGDimensioning");
        PluginPickerInput newPluginInput = new PluginPickerInput();
        newPluginInput.Add(new PickerInputPoint(curView, new Point(100, 200)));
        newPluginInput.Add(new PickerInputPoint(curView, new Point(300, 400)));
        myPlugin.SetPickerInput(newPluginInput);
        myPlugin.Insert(); // Inserts the plug-in, the plug-in's DefineInput method's UI.Picker calls will use the given data above.
        // After the Insert returns the Plugin is inserted into the drawing view.
        // Alternatively, if there are some errors during the insertion of the plug-in,
        // exceptions may be thrown or the return value of Insert will be false.
    }
}
See Also
Reference
Tekla.Structures.Drawing Namespace