Tekla Open API Reference for Tekla Structures 2025
TaskWorktype Methods
The TaskWorktype type exposes the following members.
Methods
Name | Description
Delete
 Deletes the task worktype instance from the model. The identifier must be set.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the task worktype instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the task worktype instance in the model. The identifier must be set.
 (Overrides ModelObject.Modify().)
Select
 Selects the task worktype instance from the model. The identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
TaskWorktype Class
Tekla.Structures.Model Namespace