Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem.Select Method
Overload List
Name | Description
Select(String)
 Selects the parametric profile item in the profile database using the given name.
Top
See Also
Reference
ParametricProfileItem Class
Tekla.Structures.Catalogs Namespace