Tekla Open API Reference for Tekla Structures 2025
CastUnitDrawing Class
 The CastUnitDrawing class is for handling cast unit drawings.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.Drawing
 Tekla.Structures.Drawing.CastUnitDrawing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CastUnitDrawing : Drawing
<SerializableAttribute>
Public NotInheritable Class CastUnitDrawing
	Inherits Drawing
The CastUnitDrawing type exposes the following members.
Constructors
Name | Description
CastUnitDrawing(Identifier)
 Instantiates a new cast unit drawing with standard attributes for a given cast unit.
CastUnitDrawing(Identifier, Int32)
 Instantiates a new cast unit drawing with standard attributes and with a specified sheet number for a given cast unit.
CastUnitDrawing(Identifier, String)
 Instantiates a new cast unit drawing with given attributes for a given cast unit.
CastUnitDrawing(Identifier, CastUnitDrawing.CastUnitDrawingCreationType)
 Instantiates a new cast unit drawing with standard attributes for a given cast unit.
CastUnitDrawing(Identifier, Int32, String)
 Instantiates a new cast unit drawing with given attributes and with a specified sheet number for a given cast unit.
CastUnitDrawing(Identifier, CastUnitDrawing.CastUnitDrawingCreationType, Int32)
 Instantiates a new cast unit drawing by id with standard attributes and with a specified sheet number for a given cast unit.
CastUnitDrawing(Identifier, CastUnitDrawing.CastUnitDrawingCreationType, String)
 Instantiates a new cast unit drawing with given attributes for a given cast unit.
CastUnitDrawing(Identifier, CastUnitDrawing.CastUnitDrawingCreationType, Int32, String)
 Instantiates a new cast unit drawing by id with given attributes and with a specified sheet number for a given cast unit.
Top
Properties
Name | Description
CastUnitById
 Cast unit definition method. True means the cast unit definition method is by cast unit id. False means the cast unit definition method is by cast unit position.
CastUnitIdentifier
 The identifier of the model object cast unit.
SheetNumber
 The sheet number of the drawing.
Top
Methods
Name | Description
Insert
 Inserts a new cast unit drawing. Views are added according to the View Creation rules of the standard file. A drawing can be inserted only when there is no active drawing.
 (Overrides DatabaseObject.Insert().)
Modify
 Updates the drawing object in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace