Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_RectangleHollowProfile Properties
The IFC2X3_ParametricObject_RectangleHollowProfile type exposes the following members.
Properties
Name | Description
InnerFilletRadius
 The inner fillet radius.
OuterFilletRadius
 The outer fillet radius.
WallThickness
 The wall thickness.
XDim
 The X dimension.
YDim
 The Y dimension.
Top
See Also
Reference
IFC2X3_ParametricObject_RectangleHollowProfile Class
Tekla.Structures.Model.Collaboration Namespace