Tekla Open API Reference for Tekla Structures 2025
AnalysisVolume Properties
The AnalysisVolume type exposes the following members.
Properties
Name | Description
Material
 The material of the analysis volume.
Profile
 The profile of the analysis volume.
Volume
 The volume item.
VolumeHoles
 The volume holes.
Top
See Also
Reference
AnalysisVolume Class
Tekla.Structures.Analysis Namespace