Tekla Open API Reference for Tekla Structures 2025
PourObject Methods
The PourObject type exposes the following members.
Methods
Name | Description
Delete
 At the moment pour objects cannot be deleted.
 (Overrides ModelObject.Delete().)
GetAssembly |  Obsolete.
 Returns the assembly that the pour object belongs to.
GetFatherPourUnit
 Returns the pour unit that the pour object belongs to.
GetObjects
 Returns an enumerator of all objects related to pour.
GetParts
 Returns an enumerator of all parts related to pour.
GetPourPolymeshes
 Returns a new polymesh enumerator based on merged faces of the pour object in the current plane.
GetSolid
 Returns the solid of the pour object.
GetSurfaceObjects
 Returns an enumerator of all the connected surface objects.
Insert
 At the moment pour objects cannot be inserted.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the pour object with the given identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the pour object instance from the model. The identifier of the instance must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
PourObject Class
Tekla.Structures.Model Namespace