Tekla Open API Reference for Tekla Structures 2025
MarkBase Class
 The MarkBase class contains general mark information and can be selected and modified with the general attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.MarkBase
 Tekla.Structures.Drawing.Mark
 Tekla.Structures.Drawing.MarkSet
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class MarkBase : DrawingObject,
	IObjectAlignedBoundingBox, IAxisAlignedBoundingBox, IMovableRelative, IPlacing, IHasChildren,
	IHideable
<SerializableAttribute>
Public MustInherit Class MarkBase
	Inherits DrawingObject
	Implements IObjectAlignedBoundingBox, IAxisAlignedBoundingBox, IMovableRelative, IPlacing,
	IHasChildren, IHideable
The MarkBase type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the mark base attributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
InsertionPoint
 The insertion point of the mark.
IsAssociativeNote
 Gets a value indicating whether the mark is an associative note.
Placing
 The current placing of the object. See the placing types for different placing options.
Top
Methods
Name | Description
GetAxisAlignedBoundingBox
 Returns the axis aligned bounding box of the text (rectangle format).
GetObjectAlignedBoundingBox
 Returns the object aligned bounding box of the text (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
MoveObjectRelative
 Moves the object using the move vector.
Top
Examples
 The following example enumerates through all marks in all views and changes their frame types to sharpened and their frame colors to red.
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if(MyDrawingHandler.GetConnectionStatus())
           {
               MarkBase MyMarkBase;
               DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
               while(views.MoveNext())
               {
                   DrawingObjectEnumerator allObjects = (views.Current as ViewBase).GetAllObjects();
                   while(allObjects.MoveNext())
                   {
                       if(allObjects.Current is MarkBase)
                       {
                           MyMarkBase = allObjects.Current as MarkBase;
                           MyMarkBase.Attributes.Frame.Color = DrawingColors.Red;
                           MyMarkBase.Attributes.Frame.Type = FrameTypes.Sharpened;
                           MyMarkBase.Modify();
                       }
                   }
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace