Tekla Open API Reference for Tekla Structures 2025
Connection Class
 The Connection class contains methods related to connections. A connection is a drawing object derived from a model object. It represents a drawing connection that has a reference to the actual connection in the model database.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.Connection
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Connection : ModelObject
<SerializableAttribute>
Public NotInheritable Class Connection
	Inherits ModelObject
The Connection type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Delete
 Deletes the drawing connection from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing connection from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace