Tekla Open API Reference for Tekla Structures 2025
Mark.MarkAttributes Class
 The MarkAttributes class defines the mark attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes
 Tekla.Structures.Drawing.Mark.MarkAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class MarkAttributes : MarkBase.MarkBaseAttributes
<SerializableAttribute>
Public Class MarkAttributes
	Inherits MarkBase.MarkBaseAttributes
The Mark.MarkAttributes type exposes the following members.
Constructors
Name | Description
Mark.MarkAttributes(ModelObject)
 Creates a new default mark attributes instance that loads standard attributes.
Mark.MarkAttributes(ModelObject, String)
 Creates a new mark attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Content
 The mark content as a list of elements.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace