Tekla Open API Reference for Tekla Structures 2025
TaskFilterExpressions.ActualStartDate Class
 The ActualStartDate class represents the actual start date filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.DateTimeFilterExpression
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.ActualStartDate
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ActualStartDate : DateTimeFilterExpression
<SerializableAttribute>
Public NotInheritable Class ActualStartDate
	Inherits DateTimeFilterExpression
The TaskFilterExpressions.ActualStartDate type exposes the following members.
Constructors
Name | Description
TaskFilterExpressions.ActualStartDate
 Initializes a new instance of the ActualStartDate class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace