Tekla Open API Reference for Tekla Structures 2025
StraightDimension Methods
The StraightDimension type exposes the following members.
Methods
Name | Description
Delete
 Deletes the straight dimension from the database.
 (Overrides DatabaseObject.Delete().)
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet().)
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Insert
 Inserts the straight dimension to the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the existing straight dimension in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the straight dimension from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
StraightDimension Class
Tekla.Structures.Drawing Namespace