Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameter Properties
The AnalysisDesignParameter type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the value of the analysis design parameter.
Top
See Also
Reference
AnalysisDesignParameter Class
Tekla.Structures.Analysis Namespace