Tekla Open API Reference for Tekla Structures 2025
Seam Methods
The Seam type exposes the following members.
Methods
Name | Description
Delete
 Deletes the seam instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetInputPolygon
 Returns the input polygon of the seam.
GetPrimaryObject
 Returns the primary object.
GetSecondaryObjects
 Returns an array list containing all the secondary objects.
GetStartAndEndPositions
 Returns the start and end points of the seam.
Insert
 Inserts the seam into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing seam in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a seam from the model database. The seam ID must be set.
 (Overrides ModelObject.Select().)
SetInputPolygon
 Sets the input polygon of the seam.
SetInputPositions
 Sets the start and end point of the seam.
SetPrimaryObject
 Sets the primary object.
SetSecondaryObject
 Sets the secondary object of the seam. Use this method if you wish to add only one secondary object to the seam.
SetSecondaryObjects
 Sets the secondary objects.
Top
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace