Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_ZShapeProfile Properties
The IFC2X3_ParametricObject_ZShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
EdgeRadius
 The edge radius.
FilletRadius
 The fillet radius.
FlangeThickness
 The flange thickness.
FlangeWidth
 The flange width.
WebThickness
 The web thickness.
Top
See Also
Reference
IFC2X3_ParametricObject_ZShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace