Tekla Open API Reference for Tekla Structures 2025
AnalysisSubSection Class
 The AnalysisSubSection class contains information related to analysis subsections.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisSubSection
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisSubSection : AnalysisObject
Public NotInheritable Class AnalysisSubSection
	Inherits AnalysisObject
The AnalysisSubSection type exposes the following members.
Constructors
Name | Description
AnalysisSubSection
Initializes a new instance of the AnalysisSubSection class
Top
Properties
Name | Description
B
 The B value.
B1
 The B1 value.
B2
 The B2 value.
B3
 The B3 value.
B4
 The B4 value.
H
 The H value.
H1
 The H1 value.
H2
 The H2 value.
IsHole
 Defines whether the subsection is a hole.
Material
 The material of the subsection.
OffsetAngle
 The offset angle.
OffsetY
 The offset in the direction of the Y-axis.
OffsetZ
 The offset in the direction of the Z-axis.
Points
 The points of the subsection.
R1
 The R1 value.
R2
 The R2 value.
SubType
 The subtype of the subsection.
T1
 The T1 value.
T2
 The T2 value.
T3
 The T3 value.
T4
 The T4 value.
TF
 The TF value.
TW
 The TW value.
Type
 The type of the subsection.
Top
Methods
Name | Description
Select
 Selects an analysis subsection. The analysis subsection identifier must be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace