Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedSelfweightLoad Properties
The AnalysisDecomposedSelfweightLoad type exposes the following members.
Properties
Name | Description
Directions
 The directions of the decomposed selfweight load.
Factors
 The factors of the decomposed selfweight load.
Top
See Also
Reference
AnalysisDecomposedSelfweightLoad Class
Tekla.Structures.Analysis Namespace