Tekla Open API Reference for Tekla Structures 2025
Circle Class
 The Circle class defines the graphical object circle. A circle can also be hatched.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.ClosedGraphicObject
 Tekla.Structures.Drawing.Circle
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Circle : ClosedGraphicObject
<SerializableAttribute>
Public NotInheritable Class Circle
	Inherits ClosedGraphicObject
The Circle type exposes the following members.
Constructors
Name | Description
Circle(ViewBase, Point, Double)
 Creates a new circle instance with a center point and a radius using standard attributes.
Circle(ViewBase, Point, Double, Circle.CircleAttributes)
 Creates a new circle instance with a center point and a radius using the given attributes.
Top
Properties
Name | Description
Attributes
 The attributes of the circle.
CenterPoint
 The center point of the circle.
Radius
 The radius of the circle.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if(MyDrawingHandler.GetConnectionStatus())
           {
               Circle MyCircle;
               DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
               while(views.MoveNext())
               {
                   MyCircle = new Circle(views.Current as ViewBase, new Point(10, 10), 300);
                   MyCircle.Insert();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace