Tekla Open API Reference for Tekla Structures 2025
CustomLineType Class
 The CustomLineType class defines the custom line types of the drawing objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.LineTypes
 Tekla.Structures.Drawing.CustomLineType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CustomLineType : LineTypes,
	ICloneable
<SerializableAttribute>
Public Class CustomLineType
	Inherits LineTypes
	Implements ICloneable
The CustomLineType type exposes the following members.
Properties
Name | Description
Description
 The Description of the custom line type (ASCII representation of the line).
LineDescription
 The description of the custom line type. Description uses the following format: List of line segments. Positive value gives length of filled line segment and negative value gives length of empty line segment. 0 means a dot.
Name
 The Name of the custom line type.
Top
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
 (Overrides LineTypes.Clone().)
Equals
 Returns true if the current object and the given object are equal.
 (Overrides LineTypes.Equals(Object).)
GetHashCode
 Returns a hash code for the object.
 (Overrides LineTypes.GetHashCode().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides LineTypes.IsEqual(Object).)
Top
Operators
Name | Description
Equality
 Returns true if the current object and the given object are equal.
Inequality
 Returns true if the current object and the given object are not equal.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace