Tekla Open API Reference for Tekla Structures 2025
ModelObjectHatchAttributes Class
 The ModelObjectHatchAttributes class contains hatch attributes for model object hatches.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.HatchAttributes
 Tekla.Structures.Drawing.ModelObjectHatchAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ModelObjectHatchAttributes : HatchAttributes
<SerializableAttribute>
Public NotInheritable Class ModelObjectHatchAttributes
	Inherits HatchAttributes
The ModelObjectHatchAttributes type exposes the following members.
Properties
Name | Description
AutomaticScaling
 Specifies whether automatic scaling is enabled. If disabled, custom scale values will be used (see ScaleX and ScaleY).
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace