Tekla Open API Reference for Tekla Structures 2025
GridLine Class
 The GridLine class contains methods related to grid lines. A drawing grid line is always a child of a grid object.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.GridLine
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class GridLine : ModelObject
<SerializableAttribute>
Public NotInheritable Class GridLine
	Inherits ModelObject
The GridLine type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the grid line. For more information see GridLine.GridLineAttributes.
EndLabel
 The end of the grid line, contains the grid label and position information. For more information see GridLine.GridLabel.
StartLabel
 The beginning of the grid line, contains the grid label and position information. For more information see GridLine.GridLabel.
Top
Methods
Name | Description
Delete
 GridLines cannot be deleted.
 (Overrides DatabaseObject.Delete().)
Insert
 GridLines cannot be inserted.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Drawing MyDrawing = new GADrawing();
           View curview = new View(MyDrawing.GetSheet(), new CoordinateSystem(), new CoordinateSystem(),
               new AABB(new Point(), new Point(30000, 30000, 10000)));
           DrawingObjectEnumerator allObjects = curview.GetAllObjects();
           Grid curGrid = allObjects.Current as Grid;
           GridLine curGridLine;
           DrawingObjectEnumerator allGridLines = curGrid.GetObjects();
           while(allGridLines.MoveNext()) /* Iterate through all the grid lines of the grid */
           {
               if(allGridLines.Current is GridLine)
               {
                   curGridLine = allGridLines.Current as GridLine;
                   curGridLine.Attributes.DrawTextAtStartOfGridLine = true;
                   curGridLine.Attributes.DrawTextAtEndOfGridLine = true;
                   curGridLine.Attributes.Font.Color = DrawingColors.Red;
                   // The following code moves the grid labels off the grid lines by 200.
                   curGridLine.StartLabel.GridLabelPoint.Y = curGridLine.StartLabel.GridPoint.Y + 200;
                   curGridLine.EndLabel.GridLabelPoint.Y = curGridLine.EndLabel.GridPoint.Y + 200;
                   curGridLine.Modify(); /* Apply changes */
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace