Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterMulti Properties
The AnalysisDesignParameterMulti type exposes the following members.
Properties
Name | Description
MultiValueCount
 Gets the multi value count of the analysis design parameter.
Top
See Also
Reference
AnalysisDesignParameterMulti Class
Tekla.Structures.Analysis Namespace