Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_RectangleProfile Class
 The IFC2X3_ParametricObject_RectangleProfile class contains the rectangular profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_RectangleProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_RectangleProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_RectangleProfile type exposes the following members.
Properties
Name | Description
XDim
 The X dimension.
YDim
 The Y dimension.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace