Tekla Open API Reference for Tekla Structures 2025
ReinforcementSingle Methods
The ReinforcementSingle type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
See Also
Reference
ReinforcementSingle Class
Tekla.Structures.Drawing Namespace