Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase Methods
The SectionMarkBase type exposes the following members.
Methods
Name | Description
Delete
 Deletes the section mark from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 Inserts the section mark into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the section mark in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the section mark from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
SectionMarkBase Class
Tekla.Structures.Drawing Namespace