Tekla Open API Reference for Tekla Structures 2025
BentPlate Properties
The BentPlate type exposes the following members.
Properties
Name | Description
Geometry
 Gets or sets the geometry of the bent plate.
Thickness
 Gets thickness of the bent plate.
Top
See Also
Reference
BentPlate Class
Tekla.Structures.Model Namespace