Tekla Open API Reference for Tekla Structures 2025
Rectangle Class
 The Rectangle class defines a rectangle that is a box made of four lines with orthogonal angles.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.ClosedGraphicObject
 Tekla.Structures.Drawing.Rectangle
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Rectangle : ClosedGraphicObject
<SerializableAttribute>
Public NotInheritable Class Rectangle
	Inherits ClosedGraphicObject
The Rectangle type exposes the following members.
Constructors
Name | Description
Rectangle(ViewBase, Point, Point)
 Creates a new rectangle instance with two points using standard attributes. Please note that creating a rectangle using two points will re-calculate the start point to correspond with positive widths and heights.
Rectangle(ViewBase, Point, Double, Double)
 Creates a new rectangle instance with the start point and the defined width and height using standard attributes.
Rectangle(ViewBase, Point, Point, Rectangle.RectangleAttributes)
 Creates a new rectangle instance with two points using the given attributes. Please note that creating a rectangle using two points will re-calculate the start point to correspond with positive widths and heights.
Rectangle(ViewBase, Point, Double, Double, Rectangle.RectangleAttributes)
 Creates a new rectangle instance with the start point and the defined width and height using the given attributes.
Top
Properties
Name | Description
Angle
 The angle of the rectangle. The rectangle rotates around its start point.
Attributes
 The attributes of the rectangle.
EndPoint
 The end point of the rectangle.
Height
 The height of the rectangle. Changing the height changes the end point with the height.
StartPoint
 The start point of the rectangle. Changing this will move the rectangle.
Width
 The width of the rectangle. Changing the width changes the end point with the width.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if(MyDrawingHandler.GetConnectionStatus())
           {
               Rectangle MyRectangle;
               DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
               while(views.MoveNext())
               {
                   MyRectangle = new Rectangle(views.Current as ViewBase, new Point(10,10), new Point(300,300));
                   MyRectangle.Insert();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace