Tekla Open API Reference for Tekla Structures 2025
LogicalAreaFilterExpressions.Site Class
 The Site class represents the site filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Site
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Site : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Site
	Inherits StringFilterExpression
The LogicalAreaFilterExpressions.Site type exposes the following members.
Constructors
Name | Description
LogicalAreaFilterExpressions.Site
 Initializes a new instance of the Site class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace