Tekla Open API Reference for Tekla Structures 2025
IPlacing Interface
 The IPlacing interface is for objects that can have different placings.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IPlacing : IHasChildren
Public Interface IPlacing
	Inherits IHasChildren
The IPlacing type exposes the following members.
Properties
Name | Description
Placing
 The current placing of the object. See PlacingTypes for different placing options.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace