Tekla Open API Reference for Tekla Structures 2025
ControlPlane Class
 The ControlPlane class defines a user defined (possibly magnetic) plane helping in modeling work.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.ControlPlane
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ControlPlane : ModelObject
<SerializableAttribute>
Public NotInheritable Class ControlPlane
	Inherits ModelObject
The ControlPlane type exposes the following members.
Constructors
Name | Description
ControlPlane()
 Creates a new control plane instance.
The default values are as follows:
Plane = new Plane();
IsMagnetic = false;
Name = "Plane";
ControlPlane(Plane, Boolean)
 Creates a new control plane instance taking the plane and magnetism as input.
Top
Properties
Name | Description
IsMagnetic
 Determines whether the plane is magnetic or not.
Name
 The name of the control plane.
Plane
 The plane defining the position of the control plane.
Top
Methods
Name | Description
Delete
 Deletes the control plane with the given ID.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control plane into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control plane with the given ID.
 (Overrides ModelObject.Modify().)
Select
 Selects the control plane with the given ID.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           ControlPlane controlPlane = new ControlPlane();
           Plane plane = new Plane();
           plane.Origin = new Point(6000,6000,0);
           plane.AxisX = new Vector(-3000,0,0);
           plane.AxisY = new Vector(0,6000,0);
           controlPlane.Plane = plane;
           controlPlane.IsMagnetic = true;
           bool Result = false;
           Result = controlPlane.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace