Tekla Open API Reference for Tekla Structures 2025
Polygon.PolygonAttributes Class
 The PolygonAttributes class is the attributes class of the polygon.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes
 Tekla.Structures.Drawing.Polygon.PolygonAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PolygonAttributes : ClosedGraphicObject.ClosedGraphicObjectAttributes
<SerializableAttribute>
Public NotInheritable Class PolygonAttributes
	Inherits ClosedGraphicObject.ClosedGraphicObjectAttributes
The Polygon.PolygonAttributes type exposes the following members.
Constructors
Name | Description
Polygon.PolygonAttributes()
 Creates a new default polygon attributes instance that loads standard attributes.
Polygon.PolygonAttributes(String)
 Creates a new polygon attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace