Tekla Open API Reference for Tekla Structures 2025
SingleRebar Methods
The SingleRebar type exposes the following members.
Methods
Name | Description
Delete
 Deletes the single rebar instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetRebarSet
 Gets the parent RebarSet of the single rebar.
Insert
 Inserts the single rebar into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing single rebar in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a single rebar from the model database. The reinforcement identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
SingleRebar Class
Tekla.Structures.Model Namespace