Tekla Open API Reference for Tekla Structures 2025
AnalysisMember Properties
The AnalysisMember type exposes the following members.
Properties
Name | Description
AnalysisDesignCode
 Gets or sets the analysis design code of the member.
Composite
 Gets or sets the composite settings of the member.
Curvature
 Gets or sets the beam curvature of the member.
End
 Gets or sets the analysis beam end settings at the end of the member.
Label
 Gets or sets the label of the analysis member.
Material
 Gets or sets the material of the analysis member.
Start
 Gets or sets the analysis beam end settings at the start of the member.
Top
See Also
Reference
AnalysisMember Class
Tekla.Structures.Analysis Namespace