Tekla Open API Reference for Tekla Structures 2025
Cloud Class
 The Cloud class defines a cloud that is a polygon with a specific size set for the bulges.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.ClosedGraphicObject
 Tekla.Structures.Drawing.Cloud
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Cloud : ClosedGraphicObject
<SerializableAttribute>
Public NotInheritable Class Cloud
	Inherits ClosedGraphicObject
The Cloud type exposes the following members.
Constructors
Name | Description
Cloud(ViewBase, PointList)
 Creates a new cloud instance with a point list using standard attributes.
Cloud(ViewBase, PointList, Cloud.CloudAttributes)
 Creates a new cloud instance with a point list using the given attributes.
Top
Properties
Name | Description
Attributes
 The attributes for the cloud.
Bulge
 The bulge (curve) to use for the cloud (a bulge is the ratio between the height and width of an object).
Points
 The list of points for the cloud. The points you insert will specify the corner points of the cloud. After you insert the object, you will get every cloud point back.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if(MyDrawingHandler.GetConnectionStatus())
           {
               Cloud MyCloud;
               PointList PolygonPoints = new PointList();
               PolygonPoints.Add(new Point(10,10));
               PolygonPoints.Add(new Point(50,10));
               PolygonPoints.Add(new Point(50,50));
               PolygonPoints.Add(new Point(10,50));
               DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
               while(views.MoveNext())
               {
                   MyCloud = new Cloud(views.Current as ViewBase, PolygonPoints);
                   MyCloud.Insert();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace