Tekla Open API Reference for Tekla Structures 2025
Weld Methods
The Weld type exposes the following members.
Methods
Name | Description
Delete
 Deletes the weld instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetLogicalWeld
 Gets the logical weld where the weld belongs. Returns false if the weld does not belong to any logical weld.
Insert
 Inserts the weld into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing weld in the model database to match the current one. The modification cannot be done if the weld is a part of a logical weld.
 (Overrides ModelObject.Modify().)
Select
 Selects a weld from the model database. The weld identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Weld Class
Tekla.Structures.Model Namespace