Tekla Open API Reference for Tekla Structures 2025
HyperLink Class
 The HyperLink class defines a hyperlink object in a drawing. When a hyperlink is double clicked, the default browser is launched.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.LinkBase
 Tekla.Structures.Drawing.HyperLink
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class HyperLink : LinkBase
<SerializableAttribute>
Public NotInheritable Class HyperLink
	Inherits LinkBase
The HyperLink type exposes the following members.
Constructors
Name | Description
HyperLink(ViewBase, Point, Uri, String)
 Creates a new hyperlink instance using standard attributes.
HyperLink(ViewBase, Point, Uri, String, LinkAttributes)
 Creates a new hyperlink instance using the given attributes.
HyperLink(ViewBase, Point, Uri, String, Size)
 Creates a new hyperlink instance using standard attributes.
HyperLink(ViewBase, Point, Uri, String, Size, LinkAttributes)
 Creates a new hyperlink instance using the given attributes.
Top
Properties
Name | Description
Target
 Gets or sets the target.
Top
Methods
Name | Description
Delete
 Deletes the link.
 (Overrides DatabaseObject.Delete().)
Insert
 Inserts the link.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the link.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the link.
 (Overrides DatabaseObject.Select().)
Top
Examples
 The following example shows how to insert a hyperlink:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           ViewBase _view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
           HyperLink link = new HyperLink(_view, new Point(200, 200),
               new Uri("http://www.tekla.com"),
               "Link to Tekla home page");
           link.Insert();
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace