Tekla Open API Reference for Tekla Structures 2025
AnalysisVolumeItem Class
 The AnalysisVolumeItem class contains information related to analysis volume items.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisVolumeItem
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisVolumeItem : AnalysisObject
Public NotInheritable Class AnalysisVolumeItem
	Inherits AnalysisObject
The AnalysisVolumeItem type exposes the following members.
Constructors
Name | Description
AnalysisVolumeItem
Initializes a new instance of the AnalysisVolumeItem class
Top
Properties
Name | Description
Faces
 The faces of the analysis volume item.
Top
Methods
Name | Description
Select
 Selects an analysis volume item. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace