Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier Methods
The RebarPropertyModifier type exposes the following members.
Methods
Name | Description
GetAffectedBars
 Gets the virtual bars affected by this modifier.
Top
See Also
Reference
RebarPropertyModifier Class
Tekla.Structures.Model Namespace