Tekla Open API Reference for Tekla Structures 2025
FacesAtAnObtuseAngleException Class
 The FacesAtAnObtuseAngleException class represents an error when, faces to be connected are too steep of an angle.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.FacesAtAnObtuseAngleException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class FacesAtAnObtuseAngleException : ConnectiveGeometryException
<SerializableAttribute>
Public Class FacesAtAnObtuseAngleException
	Inherits ConnectiveGeometryException
The FacesAtAnObtuseAngleException type exposes the following members.
Constructors
Name | Description
FacesAtAnObtuseAngleException
 Initializes a new instance of the FacesAtAnObtuseAngleException class with "Faces to be connected are too steep of an angle" error message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace