Tekla Open API Reference for Tekla Structures 2025
SinglePartDrawing Properties
The SinglePartDrawing type exposes the following members.
Properties
Name | Description
PartIdentifier
 The identifier of the model object part.
SheetNumber
 The sheet number of the drawing.
Top
See Also
Reference
SinglePartDrawing Class
Tekla.Structures.Drawing Namespace