Tekla Open API Reference for Tekla Structures 2025
ReinforcementStrand Properties
The ReinforcementStrand type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementStrandAttributes.
ReinforcementCustomPosition
 Defines the location of the reinforcement bar when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized. This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.
Top
See Also
Reference
ReinforcementStrand Class
Tekla.Structures.Drawing Namespace