Tekla Open API Reference for Tekla Structures 2025
ControlArc Class
 The ControlArc class defines a user defined arc helping in modeling work.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.ControlArc
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ControlArc : ModelObject
<SerializableAttribute>
Public NotInheritable Class ControlArc
	Inherits ModelObject
The ControlArc type exposes the following members.
Constructors
Name | Description
ControlArc()
 Creates a new control arc instance.
The default values are as follows:
CenterPoint = Point(0.0, 0.0, 0.0);
StartPoint = Point(0.0, 1000.0, 0.0);
EndPoint = Point(1000.0, 0.0, 0.0);
Color = ControlObjectColorEnum.YELLOW;
ControlArc(Point, Point, Point)
 Creates a new control arc instance taking the 3 points.
Top
Properties
Name | Description
Color
 Gets or sets color of the control arc.
Geometry
 Gets or sets the arc geometry. The arc must not represent a complete circle (i.e. the arc angle must be less than 360 degrees).
LineType
 The line type of the control arc.
Top
Methods
Name | Description
Delete
 Deletes the control arc with the given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control arc into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control arc with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the control arc with the given Identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Tekla.Structures.Model Namespace