Tekla Open API Reference for Tekla Structures 2025
PourBreak Properties
The PourBreak type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the pour break. For more information see PourBreak.PourBreakAttributes.
Top
See Also
Reference
PourBreak Class
Tekla.Structures.Drawing Namespace