Tekla Open API Reference for Tekla Structures 2025
RebarEndDetailModifier Properties
The RebarEndDetailModifier type exposes the following members.
Properties
Name | Description
EndType
 Gets or sets the end type.
RebarCranking
 Gets or sets the rebar cranking.
RebarHook
 Gets or sets the reinforcing bar hook data.
RebarLengthAdjustment
 Gets or sets the reinforcing bar length adjustment data.
RebarThreading
 Gets or sets the reinforcing bar threading data.
Top
See Also
Reference
RebarEndDetailModifier Class
Tekla.Structures.Model Namespace