Tekla Open API Reference for Tekla Structures 2025
PickerInputNPoints Properties
The PickerInputNPoints type exposes the following members.
Properties
Name | Description
PickedPoints
 Gets or sets the list of picked points in the view coordinates.
Top
See Also
Reference
PickerInputNPoints Class
Tekla.Structures.Drawing Namespace