Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedAreaLoad Properties
The AnalysisDecomposedAreaLoad type exposes the following members.
Properties
Name | Description
Direction
 The direction of the decomposed area load.
Magnitudes
 The magnitudes of the decomposed area load.
Positions
 The positions of the decomposed area load.
Top
See Also
Reference
AnalysisDecomposedAreaLoad Class
Tekla.Structures.Analysis Namespace