Tekla Open API Reference for Tekla Structures 2025
ReinforcingBarFilterExpressions.JoinType Class
 The JoinType class represents the join type filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.JoinType
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class JoinType : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class JoinType
	Inherits StringFilterExpression
The ReinforcingBarFilterExpressions.JoinType type exposes the following members.
Constructors
Name | Description
ReinforcingBarFilterExpressions.JoinType
 Initializes a new instance of the JoinType class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace