Tekla Open API Reference for Tekla Structures 2025
Seam Properties
The Seam type exposes the following members.
Properties
Name | Description
AutoDirectionType
 The auto direction type. Default value is AUTODIR_BASIC. Value should be AUTODIR_NA to set direction with UpVector property. Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with seam attribute file.
AutoPosition
 The auto position type. Defines that the seam will internally evaluate the final position more accurately. The input positions are still needed for reference.
Class
 The class of the seam.
Code
 The code of the seam. The code can be used to classify the seam. The code can be reported and shown in drawings. The maximum length of the string is 20 characters.
Status
 The read only status of the seam. The status can be reported and shown in drawings. The color of the connection symbol in the model indicates the status of the seam.
UpVector
 A vector indicating which direction is considered the up direction for the seam.
Top
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace