Tekla Open API Reference for Tekla Structures 2025
ConicalSurface Properties
The ConicalSurface type exposes the following members.
Properties
Name | Description
Apex
 Gets the apex of the cone. If it does not exist, it returns null
Radiuses
 Gets radiuses of the conical surface. The first radius corresponds to the section located in the first point of the side boundary 1, and the second radius corresponds to the section located in the second point of the side boundary 1.
Top
See Also
Reference
ConicalSurface Class
Tekla.Structures.Model Namespace