Tekla Open API Reference for Tekla Structures 2025
Detail Class
 The Detail class represents a detail. A detail is different from a connection since the detail only connects to one part.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseComponent
 Tekla.Structures.Model.Detail
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Detail : BaseComponent
<SerializableAttribute>
Public NotInheritable Class Detail
	Inherits BaseComponent
The Detail type exposes the following members.
Constructors
Name | Description
Detail
 Creates a new detail instance.
Top
Properties
Name | Description
AutoDirectionType
 The auto direction type. Default value is AUTODIR_DETAIL. Value should be AUTODIR_NA to set direction with UpVector property. Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with detail attribute file.
Class
 The class of the detail.
Code
 The code of the detail. The code can be used to classify the detail. The code can be reported and shown in drawings. The maximum length of the string is 20 characters.
DetailType
 The detail type.
PositionType
 The position type.
Status
 The read only status of the detail. The status can be reported and shown in drawings. The color of the detail symbol in the model indicates the status of the detail.
UpVector
 A vector indicating which direction is considered the up direction.
Top
Methods
Name | Description
Delete
 Deletes the detail instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetPrimaryObject
 Returns the primary object.
GetReferencePoint
 Returns the reference point.
Insert
 Inserts the detail into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing detail in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a detail from the model database. The detail ID must be set.
 (Overrides ModelObject.Select().)
SetPrimaryObject
 Sets the detail's primary object.
SetReferencePoint
 Sets the reference point; the point the user would pick for the detail to appear to.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using Tekla.Structures;
using System;
public class Example
{
       public void Example1()
       {
           Beam B = new Beam(new Point(13000,3000,-500), new Point(13000,3000,6000));
           B.Profile.ProfileString = "HEA400";
           B.Material.MaterialString = "S235JR";
           if(B.Insert())
           {
               Detail D = new Detail();
               D.Name = "Test End Plate Detail";
               D.Number = 1002;
               D.LoadAttributesFromFile("standard");
               D.UpVector = new Vector(0,0,0);
               D.PositionType = PositionTypeEnum.MIDDLE_PLANE;
               D.AutoDirectionType = AutoDirectionTypeEnum.AUTODIR_DETAIL;
               D.DetailType = DetailTypeEnum.END;
               D.SetPrimaryObject(B);
               D.SetReferencePoint(new Point(13000,3000,3000));
               D.SetAttribute("el", 33.0);
               D.SetAttribute("er", 33.0);
               if(!D.Insert())
               {
                   Console.WriteLine("Detail Insert failed");
               }
               else
               {
                   Console.WriteLine(D.Identifier.ID);
                   Double DValue = 0.0;
                   if(!D.GetAttribute("er", ref DValue) || DValue != 33)
                       Console.WriteLine("Detail GetAttribute failed");
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Model Namespace