Tekla Open API Reference for Tekla Structures 2025
CylindricalSurfaceNode Properties
The CylindricalSurfaceNode type exposes the following members.
Properties
Name | Description
Surface
 Gets the cylindrical surface geometry.
Top
See Also
Reference
CylindricalSurfaceNode Class
Tekla.Structures.Model Namespace