Tekla Open API Reference for Tekla Structures 2025
AnalysisCrossSection Class
 The AnalysisCrossSection class contains information related to analysis cross sections.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisCrossSection
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisCrossSection : AnalysisObject
Public NotInheritable Class AnalysisCrossSection
	Inherits AnalysisObject
The AnalysisCrossSection type exposes the following members.
Constructors
Name | Description
AnalysisCrossSection
 Creates a new instance of an analysis cross section.
Top
Properties
Name | Description
A
 The cross section area (m2) of the analysis cross section.
AnalysisSubSections
 The subsections of the analysis cross section.
Avy
 The shear area for loads parallel to the Y-axis (m2) of the analysis cross section.
Avz
 The shear area for loads parallel to the Z-axis (m2) of the analysis cross section.
Calculated
 Indicates whether section values have been calculated.
G
 The mass per unit of length (kg/m) of the analysis cross section.
It
 The torsion moment (m4) of the analysis cross section.
Iw
 The warping constant (m6) of the analysis cross section.
Iy
 The radius of gyration about the Y-axis (m) of the analysis cross section.
Iyy
 The moment of inertia about the Y-axis (m4) of the analysis cross section.
Iz
 The radius of gyration about the Z-axis (m) of the analysis cross section.
Izz
 The moment of inertia about the Z-axis (m4) of the analysis cross section.
Name
 The name of the analysis cross section.
Wplyy
 The plastic modulus about the Y-axis (m3) of the analysis cross section.
Wplzz
 The plastic modulus about the Z-axis (m3) of the analysis cross section.
Wyy
 The elastic modulus about the Y-axis (m3) of the analysis cross section.
Wzz
 The elastic modulus about the Z-axis (m3) of the analysis cross section.
Top
Methods
Name | Description
Delete
 Deletes an analysis cross section. The AnalysisModelName and ID have to be set.
GetCrossSectionGroup
 Gets the cross section group.
Insert
 Inserts an analysis cross section. The AnalysisModelName has to be set.
Select
 Selects an analysis cross section. The AnalysisModelName and ID/Name have to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace