Tekla Open API Reference for Tekla Structures 2025
ModelObject Properties
The ModelObject type exposes the following members.
Properties
Name | Description
IsUpToDate
Gets if the object does not have a modification which is not shared.
ModificationTime
Gets latest time of the object was modified or created.
Top
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace