Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedTemperatureLoad Class
 The AnalysisDecomposedTemperatureLoad class contains information related to decomposed temperature loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedTemperatureLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDecomposedTemperatureLoad : AnalysisDecomposedLoad
Public NotInheritable Class AnalysisDecomposedTemperatureLoad
	Inherits AnalysisDecomposedLoad
The AnalysisDecomposedTemperatureLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedTemperatureLoad
Initializes a new instance of the AnalysisDecomposedTemperatureLoad class
Top
Properties
Name | Description
AxialTemperatureDifference
 The axial temperature difference of the decomposed temperature load.
HorizontalTemperatureDifference
 The horizontal temperature difference of the decomposed temperature load.
Strain
 The strain of the decomposed temperature load.
VerticalTemperatureDifference
 The vertical temperature difference of the decomposed temperature load.
Top
Methods
Name | Description
Select
 Selects an analysis decomposed temperature load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace