Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier Methods
The BaseRebarModifier type exposes the following members.
Methods
Name | Description
Delete
 Deletes the rebar modifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the rebar modifier into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing rebar modifier in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the rebar modifier from the model database. The identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
BaseRebarModifier Class
Tekla.Structures.Model Namespace