Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer Methods
The EdgeChamfer type exposes the following members.
Methods
Name | Description
Delete
 Deletes the edge chamfer instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the edge chamfer into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing edge chamfer in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects an edge chamfer from the model database. The edge chamfer ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
EdgeChamfer Class
Tekla.Structures.Model Namespace