Tekla Open API Reference for Tekla Structures 2025
Component Class
 The Component class represents a component. A component is a modelling tool that typically assembles multiple parts to build some type of a structure, for example a hall macro or at a smaller scale a reinforcement component (a macro). Also, a custom part is a component.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseComponent
 Tekla.Structures.Model.Component
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Component : BaseComponent,
	IAssemblable
<SerializableAttribute>
Public NotInheritable Class Component
	Inherits BaseComponent
	Implements IAssemblable
The Component type exposes the following members.
Constructors
Name | Description
Component()
 Creates a new component instance.
Component(ComponentInput)
 Creates a new component instance with the given component input.
Top
Properties
Name | Description
Top
Methods
Name | Description
Delete
 Deletes the component instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetAssembly
 Returns the assembly that the component belongs to.
GetBooleans
 Returns an enumerator of all the connected boolean objects.
GetComponentInput
 Returns the component input object.
GetComponents
 Returns an enumerator of all the connected components.
Insert
 Inserts the component into the model database. The component input needs to be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing component in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a component from the model database. The component ID must be set.
 (Overrides ModelObject.Select().)
SetComponentInput
 Sets the component input object for the component. The component input object contains all the input objects and positions that are needed for the component creation.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           Beam myBeam = new Beam(new Point(12000, 0, 0), new Point(12000, 6000, 0));
           myBeam.Profile.ProfileString = "380*380";
           myBeam.Material.MaterialString = "Concrete_Undefined";
           if (myBeam.Insert())
           {
               Component myComponent = new Component();
               myComponent.Name = "Beam Reinforcement";
               myComponent.Number = 30000063;
               ComponentInput CI = new ComponentInput();
               CI.AddInputObject(myBeam);
               myComponent.SetComponentInput(CI);
               myComponent.LoadAttributesFromFile("standard");
               myComponent.SetAttribute("side_bar_space", 333.0);
               if (!myComponent.Insert())
               {
                   Console.WriteLine("Component Insert failed");
               }
               else
               {
                   Console.WriteLine(myComponent.Identifier.ID);
                   Double DValue = 0.0;
                   if (!myComponent.GetAttribute("side_bar_space", ref DValue) || DValue != 333)
                       Console.WriteLine("Component GetAttribute failed");
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Model Namespace