Tekla Open API Reference for Tekla Structures 2025
LoadTemperature Properties
The LoadTemperature type exposes the following members.
Properties
Name | Description
AutomaticPrimaryAxisWeight |  Obsolete.
 Property not supported in LoadTemperature class.
CreateFixedSupportConditionsAutomatically |  Obsolete.
 Property not supported in LoadTemperature class.
InitialAxialElongation
 Gets or sets the initial axial elongation.
LoadDispersionAngle |  Obsolete.
 Property not supported in LoadTemperature class.
Position1
 Gets or sets the first input position point.
Position2
 Gets or sets the second input position point.
PrimaryAxisDirection |  Obsolete.
 Property not supported in LoadTemperature class.
Spanning |  Obsolete.
 Property not supported in LoadTemperature class.
TemperatureChangeForAxialElongation
 Gets or sets the temperature change for axial elongation.
TemperatureDifferentialSideToSide
 Gets or sets the temperature differential from side to side.
TemperatureDifferentialTopToBottom
 Gets or sets the temperature differential from top to bottom.
Weight |  Obsolete.
 Property not supported in LoadTemperature class.
Top
See Also
Reference
LoadTemperature Class
Tekla.Structures.Model Namespace