Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSetAttributes Properties
The StraightDimensionSet.StraightDimensionSetAttributes type exposes the following members.
Properties
Name | Description
CombinedDimension
 Combines the attributes of the dimension.
DimensionType
 The dimension type.
Exaggeration
 The exaggeration attributes of the dimension.
ExcludePartsAccordingToFilter
 Sets the filter to use for excluding parts from the tags. You may query the possible filters using StraightDimensionSet.GetAllExcludePartsAccordingToFilter()
ExtensionLine
 The extension line presentation of the dimension.
IncludePartCountInTag
 Gets or sets whether the part count is included in at least one of the tag position, or set part count flag for all tag positions.
IncludePartCountInTagA
 Gets or sets a value indicating whether the part count is included in the tag A.
IncludePartCountInTagB
 Gets or sets a value indicating whether the part count is included in the tag B.
IncludePartCountInTagC
 Gets or sets a value indicating whether the part count is included in the tag C.
IncludePartCountInTagD
 Gets or sets a value indicating whether the part count is included in the tag D.
IncludePartCountInTagE
 Gets or sets a value indicating whether the part count is included in the tag E.
IncludePartCountInTagF
 Gets or sets a value indicating whether the part count is included in the tag F.
IncludePartCountInTagG
 Gets or sets a value indicating whether the part count is included in the tag G.
LeftLowerTag
 The left lower dimension tag.
LeftMiddleTag
 The left middle dimension tag.
LeftUpperTag
 The left upper dimension tag.
RightLowerTag
 The right lower dimension tag.
RightMiddleTag
 The right middle dimension tag.
RightUpperTag
 The right upper dimension tag.
ShortDimension
 How short dimensions are shown.
Top
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
Tekla.Structures.Drawing Namespace