Tekla Open API Reference for Tekla Structures 2025
CylindricalSurfaceNode Class
 The CylindricalSurfaceNode class represents cylindrical surface geometry tree node.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.BendSurfaceNode
 Tekla.Structures.Model.CylindricalSurfaceNode
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CylindricalSurfaceNode : BendSurfaceNode
<SerializableAttribute>
Public NotInheritable Class CylindricalSurfaceNode
	Inherits BendSurfaceNode
The CylindricalSurfaceNode type exposes the following members.
Constructors
Name | Description
CylindricalSurfaceNode
 Initializes a new instance of the CylindricalSurfaceNode class.
Top
Properties
Name | Description
Surface
 Gets the cylindrical surface geometry.
Top
Methods
Name | Description
AcceptVisitor
 Entry method for the visitor pattern
 (Overrides BendSurfaceNode.AcceptVisitor(IGeometryNodeVisitor).)
Clone
 Creates a new object that is a copy of the current instance.
 (Overrides BendSurfaceNode.Clone().)
Top
See Also
Reference
Tekla.Structures.Model Namespace