Tekla Open API Reference for Tekla Structures 2025
TaskFilterExpressions.PlannedStartDate Class
 The PlannedStartDate class represents the planned start date filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.DateTimeFilterExpression
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.PlannedStartDate
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PlannedStartDate : DateTimeFilterExpression
<SerializableAttribute>
Public NotInheritable Class PlannedStartDate
	Inherits DateTimeFilterExpression
The TaskFilterExpressions.PlannedStartDate type exposes the following members.
Constructors
Name | Description
TaskFilterExpressions.PlannedStartDate
 Initializes a new instance of the PlannedStartDate class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace