Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem Methods
The LibraryProfileItem type exposes the following members.
Methods
Name | Description
Copy
 Copy the library profile item in the profile database to item with new name.
Delete
 Deletes the profile item in the profile database.
Modify
 Modifies the profile item in the profile database.
Select(String)
 Selects the profile item in the profile database using the given name.
Top
See Also
Reference
LibraryProfileItem Class
Tekla.Structures.Catalogs Namespace