Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_CircleHollowProfile Class
 The IFC2X3_ParametricObject_CircleHollowProfile class contains the circular and hollow profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CircleHollowProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_CircleHollowProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_CircleHollowProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_CircleHollowProfile type exposes the following members.
Properties
Name | Description
Radius
 The radius.
WallThickness
 The wall thickness.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace