Tekla Open API Reference for Tekla Structures 2025
LogicalAreaFilterExpressions.Building Class
 The Building class represents the building filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Building
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Building : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Building
	Inherits StringFilterExpression
The LogicalAreaFilterExpressions.Building type exposes the following members.
Constructors
Name | Description
LogicalAreaFilterExpressions.Building
 Initializes a new instance of the Building class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace