Tekla Open API Reference for Tekla Structures 2025
Grid Methods
The Grid type exposes the following members.
Methods
Name | Description
Delete
 Grids cannot be deleted.
 (Overrides DatabaseObject.Delete().)
GetObjects()
 Retrieves a DrawingObjectEnumerator for all the grid lines of the grid.
GetObjects(Type[])
 Retrieves a DrawingObjectEnumerator for all the grid lines of the grid that are of certain TypeFilter.
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Grid Class
Tekla.Structures.Drawing Namespace