Tekla Open API Reference for Tekla Structures 2025
LoadPoint Properties
The LoadPoint type exposes the following members.
Properties
Name | Description
Moment
 The moment vector. The values are given in the local coordinate system of the load (not in the current coordinate system).
P
 The load vector. The values are given in the local coordinate system of the load (not in the current coordinate system).
Position
 The position.
Top
See Also
Reference
LoadPoint Class
Tekla.Structures.Model Namespace