Tekla Open API Reference for Tekla Structures 2025
LoadTemperature Class
 The LoadTemperature class defines a temperature change in a part, or a temperature difference between two part surfaces.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Load
 Tekla.Structures.Model.LoadTemperature
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LoadTemperature : Load
<SerializableAttribute>
Public NotInheritable Class LoadTemperature
	Inherits Load
The LoadTemperature type exposes the following members.
Constructors
Name | Description
LoadTemperature
 Initializes a new instance of the LoadTemperature class.
Top
Properties
Name | Description
AutomaticPrimaryAxisWeight |  Obsolete.
 Property not supported in LoadTemperature class.
CreateFixedSupportConditionsAutomatically |  Obsolete.
 Property not supported in LoadTemperature class.
InitialAxialElongation
 Gets or sets the initial axial elongation.
LoadDispersionAngle |  Obsolete.
 Property not supported in LoadTemperature class.
Position1
 Gets or sets the first input position point.
Position2
 Gets or sets the second input position point.
PrimaryAxisDirection |  Obsolete.
 Property not supported in LoadTemperature class.
Spanning |  Obsolete.
 Property not supported in LoadTemperature class.
TemperatureChangeForAxialElongation
 Gets or sets the temperature change for axial elongation.
TemperatureDifferentialSideToSide
 Gets or sets the temperature differential from side to side.
TemperatureDifferentialTopToBottom
 Gets or sets the temperature differential from top to bottom.
Weight |  Obsolete.
 Property not supported in LoadTemperature class.
Top
Methods
Name | Description
Delete
 Deletes the load temperature instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the load temperature into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing load temperature in the model database to match the current one. At the moment it is not possible to change the load attachment or the father.
 (Overrides ModelObject.Modify().)
Select
 Selects a load temperature from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using System;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           LoadTemperature temperatureLoad = new LoadTemperature();
           temperatureLoad.Position1 = new Point(0, 0, 0);
           temperatureLoad.Position2 = new Point(1000, 0, 0);
           temperatureLoad.BoundingBoxDx = 500;
           temperatureLoad.BoundingBoxDy = 500;
           temperatureLoad.BoundingBoxDz = 500;
           temperatureLoad.PartNames = Load.LoadPartNamesEnum.LOAD_PART_NAMES_INCLUDE;
           temperatureLoad.PartFilter = "example";
           temperatureLoad.TemperatureChangeForAxialElongation = 1.0;
           temperatureLoad.TemperatureDifferentialSideToSide = 2.0;
           temperatureLoad.TemperatureDifferentialTopToBottom = 3.0;
           temperatureLoad.InitialAxialElongation = 4.0;
           if (!temperatureLoad.Insert())
           {
               Console.WriteLine("Temperature load insert failed!");
           }
       }
}
See Also
Reference
Tekla.Structures.Model Namespace