Tekla Open API Reference for Tekla Structures 2025
DimensionSetBase Methods
The DimensionSetBase type exposes the following members.
Methods
Name | Description
AddToDimensionSet
 Adds a dimension set to the current dimension set.
GetObjects()
 Gets the children straight dimensions of the current straight dimension set.
GetObjects(Type[])
 Gets the children straight dimensions of the current straight dimension set that are of certain types.
Top
See Also
Reference
DimensionSetBase Class
Tekla.Structures.Drawing Namespace