Tekla Open API Reference for Tekla Structures 2025
AnalysisMaterial Properties
The AnalysisMaterial type exposes the following members.
Properties
Name | Description
DampingFactor
 Gets or sets the damping factor of the material.
Density
 Gets or sets the density of the material.
MaterialType
 Gets or sets tThe type of the material.
ModulusOfElasticity
 Gets or sets the modulus of elasticity of the analysis material.
Name
 Gets or sets the name of the analysis material.
PoissonsRatio
 Gets or sets the Poisson's ratio of the analysis material.
ThermalDilatation
 Gets or sets the thermal dilatation of the analysis material.
Top
See Also
Reference
AnalysisMaterial Class
Tekla.Structures.Analysis Namespace