Tekla Open API Reference for Tekla Structures 2025
AnalysisFace Properties
The AnalysisFace type exposes the following members.
Properties
Name | Description
Positions
 The positions of the analysis face.
Top
See Also
Reference
AnalysisFace Class
Tekla.Structures.Analysis Namespace