Tekla Open API Reference for Tekla Structures 2025
BooleanPart Properties
The BooleanPart type exposes the following members.
Properties
Name | Description
OperativePart
 The part that does the boolean operation. When Insert() is called, this field is overwritten with a new part instance which is a copy of the original operative part. This part has the same identifier as the boolean part. Modifications (such as profile change) have to be made through the part instance and not the boolean part instance. The operative part's class must be BooleanOperativeClass.
Type
 Defines the boolean operation: an add or a cut.
Top
See Also
Reference
BooleanPart Class
Tekla.Structures.Model Namespace