Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment Class
 The SurfaceTreatment class defines a layer above a building element defining what a surface looks like. The surface could for example have a tiled look.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.SurfaceTreatment
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SurfaceTreatment : ModelObject
<SerializableAttribute>
Public NotInheritable Class SurfaceTreatment
	Inherits ModelObject
The SurfaceTreatment type exposes the following members.
Constructors
Name | Description
SurfaceTreatment
 Creates a new surface treatment instance.
Top
Properties
Name | Description
Class
 The class of the surface treatment.
Color
 The color of the surfacing.
CutByFatherBooleans
 Defines if the part is cut by the father's cuts.
EndPoint
 Determines the direction the surfacing is filled in. The direction is from the start point towards the end point.
Father
 Defines the father part for the surface treatment: the part that the surface treatment is created on.
Material
 Defines the material for the surface treatment.
Name
 The name of the surface treatment.
Polygon
 Defines the area for the surface treatment.
Position
 Defines the position for the surface treatment.
StartPoint
 Determines the origin of the surfacing. The surfacing is then filled out from the start point towards the end point.
Thickness
 Defines how thick the surface treatment is.
Type
 The type of the surfacing.
TypeName
 The name of the surface treatment type. The valid names are defined in the product_finishes.dat file.
Top
Methods
Name | Description
Delete
 Deletes the surface treatment with the given identifier from the database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the surface treatment to the database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the surface treatment with the given identifier in the database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the surface treatment with the given identifier.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           ContourPlate cp = new ContourPlate();
           cp.Profile.ProfileString = "PL10";
           cp.Class = "3";
           cp.AddContourPoint(new ContourPoint(new Point( 6000,  6000,0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 9000,  6000,0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 9000, 12000,0),null));
           cp.AddContourPoint(new ContourPoint(new Point(10500, 15000,0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 6000, 12000,0),null));
           Contour c = new Contour();
           c.AddContourPoint(new ContourPoint(new Point( 6000,  6000,5), null));
           c.AddContourPoint(new ContourPoint(new Point( 9000,  6000,5), null));
           c.AddContourPoint(new ContourPoint(new Point( 9000, 12000,5), null));
           c.AddContourPoint(new ContourPoint(new Point(10500, 15000,5), null));
           c.AddContourPoint(new ContourPoint(new Point( 7500, 12000,5), null));
           cp.Insert();
           SurfaceTreatment treatment = new SurfaceTreatment();
           treatment.Father = cp;
           treatment.Polygon = c;
           treatment.StartPoint = new Point(1500,0000,0);
           treatment.EndPoint = new Point(1500,6000,0);
           bool Result = false;
           Result = treatment.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace