Tekla Open API Reference for Tekla Structures 2025
TaskFilterExpressions.ActualEndDate Class
 The ActualEndDate class represents the actual end date filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.DateTimeFilterExpression
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.ActualEndDate
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ActualEndDate : DateTimeFilterExpression
<SerializableAttribute>
Public NotInheritable Class ActualEndDate
	Inherits DateTimeFilterExpression
The TaskFilterExpressions.ActualEndDate type exposes the following members.
Constructors
Name | Description
TaskFilterExpressions.ActualEndDate
 Initializes a new instance of the ActualEndDate class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace