Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedMemberLoad Properties
The AnalysisDecomposedMemberLoad type exposes the following members.
Properties
Name | Description
CSCode
 Gets or sets the CS code of the decomposed member load.
EndDistance
 Gets or sets the end distance of the decomposed member load.
EndValue
 Gets or sets the end value of the decomposed member load.
StartDistance
 Gets or sets the start distance of the decomposed member load.
StartValue
 Gets or sets the start value of the decomposed member load.
Top
See Also
Reference
AnalysisDecomposedMemberLoad Class
Tekla.Structures.Analysis Namespace