Tekla Open API Reference for Tekla Structures 2025
PluginWindowBase Methods
The PluginWindowBase type exposes the following members.
Methods
Name | Description
Dispose
 Cleans up any resources being used.
Get
 Gets the dialog values from the part that is currently selected in Tekla Structures.
ReloadWindow
 Reloads the dialog values.
Top
See Also
Reference
PluginWindowBase Class
Tekla.Structures.Dialog Namespace