Tekla Open API Reference for Tekla Structures 2025
BentPlate Methods
The BentPlate type exposes the following members.
Methods
Name | Description
Delete
 Deletes the bent plate with this instance identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the bent plate into the model database. All the attributes must be set and geometry should have at least one bend.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the bent plate object values in the database.
 (Overrides ModelObject.Modify().)
Select
 Selects a bent plate object from the database.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
BentPlate Class
Tekla.Structures.Model Namespace