Tekla Open API Reference for Tekla Structures 2025
BoltFilterExpressions.SiteWorkshop Class
 The SiteWorkshop class represents the site/workshop filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.SiteWorkshop
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SiteWorkshop : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class SiteWorkshop
	Inherits StringFilterExpression
The BoltFilterExpressions.SiteWorkshop type exposes the following members.
Constructors
Name | Description
BoltFilterExpressions.SiteWorkshop
 Initializes a new instance of the SiteWorkshop class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace