Tekla Open API Reference for Tekla Structures 2025
PluginFormBase Methods
The PluginFormBase type exposes the following members.
Methods
Name | Description
Get
 Gets the dialog values from the part that is currently selected in Tekla Structures.
ReloadForm
 Reloads the dialog values.
Top
See Also
Reference
PluginFormBase Class
Tekla.Structures.Dialog Namespace