Tekla Open API Reference for Tekla Structures 2025
LoadLine Class
 The LoadLine class defines a linearly-distributed force or torsion.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Load
 Tekla.Structures.Model.LoadLine
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LoadLine : Load
<SerializableAttribute>
Public NotInheritable Class LoadLine
	Inherits Load
The LoadLine type exposes the following members.
Constructors
Name | Description
LoadLine
 Creates a new load line instance.
Top
Properties
Name | Description
DistanceA
 The distance a (for shortening or dividing the length of a line load).
DistanceB
 The distance b (for shortening or dividing the length of a line load).
LoadForm
 The load form.
P1
 The load magnitude vector at the start position. The values are given in the local coordinate system of the load (not in the current coordinate system).
P2
 The load magnitude vector at the end position. The values are given in the local coordinate system of the load (not in the current coordinate system).
Position1
 The first input position point.
Position2
 The second input position point.
Torsion1
 The first torsion.
Torsion2
 The second torsion.
Top
Methods
Name | Description
Delete
 Deletes the load line instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the load line into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing load line in the model database to match the current one. At the moment it is not possible to change the load attachment or the father.
 (Overrides ModelObject.Modify().)
Select
 Selects a load line from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           LoadLine L = new LoadLine();
           L.P1 = new Vector(0000,0000,-1000);
           L.P2 = new Vector(0000,0000,-1000);
           L.DistanceA = 5;
           L.DistanceB = 6;
           L.Torsion1 = 1000;
           L.Torsion2 = 2000;
           L.Position1 = new Point(3000,12000,0);
           L.Position2 = new Point(4000,12000,0);
           L.LoadForm = LoadLine.LineLoadFormEnum.LOAD_FORM_LINE_1;
           L.AutomaticPrimaryAxisWeight = true;
           L.BoundingBoxDx = 500;
           L.BoundingBoxDy = 500;
           L.BoundingBoxDz = 500;
           L.LoadDispersionAngle = 5;
           L.PartFilter = "testing";
           L.PartNames = Load.LoadPartNamesEnum.LOAD_PART_NAMES_INCLUDE;
           L.PrimaryAxisDirection = new Vector(1000, 500, 0);
           L.Spanning = Load.LoadSpanningEnum.LOAD_SPANNING_SINGLE;
           L.Weight = 2;
           L.CreateFixedSupportConditionsAutomatically = true;
           if (!L.Insert())
               Console.WriteLine("LoadLine Insert failed!");
       }
}
See Also
Reference
Tekla.Structures.Model Namespace