Tekla Open API Reference for Tekla Structures 2025
NumericConstantFilterExpression Class
 The NumericConstantFilterExpression class represents a constant numeric filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericConstantFilterExpression
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class NumericConstantFilterExpression : DataFilterExpression
<SerializableAttribute>
Public NotInheritable Class NumericConstantFilterExpression
	Inherits DataFilterExpression
The NumericConstantFilterExpression type exposes the following members.
Constructors
Name | Description
NumericConstantFilterExpression(IEnumerable<Double>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int16>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int32>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int64>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt16>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt32>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt64>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Double)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int16)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int32)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int64)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt16)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt32)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt64)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<TeklaStructuresDatabaseTypeEnum>)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(TeklaStructuresDatabaseTypeEnum)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Double>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int16>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int32>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<Int64>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt16>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt32>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(IEnumerable<UInt64>, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Double, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int16, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int32, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(Int64, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt16, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt32, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
NumericConstantFilterExpression(UInt64, IFormatProvider)
 Initializes a new instance of the NumericConstantFilterExpression class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace