Tekla Open API Reference for Tekla Structures 2025
DimensionLink Class
 The DimensionLink class contains methods related to dimension links. A dimension link is a link between two dimension sets.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionLink
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DimensionLink : DrawingObject
<SerializableAttribute>
Public NotInheritable Class DimensionLink
	Inherits DrawingObject
The DimensionLink type exposes the following members.
Constructors
Name | Description
DimensionLink
 Creates a new DimensionLink instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
Delete
 Unlinks the dimensions in the current drawing.
 (Overrides DatabaseObject.Delete().)
GetDimension1
 Gets the first one of the linked dimensions.
GetDimension2
 Gets the second one of the linked dimensions.
Insert
 Links the dimensions in the drawing.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing DimensionLink from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
Examples
 The following example creates two dimensions in the drawing sheet and links them:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if (MyDrawingHandler.GetConnectionStatus())
           {
               StraightDimension Dimension1 = new StraightDimension(MyDrawingHandler.GetActiveDrawing().GetSheet(),
                   new Point(0, 0, 0), new Point(100, 0, 0), new Vector(0, -1, 0), 100.0);
               StraightDimension Dimension2 = new StraightDimension(MyDrawingHandler.GetActiveDrawing().GetSheet(),
                   new Point(0, 0, 0), new Point(0, 100, 0), new Vector(-1, 0, 0), 100.0);
               Dimension1.Insert();
               Dimension2.Insert();
               StraightDimensionSet DimSet1 = Dimension1.GetDimensionSet() as StraightDimensionSet;
               StraightDimensionSet DimSet2 = Dimension2.GetDimensionSet() as StraightDimensionSet;
               DimensionLink DimLink = new DimensionLink(DimSet1, DimSet2);
               DimLink.Insert();
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace