Tekla Open API Reference for Tekla Structures 2025
PourObject Class
 The PourObject class represents a pour object in the model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.PourObject
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PourObject : ModelObject, IAssemblable
<SerializableAttribute>
Public Class PourObject
	Inherits ModelObject
	Implements IAssemblable
The PourObject type exposes the following members.
Constructors
Name | Description
PourObject
 Initializes a new instance of the PourObject class.
Top
Properties
Name | Description
Class
 Gets or sets the class of the pour object.
ConcreteMixture
 Gets or sets the concrete mixture of the pour.
PourNumber
 Gets or sets the pour number of the pour.
PourType
 Gets or sets the pour type of the pour.
Top
Methods
Name | Description
Delete
 At the moment pour objects cannot be deleted.
 (Overrides ModelObject.Delete().)
GetAssembly |  Obsolete.
 Returns the assembly that the pour object belongs to.
GetFatherPourUnit
 Returns the pour unit that the pour object belongs to.
GetObjects
 Returns an enumerator of all objects related to pour.
GetParts
 Returns an enumerator of all parts related to pour.
GetPourPolymeshes
 Returns a new polymesh enumerator based on merged faces of the pour object in the current plane.
GetSolid
 Returns the solid of the pour object.
GetSurfaceObjects
 Returns an enumerator of all the connected surface objects.
Insert
 At the moment pour objects cannot be inserted.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the pour object with the given identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the pour object instance from the model. The identifier of the instance must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
    public void Example1()
    {
        Beam beam = new Beam(new Point(1000, 1000, 400), new Point(3000, 1000, 400));
        beam.Profile.ProfileString = "380*380";
        beam.Material.MaterialString = "K40-1";
        beam.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
        if (beam.Insert())
        {
            Beam beam2 = new Beam(new Point(800, 1000, 0), new Point(800, 1000, 3000));
            beam2.Profile.ProfileString = "380*380";
            beam2.Material.MaterialString = "K40-1";
            beam2.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
            if (beam2.Insert())
            {
                new Model().CommitChanges();
                ModelObjectEnumerator pours = beam.GetPours();
                while(pours.MoveNext())
                {
                    PourObject pour = pours.Current as PourObject;
                    if(pour != null)
                    {
                        Solid solid = pour.GetSolid();
                        if(solid != null)
                            Console.WriteLine("Fetching solid from pour successfully!");
                    }
                }
            }
        }
    }
}
See Also
Reference
Tekla.Structures.Model Namespace