Tekla Open API Reference for Tekla Structures 2025
GridBase Class
 The GridBase class defines the base class for grids.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.GridBase
 Tekla.Structures.Model.Grid
 Tekla.Structures.Model.RadialGrid
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class GridBase : ModelObject
<SerializableAttribute>
Public MustInherit Class GridBase
	Inherits ModelObject
The GridBase type exposes the following members.
Constructors
Name | Description
GridBase
 Creates a new grid instance.
The default values are as follows:
Name = "Grid";
CoordinateX = "0.00 4*3000.00";
CoordinateY = "0.00 5*6000.00";
CoordinateZ = "0.00 6000.00 8000.00 9000.00";
LabelX = "A B C D E";
LabelY = "1 2 3 4 5 6";
LabelZ = "+0 +6000 +8000 +9000";
ExtensionLeftX = 2000.0;
ExtensionLeftY = 2000.0;
ExtensionLeftZ = 2000.0;
ExtensionRightX = 2000.0;
ExtensionRightY = 2000.0;
ExtensionRightZ = 2000.0;
IsMagnetic = false;
Top
Properties
Name | Description
FontColor
 Gets or sets font color for the grid labels
FontSize
 Gets or sets font size for the grid labels
IsMagnetic
 Gets or sets whether the grid is magnetic or not.
Name
 Gets or sets the name of the grid.
Origin
 Gets or sets the origin of the grid
Top
Methods
Name | Description
Delete
 Deletes the grid with the given ID.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the grid into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the grid with the given ID.
 (Overrides ModelObject.Modify().)
Select
 Selects the grid with the given ID.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           GridBase grid = MakeAGrid();
           grid.IsMagnetic = true;
           bool Result = grid.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace