Tekla Open API Reference for Tekla Structures 2025
AssemblyDrawing Methods
The AssemblyDrawing type exposes the following members.
Methods
Name | Description
Insert
 Inserts a new assembly drawing. Views are added according to the View Creation rules of the standard file. A drawing can be inserted only when there is no active drawing.
 (Overrides DatabaseObject.Insert().)
Modify
 Updates the drawing object in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
AssemblyDrawing Class
Tekla.Structures.Drawing Namespace