Tekla Open API Reference for Tekla Structures 2025
PourBreak Properties
The PourBreak type exposes the following members.
Properties
Name | Description
Polymesh
 Gets or sets the polymesh that forms the object geometry.
Top
See Also
Reference
PourBreak Class
Tekla.Structures.Model Namespace