Tekla Open API Reference for Tekla Structures 2025
CutPlane Methods
The CutPlane type exposes the following members.
Methods
Name | Description
Delete
 Deletes the cut plane instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the cut plane into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing cut plane in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a cut plane from the model database. The part ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
CutPlane Class
Tekla.Structures.Model Namespace