Tekla Open API Reference for Tekla Structures 2025
BoltCircle Properties
The BoltCircle type exposes the following members.
Properties
Name | Description
Diameter
 The diameter of the circle.
NumberOfBolts
 The number of bolts in the circle.
Top
See Also
Reference
BoltCircle Class
Tekla.Structures.Model Namespace