Tekla Open API Reference for Tekla Structures 2025
ReinforcementStrandAttributes Methods
The ReinforcementBase.ReinforcementStrandAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ReinforcementBase.ReinforcementBaseAttributes.IsEqual(Object).)
Top
See Also
Reference
ReinforcementBase.ReinforcementStrandAttributes Class
Tekla.Structures.Drawing Namespace