Tekla Open API Reference for Tekla Structures 2025
AnalysisMember Class
 The AnalysisMember class contains information related to analysis members.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisMember
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisMember : AnalysisObject
Public NotInheritable Class AnalysisMember
	Inherits AnalysisObject
The AnalysisMember type exposes the following members.
Constructors
Name | Description
AnalysisMember
 Initializes a new instance of the AnalysisMember class.
Top
Properties
Name | Description
AnalysisDesignCode
 Gets or sets the analysis design code of the member.
Composite
 Gets or sets the composite settings of the member.
Curvature
 Gets or sets the beam curvature of the member.
End
 Gets or sets the analysis beam end settings at the end of the member.
Label
 Gets or sets the label of the analysis member.
Material
 Gets or sets the material of the analysis member.
Start
 Gets or sets the analysis beam end settings at the start of the member.
Top
Methods
Name | Description
CopyData
 Copies data from another analysis member.
Modify
 Modifies an analysis member. The AnalysisModelName has to be set.
Select
 Selects an analysis member. The AnalysisModelName and ID have to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace