Tekla Open API Reference for Tekla Structures 2025
ReinforcingBarFilterExpressions.CustomDateTime Class
 The CustomDateTime class represents a custom DateTime filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.DateTimeFilterExpression
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.CustomDateTime
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CustomDateTime : DateTimeFilterExpression
<SerializableAttribute>
Public Class CustomDateTime
	Inherits DateTimeFilterExpression
The ReinforcingBarFilterExpressions.CustomDateTime type exposes the following members.
Constructors
Name | Description
ReinforcingBarFilterExpressions.CustomDateTime
 Initializes a new instance of the CustomDateTime class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace