Tekla Open API Reference for Tekla Structures 2025
PluginWindowBase Properties
The PluginWindowBase type exposes the following members.
Properties
Name | Description
ShowInTaskbar
 Hides (shadows) the ShowInTaskbar property by setting the property to false.
Top
See Also
Reference
PluginWindowBase Class
Tekla.Structures.Dialog Namespace