Tekla Open API Reference for Tekla Structures 2025
ReinforcingBarFilterExpressions.NumberingSeries Class
 The NumberingSeries class represents the numbering series filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.NumberingSeries
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class NumberingSeries : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class NumberingSeries
	Inherits StringFilterExpression
The ReinforcingBarFilterExpressions.NumberingSeries type exposes the following members.
Constructors
Name | Description
ReinforcingBarFilterExpressions.NumberingSeries
 Initializes a new instance of the NumberingSeries class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace