Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection Methods
The BinaryFilterExpressionCollection type exposes the following members.
Methods
Name | Description
Add
 Adds a BinaryFilterExpressionItem object at the end of the collection.
Clear
 Removes all the elements from the collection.
Contains
 Determines whether an element is in the collection.
CopyTo
 Copies the collection to the input array.
GetFirst
 Gets the first item of the collection.
GetLast
 Gets the last item of the collection.
IndexOf
 Searches for the specified BinaryFilterExpressionItem in the collection and returns a zero-based index if found.
Insert
 Inserts an element in the collection at a specified index.
IsFirst
 Determines whether an element is the first item of the collection.
IsLast
 Determines whether an element is the last item of the collection.
Remove
 Removes the first occurrence of a specific object from the collection.
RemoveAt
 Removes the element at the specified index from the collection.
Top
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace