Tekla Open API Reference for Tekla Structures 2025
PourObject Properties
The PourObject type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the pour. For more information see PourObject.PourAttributes.
Top
See Also
Reference
PourObject Class
Tekla.Structures.Drawing Namespace