Tekla Open API Reference for Tekla Structures 2025
ConicalSurfaceNode Class
 The ConicalSurfaceNode class represents conical surface geometry tree node.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.BendSurfaceNode
 Tekla.Structures.Model.ConicalSurfaceNode
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ConicalSurfaceNode : BendSurfaceNode
<SerializableAttribute>
Public NotInheritable Class ConicalSurfaceNode
	Inherits BendSurfaceNode
The ConicalSurfaceNode type exposes the following members.
Constructors
Name | Description
ConicalSurfaceNode
 Initializes a new instance of the ConicalSurfaceNode class.
Top
Properties
Name | Description
Surface
 Gets the conical surface geometry.
Top
Methods
Name | Description
AcceptVisitor
 Entry method for the visitor pattern.
 (Overrides BendSurfaceNode.AcceptVisitor(IGeometryNodeVisitor).)
Clone
 Creates a new object that is a copy of the current instance.
 (Overrides BendSurfaceNode.Clone().)
Top
See Also
Reference
Tekla.Structures.Model Namespace