Tekla Open API Reference for Tekla Structures 2025
ClosedGraphicObject Class
 The ClosedGraphicObject class is an abstract base class for all closed graphic objects (the circle, the cloud, the polygon and the rectangle).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.ClosedGraphicObject
 Tekla.Structures.Drawing.Circle
 Tekla.Structures.Drawing.Cloud
 Tekla.Structures.Drawing.Polygon
 Tekla.Structures.Drawing.Rectangle
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ClosedGraphicObject : GraphicObject
<SerializableAttribute>
Public MustInherit Class ClosedGraphicObject
	Inherits GraphicObject
The ClosedGraphicObject type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace