Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet Class
 The StraightDimensionSet class defines a straight dimension set.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionSetBase
 Tekla.Structures.Drawing.StraightDimensionSet
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class StraightDimensionSet : DimensionSetBase
<SerializableAttribute>
Public NotInheritable Class StraightDimensionSet
	Inherits DimensionSetBase
The StraightDimensionSet type exposes the following members.
Properties
Name | Description
Attributes
 The straight dimension set attributes.
Distance
 The distance from the first dimension point to the dimension line. The distance is measured in paper millimeters.
LeftTagLineOffset
 The offset of the left tag line. The offset is measured in paper millimeters.
RightTagLineOffset
 The offset of the right tag line. The offset is measured in paper millimeters.
Top
Methods
Name | Description
Delete
 Deletes the dimension set and its child dimensions from the database.
 (Overrides DatabaseObject.Delete().)
GetAllExcludePartsAccordingToFilter
 Retrieves all the possible valid filters for ExcludePartsAccordingToFilter.
Insert
 Dimension sets cannot be inserted into the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the existing dimension set in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the straight dimension set from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace