Tekla Open API Reference for Tekla Structures 2025
ApplicationFormBase Class
 The ApplicationFormBase class is the base class for all Tekla Structures dialogs. The class provides localization, unit conversion and data storage (temporary and file-based) among other things.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.FormBase
 Tekla.Structures.Dialog.ApplicationFormBase
 More...
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ApplicationFormBase : FormBase
Public Class ApplicationFormBase
	Inherits FormBase
The ApplicationFormBase type exposes the following members.
Constructors
Name | Description
ApplicationFormBase
 The default constructor that does not need parameters. Initializes the form and registers property bindings.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Dialog Namespace
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.FormBase
 Tekla.Structures.Dialog.ApplicationFormBase
 Tekla.Structures.Dialog.UIControls.CommitAction
 Tekla.Structures.Dialog.UIControls.CreateDialog
 Tekla.Structures.Dialog.UIControls.MeshSelectionForm
 Tekla.Structures.Dialog.UIControls.OrganizerDialog
 Tekla.Structures.Dialog.UIControls.PropertiesDialog
 Tekla.Structures.Dialog.UIControls.TreeViewDialog