Tekla Open API Reference for Tekla Structures 2025
Symbol Methods
The Symbol type exposes the following members.
Methods
Name | Description
Delete
 Deletes the symbol from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Returns the bounding box of the symbol (rectangle format).
GetObjectAlignedBoundingBox
 Returns the bounding box of the symbol (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
Insert
 Inserts the symbol into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the symbol in the current drawing database.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object using the move vector.
Select
 Selects the symbol from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Symbol Class
Tekla.Structures.Drawing Namespace