Tekla Open API Reference for Tekla Structures 2025
GridLine Properties
The GridLine type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the grid line. For more information see GridLine.GridLineAttributes.
EndLabel
 The end of the grid line, contains the grid label and position information. For more information see GridLine.GridLabel.
StartLabel
 The beginning of the grid line, contains the grid label and position information. For more information see GridLine.GridLabel.
Top
See Also
Reference
GridLine Class
Tekla.Structures.Drawing Namespace