Tekla Open API Reference for Tekla Structures 2025
GraphicObject.GraphicObjectAttributes Class
 The GraphicObjectAttributes class is the attributes class of the graphic object.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes
 Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class GraphicObjectAttributes : AttributesBase
<SerializableAttribute>
Public MustInherit Class GraphicObjectAttributes
	Inherits AttributesBase
The GraphicObject.GraphicObjectAttributes type exposes the following members.
Constructors
Name | Description
GraphicObject.GraphicObjectAttributes()
 Creates a new graphic object attributes instance.
GraphicObject.GraphicObjectAttributes(String)
 Creates a new graphic object attributes instance using the given attribute file's filename.
Top
Properties
Name | Description
Line
 The line attributes of the graphic object. A graphic object always consists of lines.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace