Tekla Open API Reference for Tekla Structures 2025
Brep Class
 The Brep class represents a single brep in the model. A brep has a single start and end point.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Part
 Tekla.Structures.Model.Brep
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Brep : Part
<SerializableAttribute>
Public NotInheritable Class Brep
	Inherits Part
The Brep type exposes the following members.
Constructors
Name | Description
Brep()
 Initializes a new instance of the Brep class. The start and end points are in the origin.
Brep(Point, Point)
 Initializes a new instance of the Brep class with the given start and end points.
Top
Properties
Name | Description
EndPoint
 Gets or sets the end point of the brep.
EndPointOffset
 Gets or sets the beam's end point offset.
StartPoint
 Gets or sets the start point of the brep.
StartPointOffset
 Gets or sets the beam's start point offset.
Top
Methods
Name | Description
Delete
 Deletes the brep instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the brep into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing brep in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a brep from the model database. The brep identifier must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Point point = new Point(0, 0, 0);
           Point point2 = new Point(1000, 0, 0);
           Brep brep = new Brep();
           brep.StartPoint = point;
           brep.EndPoint = point2;
           brep.Profile = new Profile { ProfileString = "Default" };
           bool result = brep.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace