Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition Properties
The HierarchicDefinition type exposes the following members.
Properties
Name | Description
CustomType
 The custom type of the hierarchical definition.
Drawable
 Defines whether the hierarchical definition is a drawable area in the model.
Father
 The father of the hierarchical definition.
HierarchicChildren
 An array list that contains the hierarchical definition's children.
HierarchyIdentifier
 The GUID of the hierarchical definition.
HierarchyType
 The type of the hierarchical definition.
Name
 The name of the hierarchical definition.
Top
See Also
Reference
HierarchicDefinition Class
Tekla.Structures.Model Namespace