Tekla Open API Reference for Tekla Structures 2025
ConicalSurface Class
 The ConicalSurface class defines a conical surface contour.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.BendSurface
 Tekla.Structures.Model.ConicalSurface
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ConicalSurface : BendSurface
<SerializableAttribute>
Public Class ConicalSurface
	Inherits BendSurface
The ConicalSurface type exposes the following members.
Constructors
Name | Description
ConicalSurface(Arc, Double, Double)
 Initializes a new instance of the ConicalSurface class from a base arc, a height and a radius at the top. This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
ConicalSurface(List<Point>, List<Point>, Line, Vector)
 Initializes a new instance of the ConicalSurface class from the cone lateral boundaries and the center line. This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface.
ConicalSurface(Vector, Vector, List<Point>, List<Point>)
 Initializes a new instance of the ConicalSurface class with given parameters. The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the cone). The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
ConicalSurface(Vector, Vector, LineSegment, LineSegment)
 Initializes a new instance of the ConicalSurface class with given parameters. The boundaries are defined by the side boundaries (i.e. generator lines of the cone).
Top
Properties
Name | Description
Apex
 Gets the apex of the cone. If it does not exist, it returns null
Radiuses
 Gets radiuses of the conical surface. The first radius corresponds to the section located in the first point of the side boundary 1, and the second radius corresponds to the section located in the second point of the side boundary 1.
Top
See Also
Reference
Tekla.Structures.Model Namespace