Tekla Open API Reference for Tekla Structures 2025
Bolt Properties
The Bolt type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the bolt. For more information see Bolt.BoltAttributes.
Top
See Also
Reference
Bolt Class
Tekla.Structures.Drawing Namespace