Tekla Open API Reference for Tekla Structures 2025
ControlPlane Properties
The ControlPlane type exposes the following members.
Properties
Name | Description
IsMagnetic
 Determines whether the plane is magnetic or not.
Name
 The name of the control plane.
Plane
 The plane defining the position of the control plane.
Top
See Also
Reference
ControlPlane Class
Tekla.Structures.Model Namespace