Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition Methods
The HierarchicDefinition type exposes the following members.
Methods
Name | Description
AddObjects
 Associates hierarchical objects with the hierarchical definition. Fails if the hierarchical definition doesn't exist in the model.
Delete
 Deletes the hierarchical definition instance from the model. The ID must be set.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the hierarchical definition instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the hierarchical definition instance in the model. The ID must be set.
 (Overrides ModelObject.Modify().)
RemoveObjects
 Removes associations to the given list of hierarchical objects. Fails if the hierarchical definition doesn't exist in the model.
Select
 Selects the hierarchical definition instance from the model. The ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
HierarchicDefinition Class
Tekla.Structures.Model Namespace