Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedLoad Properties
The AnalysisDecomposedLoad type exposes the following members.
Properties
Name | Description
AnalysisLoadType
 Gets or sets the type of the analysis decomposed load.
ModelLoadGroupID
 Gets or sets the identifier of the load group.
ModelLoadID
 Gets or sets the identifier of the model load.
ObjectAttachedToID
 Gets or sets the identifier of the object the load is attached to.
ObjectAttachedToType
 Gets or sets the type of the object the load is attached to.
Top
See Also
Reference
AnalysisDecomposedLoad Class
Tekla.Structures.Analysis Namespace