Tekla Open API Reference for Tekla Structures 2025
CylindricalSurface Class
 The CylindricalSurface class defines a cylindrical surface contour.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.BendSurface
 Tekla.Structures.Model.CylindricalSurface
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CylindricalSurface : BendSurface
<SerializableAttribute>
Public NotInheritable Class CylindricalSurface
	Inherits BendSurface
The CylindricalSurface type exposes the following members.
Constructors
Name | Description
CylindricalSurface(Arc, Double)
 Initializes a new instance of the CylindricalSurface class from a base arc and a height. This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
CylindricalSurface(List<Point>, List<Point>, Line, Vector)
 Initializes a new instance of the CylindricalSurface class from the cone lateral boundaries and the center line. This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface.
CylindricalSurface(Vector, Vector, List<Point>, List<Point>)
 Initializes a new instance of the CylindricalSurface class with given parameters. The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the cylinder). The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
CylindricalSurface(Vector, Vector, LineSegment, LineSegment)
 Initializes a new instance of the CylindricalSurface class with given parameters. The boundaries are defined by the side boundaries (i.e. generator lines of the cylinder).
Top
Properties
Name | Description
Radius
 Gets radius of the cylindrical surface.
Top
See Also
Reference
Tekla.Structures.Model Namespace