Tekla Open API Reference for Tekla Structures 2025
Brep Properties
The Brep type exposes the following members.
Properties
Name | Description
EndPoint
 Gets or sets the end point of the brep.
EndPointOffset
 Gets or sets the beam's end point offset.
StartPoint
 Gets or sets the start point of the brep.
StartPointOffset
 Gets or sets the beam's start point offset.
Top
See Also
Reference
Brep Class
Tekla.Structures.Model Namespace