Tekla Open API Reference for Tekla Structures 2025
AnalysisPart Class
 The AnalysisPart class contains information related to analysis parts.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisPart
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisPart : AnalysisObject
Public NotInheritable Class AnalysisPart
	Inherits AnalysisObject
The AnalysisPart type exposes the following members.
Constructors
Name | Description
AnalysisPart
 Initializes a new instance of the AnalysisPart class.
Top
Properties
Name | Description
AnalysisAreas
 The analysis areas of the analysis part.
AnalysisBars
 The analysis bars of the analysis part.
AnalysisDesignCode
 The analysis design code of the analysis part.
AnalysisPartAnalysisProperties
 The analysis part analysis properties.
AnalysisPartAreaAttributes
 The analysis part area attributes.
AnalysisPartBarAttributes
 The analysis part bar attributes.
AnalysisPartCompositeProperties
 The analysis part composite properties.
AnalysisPartLoadingProperties
 The analysis part loading properties.
AnalysisPartPositionProperties
 The analysis part position properties.
AnalysisPartSpanningProperties
 The analysis part spanning properties.
AnalysisType
 The analysis type of the analysis part.
AnalysisVolumes
 The analysis volumes of the analysis part.
CoordinateSystem
 The coordinate system of the analysis part.
Curvature
 The curvature of the analysis part.
LoadBearingOrder
 The load bearing order.
Material
 The material of the analysis part.
OverrideProfile
 The override profile of the analysis part. In case of tapered profile, only the name is available, and more details are available in the start/end properties of the analysis members.
PartID
 The identifier of the physical part.
PartName
 The name of the physical part.
PartType
 The type of the physical part.
Profile
 The profile of the analysis part. Note: OverrideProfile may exist to replace this. In case of tapered profile, only the name is available, ID is 0 and values are not returned. More details are available in the start/end properties of the analysis members.
SnapDistance
 The snap distance. Use 0.0 for manual connectivity, positive value for automatic connectivity.
UpDirection
 The up direction of the analysis part (in the global coordinate system). The axis vector (connecting member end nodes) and the up direction vector define the local XY plane of the member. The local Z can be calculated as localZ = localX x UpDirection (cross product), and after this localY = localZ x localX (cross product).
Top
Methods
Name | Description
Add(AnalysisArea)
 Adds an analysis area to the analysis part.
Add(AnalysisBar)
 Adds an analysis bar to the analysis part.
Delete
 Deletes an analysis part. The method is not implemented.
DeleteAnalysisPart
 Deletes the analysis part by ID.
GetAnalysisAreas
 Gets the analysis areas of the analysis part.
GetAnalysisBars
 Gets the analysis bars of the analysis part.
GetAnalysisVolumes
 Gets the analysis volumes of the analysis part.
GetMainParts
 Get the main analysis parts of this analysis part. There are no main analysis parts if this is not a sub analysis part.
GetSubParts
 Get the sub analysis parts of this analysis part. There are no sub analysis parts if this is not a main analysis part.
Insert
 Inserts a new analysis part into the Tekla Structures model. The AnalysisModelName has to be set.
IsMainPart
 Check if this analysis part is a main analysis part (has sub analysis parts).
IsSubPart
 Check if this analysis part is a sub analysis part.
Modify
 Modifies an analysis part. The ID, or the PartID and the AnalysisModelName, has to be set.
MovePosition
 Move analysis position.
Select
 Selects an analysis part. The ID, or the PartID and the AnalysisModelName, has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace