Tekla Open API Reference for Tekla Structures 2025
PickerInputObject Class
 The PickerInputObject class represents a pick of an object in a view. Used for values asked by UI.Picker.PickObject(string Prompt, out DrawingObject PickedObject, out ViewBase PickedView).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputWithinAView
 Tekla.Structures.Drawing.PickerInputObject
 Tekla.Structures.Drawing.PickerInputObjectAndAPoint
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PickerInputObject : PickerInputWithinAView
Public Class PickerInputObject
	Inherits PickerInputWithinAView
The PickerInputObject type exposes the following members.
Constructors
Name | Description
PickerInputObject
 Creates a new PickerInputObject instance representing the pick of a drawing object in a view.
Top
Properties
Name | Description
PickedObject
 Gets or sets the picked object in the view.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PickerInputWithinAView.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace