Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroup Class
 The ReinforcementSetGroup class defines a reinforcement set group in the drawing. A model rebar set generates one or more groups of rebars for drawing purposes and each group is represented in a drawing as a reinforcement set group. ModelIdentifier is always zero for the ReinforcementSetGroup.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.ReinforcementBase
 Tekla.Structures.Drawing.ReinforcementSetGroup
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ReinforcementSetGroup : ReinforcementBase
<SerializableAttribute>
Public Class ReinforcementSetGroup
	Inherits ReinforcementBase
The ReinforcementSetGroup type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementSetGroupAttributes.
ReinforcementCustomPosition
 Gets or sets the location of the reinforcement bar when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized. This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.
Top
Methods
Name | Description
GetModelIdentifiers
 Gets the model identifiers of the single rebars in this reinforcement set group.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace