Tekla Open API Reference for Tekla Structures 2025
UnsupportedChamferException Class
 The UnsupportedChamferException class represents an error when, plates containing unsupported chamfer information.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.UnsupportedChamferException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class UnsupportedChamferException : ConnectiveGeometryException
<SerializableAttribute>
Public Class UnsupportedChamferException
	Inherits ConnectiveGeometryException
The UnsupportedChamferException type exposes the following members.
Constructors
Name | Description
UnsupportedChamferException
 Initializes a new instance of the UnsupportedChamferException class with "Plates containing unsupported chamfer information" error message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace