Tekla Open API Reference for Tekla Structures 2025
RadialGrid Properties
The RadialGrid type exposes the following members.
Properties
Name | Description
AngularCoordinates
 The angular coordinates of the grid lines
AngularLabels
 The labels for the angular grid lines.
AngularLinesEndExtension
 The extension of the angular grid lines at their end point.
AngularLinesStartExtension
 The extension of the angular grid lines at their start point.
ArcEndExtension
 The extension of the grid arcs at their end point.
ArcStartExtension
 The extension of the grid arcs at their start point.
Color
 Gets or sets the color of the grid.
CoordinateZ
 The coordinates for the Z-axis.
ExtensionAboveZ
 The extension above Z-axis.
ExtensionBelowZ
 The extension below the Z-axis.
IsMagnetic
 Gets or sets whether the grid is magnetic or not
 (Overrides GridBase.IsMagnetic.)
LabelZ
 The labels for the Z-axis.
RadialCoordinates
 The distances between the radii of the arcs
RadialLabels
 The labels for the grid arcs.
Top
See Also
Reference
RadialGrid Class
Tekla.Structures.Model Namespace