Tekla Open API Reference for Tekla Structures 2025
CustomPart Methods
The CustomPart type exposes the following members.
Methods
Name | Description
Delete
 Deletes the custom part instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetAssembly
 Returns the assembly that the custom part belongs to.
GetBooleans
 Returns an enumerator of all the connected boolean objects.
GetComponents
 Returns an enumerator of all the connected components.
GetStartAndEndPositions
 Returns the start and end points of the custom part.
Insert
 Inserts the custom part into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing custom part in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a custom part from the model database. The custom part identifier must be set.
 (Overrides ModelObject.Select().)
SetInputPositions
 Sets the start and end point of the custom part.
Top
See Also
Reference
CustomPart Class
Tekla.Structures.Model Namespace