Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem Properties
The LibraryProfileItem type exposes the following members.
Properties
Name | Description
aProfileItemAnalysisParameters
 An array list with the profile item analysis parameters.
aProfileItemUserParameters
 An array list with the profile item user parameters.
ProfileName
 The profile item name.
Top
See Also
Reference
LibraryProfileItem Class
Tekla.Structures.Catalogs Namespace