Tekla Open API Reference for Tekla Structures 2025
PourUnit Properties
The PourUnit type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the name of the pour unit.
Top
See Also
Reference
PourUnit Class
Tekla.Structures.Model Namespace