Tekla Open API Reference for Tekla Structures 2025
GridCylindricalSurface Properties
The GridCylindricalSurface type exposes the following members.
Properties
Name | Description
CylinderBase
 The arc that represents the base of the cylindrical surface. The cylinder is then extruded along the normal direction of the arc, with the height given by CylinderHeight"
CylinderHeight
 Height of the cylinder along the normal direction of the CylinderBase arc.
Top
See Also
Reference
GridCylindricalSurface Class
Tekla.Structures.Model Namespace