Tekla Open API Reference for Tekla Structures 2025
ViewBase Methods
The ViewBase type exposes the following members.
Methods
Name | Description
Delete
 Deletes the view and its children objects from the database.
 (Overrides DatabaseObject.Delete().)
GetAllObjects()
 Gets all the objects and their children objects in the view.
GetAllObjects(Type)
 Gets all the objects and their children objects in the view that are of a certain type.
GetAllObjects(Type[])
 Gets all the objects and their children objects in the view that are of certain types.
GetAxisAlignedBoundingBox
 The view size in paper coordinates.
GetModelObjects
 Gets the drawing model objects based on given model object identifier. If used from sheet model objects from all views are returned.
GetObjects()
 Gets the objects in the view. Does not return child objects (single dimensions, grid lines, views).
GetObjects(Type[])
 Gets the objects in the view that are of certain types. Does not return child objects (single dimensions, grid lines, views).
GetOriginalDrawing
 Gets the drawing on which the view was originally created. @see DrawingObject.GetDrawing() for retrieving the current drawing the object resides on.
Insert
 Inserts the view to the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the view in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the view from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace