Tekla Open API Reference for Tekla Structures 2025
Arc Properties
The Arc type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the arc.
EndPoint
 The end point of the arc.
Radius
 The radius of the arc.
StartPoint
 The start point of the arc.
Top
See Also
Reference
Arc Class
Tekla.Structures.Drawing Namespace