Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer Class
 The EdgeChamfer class defines how the part edge is chamfered.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Boolean
 Tekla.Structures.Model.EdgeChamfer
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class EdgeChamfer : Boolean
<SerializableAttribute>
Public NotInheritable Class EdgeChamfer
	Inherits Boolean
The EdgeChamfer type exposes the following members.
Constructors
Name | Description
EdgeChamfer()
 Initializes a new instance of the EdgeChamfer class with empty attributes.
EdgeChamfer(Point, Point)
 Initializes a new instance of the EdgeChamfer class.
Top
Properties
Name | Description
Chamfer
 The chamfer values for the EdgeChamfer.
FirstBevelDimension
 The bevel dimension if the first end is bevelled.
FirstChamferEndType
 The ChamferEndTypeEnum of the first end.
FirstEnd
 The start point of the EdgeChamfer.
Name
 The name of the EdgeChamfer instance.
SecondBevelDimension
 The bevel dimension if the second end is bevelled.
SecondChamferEndType
 The ChamferEndTypeEnum of the second end.
SecondEnd
 The end point of the EdgeChamfer.
Top
Methods
Name | Description
Delete
 Deletes the edge chamfer instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the edge chamfer into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing edge chamfer in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects an edge chamfer from the model database. The edge chamfer ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Point Point = new Point(0, 0, 0);
           Point Point2 = new Point(1000, 0, 0);
           Beam Beam = new Beam();
           Beam.StartPoint = Point;
           Beam.EndPoint = Point2;
           Beam.Profile.ProfileString = "400*400";
           Beam.Finish = "PAINT";
           Beam.Insert();
           EdgeChamfer EdgeChamfer = new EdgeChamfer(new Point(0, -100, 0), new Point(0, 200, 0));
           EdgeChamfer.FirstChamferEndType = EdgeChamfer.ChamferEndTypeEnum.BEVELLED;
           EdgeChamfer.FirstBevelDimension = 50;
           EdgeChamfer.Chamfer.X = 20;
           EdgeChamfer.Chamfer.Y = 20;
           EdgeChamfer.Father = Beam;
           EdgeChamfer.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace