Tekla Open API Reference for Tekla Structures 2025
Connection Methods
The Connection type exposes the following members.
Methods
Name | Description
Delete
 Deletes the connection instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetPrimaryObject
 Returns the primary object of the connection.
GetSecondaryObjects
 Returns the secondary objects.
Insert
 Inserts the connection into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing connection in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a connection from the model database. The connection ID must be set.
 (Overrides ModelObject.Select().)
SetPrimaryObject
 Sets the primary object of the connection.
SetSecondaryObject
 Sets the secondary object of the connection. Use this method if you wish to add only one secondary object to the connection.
SetSecondaryObjects
 Sets an array list of model objects as the secondary objects of the connection.
Top
See Also
Reference
Connection Class
Tekla.Structures.Model Namespace