Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionBase Methods
The CurvedDimensionBase type exposes the following members.
Methods
Name | Description
Delete
 Deletes the straight dimension from the database.
 (Overrides DatabaseObject.Delete().)
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet().)
Insert
 Inserts the dimension to the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 The single dimension cannot be modified.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the straight dimension from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
CurvedDimensionBase Class
Tekla.Structures.Drawing Namespace