Tekla Open API Reference for Tekla Structures 2025
RebarLegSurfaceObject Properties
The RebarLegSurfaceObject type exposes the following members.
Properties
Name | Description
AdditionalOffset
 Gets or sets the user defined offset of the rebar legs from the leg surface object.
LayerNumber
 Gets or sets the layer number of the leg surface object.
RebarSet
 Gets or sets the RebarSet to which the leg surface object belongs.
Top
See Also
Reference
RebarLegSurfaceObject Class
Tekla.Structures.Model Namespace