Tekla Open API Reference for Tekla Structures 2025
ReinforcementMesh Properties
The ReinforcementMesh type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementMeshAttributes.
ReinforcementCustomPositionCrossing
 Defines the location of the crossing bar when using MeshReinforcementVisibilityCrossing == ReinforcementVisibilityTypes.Customized. This location is a value between 0.0 and 1.0 and it defines the proportion from the mesh's start point.
ReinforcementCustomPositionLongitudinal
 Defines the location of the longitudinal wire when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized. This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.
Top
See Also
Reference
ReinforcementMesh Class
Tekla.Structures.Drawing Namespace