Tekla Open API Reference for Tekla Structures 2025
ContourPlate Properties
The ContourPlate type exposes the following members.
Properties
Name | Description
Contour
 Gets or sets the contour for the contour plate.
Type
 Gets the read only type of the contour plate. In creation, the type is defined based on the material. If the material is concrete, the type will be slab, otherwise plate.
Top
See Also
Reference
ContourPlate Class
Tekla.Structures.Model Namespace