Tekla Open API Reference for Tekla Structures 2025
Grid Class
 The Grid class defines a user defined (possibly magnetic) set of planes helping in modeling work. A grid has grid plane instances as children.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.GridBase
 Tekla.Structures.Model.Grid
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Grid : GridBase
<SerializableAttribute>
Public NotInheritable Class Grid
	Inherits GridBase
The Grid type exposes the following members.
Constructors
Name | Description
Grid
 Creates a new grid instance.
The default values are as follows:
Name = "Grid";
CoordinateX = "0.00 4*3000.00";
CoordinateY = "0.00 5*6000.00";
CoordinateZ = "0.00 6000.00 8000.00 9000.00";
LabelX = "A B C D E";
LabelY = "1 2 3 4 5 6";
LabelZ = "+0 +6000 +8000 +9000";
ExtensionLeftX = 2000.0;
ExtensionLeftY = 2000.0;
ExtensionLeftZ = 2000.0;
ExtensionRightX = 2000.0;
ExtensionRightY = 2000.0;
ExtensionRightZ = 2000.0;
IsMagnetic = false;
Top
Properties
Name | Description
Color
 Gets or sets the color of the grid.
CoordinateX
 The coordinates for the X-axis.
CoordinateY
 The coordinates for the Y-axis.
CoordinateZ
 The coordinates for the Z-axis.
ExtensionForMagneticArea |  Obsolete.
 The extension for the magnetic area.
ExtensionLeftX
 The extension to the left X-axis.
ExtensionLeftY
 The extension to the left Y-axis.
ExtensionLeftZ
 The extension to the left Z-axis.
ExtensionRightX
 The extension to the right X-axis.
ExtensionRightY
 The extension to the right Y-axis.
ExtensionRightZ
 The extension to the right Z-axis.
LabelX
 The labels for the X-axis.
LabelY
 The labels for the Y-axis.
LabelZ
 The labels for the Z-axis.
Top
Methods
Name | Description
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           Grid Grid = new Grid();
           Grid.IsMagnetic = true;
           bool Result = false;
           Result = Grid.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace