Tekla Open API Reference for Tekla Structures 2025
GridCylindricalSurface Methods
The GridCylindricalSurface type exposes the following members.
Methods
Name | Description
Modify
 Modifies the grid plane with the given ID.
 (Overrides GridSurface.Modify().)
Top
See Also
Reference
GridCylindricalSurface Class
Tekla.Structures.Model Namespace