Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroup Methods
The ReinforcementSetGroup type exposes the following members.
Methods
Name | Description
GetModelIdentifiers
 Gets the model identifiers of the single rebars in this reinforcement set group.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
See Also
Reference
ReinforcementSetGroup Class
Tekla.Structures.Drawing Namespace