Tekla Open API Reference for Tekla Structures 2025
CustomPart Properties
The CustomPart type exposes the following members.
Properties
Name | Description
Position
 The way the custom part is positioned in the model.
Top
See Also
Reference
CustomPart Class
Tekla.Structures.Model Namespace