Tekla Open API Reference for Tekla Structures 2025
TaskWorktype Properties
The TaskWorktype type exposes the following members.
Properties
Name | Description
Name
 The name of the task worktype.
Top
See Also
Reference
TaskWorktype Class
Tekla.Structures.Model Namespace