Tekla Open API Reference for Tekla Structures 2025
FacetedBrepWithNormals Properties
The FacetedBrepWithNormals type exposes the following members.
Properties
Name | Description
Normals
 Gets or sets the vertex normal unit vectors
Top
See Also
Reference
FacetedBrepWithNormals Class
Tekla.Structures.Geometry3d Namespace