Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase Properties
The ReinforcementBase type exposes the following members.
Properties
Name | Description
Attributes
 The common attributes of all reinforcements. For more information see ReinforcementBase.ReinforcementBaseAttributes.
Top
See Also
Reference
ReinforcementBase Class
Tekla.Structures.Drawing Namespace