Tekla Open API Reference for Tekla Structures 2025
SectionMark Class
 The SectionMark class defines a drawing object that illustrates a straight section in a specific view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.SectionMarkBase
 Tekla.Structures.Drawing.SectionMark
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SectionMark : SectionMarkBase
<SerializableAttribute>
Public NotInheritable Class SectionMark
	Inherits SectionMarkBase
The SectionMark type exposes the following members.
Constructors
Name | Description
SectionMark(View, Point, Point)
 Creates a new section mark instance with the given positions.
SectionMark(View, Point, Point, SectionMarkBase.SectionMarkAttributes)
 Creates a new section mark instance with the given positions and attributes.
Top
Properties
Name | Description
Top
Methods
Name | Description
Top
Examples
 The following code inserts a new section mark in the current drawing:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class SectionMarkExample
{
    public void SectionMarkInsert()
    {
        DrawingHandler myDrawingHandler = new DrawingHandler();
        DrawingObjectEnumerator viewsEnumerator = myDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
        View view = null;
        if (viewsEnumerator.MoveNext())
            view = viewsEnumerator.Current as View;
        if (view != null)
        {
            SectionMark sectionMark = new SectionMark(view, new Point(1000, 2000), new Point(3000, 1200));
            sectionMark.Insert();
        }
    }
}
See Also
Reference
Tekla.Structures.Drawing Namespace