Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionItem Class
 The BinaryFilterExpressionItem class represents a data item in a BinaryFilterExpressionCollection. This class cannot be inherited.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.BinaryFilterExpressionItem
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BinaryFilterExpressionItem : Expression
<SerializableAttribute>
Public NotInheritable Class BinaryFilterExpressionItem
	Inherits Expression
The BinaryFilterExpressionItem type exposes the following members.
Constructors
Name | Description
BinaryFilterExpressionItem(FilterExpression)
 Initializes a new instance of the BinaryFilterExpressionItem class.
BinaryFilterExpressionItem(FilterExpression, BinaryFilterOperatorType)
 Initializes a new instance of the BinaryFilterExpressionItem class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace
Tekla.Structures.Filtering.BinaryFilterExpression
Tekla.Structures.Filtering.BinaryFilterExpressionCollection