Tekla Open API Reference for Tekla Structures 2025
Beam Class
 The Beam class represents a single beam in the model. A beam has a single start and end point.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Part
 Tekla.Structures.Model.Beam
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Beam : Part
<SerializableAttribute>
Public NotInheritable Class Beam
	Inherits Part
The Beam type exposes the following members.
Constructors
Name | Description
Beam()
 Initializes a new instance of the Beam class. The start and end points are in the origin.
Beam(Beam.BeamTypeEnum)
 Initializes a new instance of the Beam class by using the defined type.
Beam(Point, Point)
 Initializes a new instance of the Beam class with the given start and end points.
Top
Properties
Name | Description
EndPoint
 Gets or sets the end point of the beam.
EndPointOffset
 Gets or sets the beam's end point offset.
StartPoint
 Gets or sets the start point of the beam.
StartPointOffset
 Gets or sets the beam's start point offset.
Type
 Gets the read-only type of the beam. The default type for a new beam instance is beam.
Top
Methods
Name | Description
Delete
 Deletes the beam instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the beam into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing beam in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a beam from the model database. The beam identifier must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Point point = new Point(0, 0, 0);
           Point point2 = new Point(1000, 0, 0);
           Beam beam = new Beam();
           beam.StartPoint = point;
           beam.EndPoint = point2;
           beam.Profile.ProfileString = "HEA400";
           beam.Finish = "PAINT";
           beam.StartPointOffset = new Offset();
           beam.EndPointOffset = new Offset();
           bool result = false;
           result = beam.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace