Tekla Open API Reference for Tekla Structures 2025
CircleRebarGroup Methods
The CircleRebarGroup type exposes the following members.
Methods
Name | Description
Delete
 Deletes the circle rebar group instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the circle rebar group into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing circle rebar group in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a circle rebar group from the model database. The identifier of the circle rebar group must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
CircleRebarGroup Class
Tekla.Structures.Model Namespace