Tekla Open API Reference for Tekla Structures 2025
Polyline.PolylineAttributes Class
 The PolylineAttributes class is the attributes class of the polyline.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes
 Tekla.Structures.Drawing.Polyline.PolylineAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PolylineAttributes : OpenGraphicObject.OpenGraphicObjectAttributes
<SerializableAttribute>
Public NotInheritable Class PolylineAttributes
	Inherits OpenGraphicObject.OpenGraphicObjectAttributes
The Polyline.PolylineAttributes type exposes the following members.
Constructors
Name | Description
Polyline.PolylineAttributes()
 Creates a new default polyline attributes instance that loads standard attributes.
Polyline.PolylineAttributes(String)
 Creates a new polyline attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace