Tekla Open API Reference for Tekla Structures 2025
CrossSectionPoint Class
 The CrossSectionPoint class defines a point with possible chamfering information
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Point
 Tekla.Structures.Catalogs.CrossSectionPoint
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CrossSectionPoint : Point
<SerializableAttribute>
Public NotInheritable Class CrossSectionPoint
	Inherits Point
The CrossSectionPoint type exposes the following members.
Constructors
Name | Description
CrossSectionPoint
 Creates a new cross section point instance.
Top
Properties
Name | Description
Chamfer
 The chamfer for the cross section point.
Top
Methods
Name | Description
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace