Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectBase Properties
The EmbeddedObjectBase type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the angle (in degrees).
Attributes
 Gets or sets the attributes.
FileName
 Gets or sets the file name defining the embedded object.
InsertionPoint
 Gets or sets the insertion point.
Size
 Gets or sets the size of the frame of the embedded object.
Top
See Also
Reference
EmbeddedObjectBase Class
Tekla.Structures.Drawing Namespace