Tekla Open API Reference for Tekla Structures 2025
LinkBase Class
 The LinkBase class is the base class for links.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.LinkBase
 Tekla.Structures.Drawing.DrawingLink
 Tekla.Structures.Drawing.HyperLink
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class LinkBase : DrawingObject,
	IResizeable, IMovableRelative, IAxisAlignedBoundingBox, IObjectAlignedBoundingBox
<SerializableAttribute>
Public MustInherit Class LinkBase
	Inherits DrawingObject
	Implements IResizeable, IMovableRelative, IAxisAlignedBoundingBox, IObjectAlignedBoundingBox
The LinkBase type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the angle of the link.
Attributes
 Gets or sets the link attributes.
InsertionPoint
 Gets or sets the insertion point of the link.
Text
 Gets or sets the link text that is visible on the screen.
Top
Methods
Name | Description
GetAxisAlignedBoundingBox
 Gets the bounding box for the current object in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Gets the bounding box for the current object in its local coordinate system.
MoveObjectRelative
 Moves the object according to the given move vector.
Resize
 Resizes the object. The scaling type is changed to ScaleToFit.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace