Tekla Open API Reference for Tekla Structures 2025
ParametricObject_CustomProfile Class
 The ParametricObject_CustomProfile class contains the custom profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.ParametricObject_CustomProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ParametricObject_CustomProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class ParametricObject_CustomProfile
	Inherits ReferenceModelObjectAttribute
The ParametricObject_CustomProfile type exposes the following members.
Properties
Name | Description
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace