Tekla Open API Reference for Tekla Structures 2025
RectangleAttributes Properties
The Rectangle.RectangleAttributes type exposes the following members.
Properties
Name | Description
Bulge
 The bulge value for the rectangle.
Top
See Also
Reference
Rectangle.RectangleAttributes Class
Tekla.Structures.Drawing Namespace