Tekla Open API Reference for Tekla Structures 2025
RebarSetAddition Class
 The RebarSetAddition class can be used to add RebarLegFace objects to an existing RebarSet.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.RebarSetAddition
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarSetAddition : ModelObject
<SerializableAttribute>
Public Class RebarSetAddition
	Inherits ModelObject
The RebarSetAddition type exposes the following members.
Constructors
Name | Description
RebarSetAddition
 Initializes a new instance of the RebarSetAddition class with empty attributes.
Top
Properties
Name | Description
Father
 Gets or sets the RebarSet to which the rebar set addition applies.
LegFaces
 Gets or sets the rebar set addition's RebarLegFace objects.
Top
Methods
Name | Description
Delete
 Deletes the rebar set addition with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the rebar set addition into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the rebar set addition in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the rebar set addition from the model database. The rebar set addition identifier must be set.
 (Overrides ModelObject.Select().)
Top
Examples
 The following example shows how to create and add a RebarSetAddition, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
            // Create and insert a rebarset (see the RebarSet example).
            var rebarSet = new RebarSet();
            // Create the RebarSetAddition
            var rebarSetAddition = new RebarSetAddition();
            // Create an additional leg face
            var additionalLegFace = new RebarLegFace
            {
                LayerOrderNumber = 2,
                AdditonalOffset = 25.0,
                Reversed = false
             };
            additionalLegFace.Contour.AddContourPoint(new ContourPoint(new Point(800, 0, 0), null));
            additionalLegFace.Contour.AddContourPoint(new ContourPoint(new Point(800, 0, 500), null));
            additionalLegFace.Contour.AddContourPoint(new ContourPoint(new Point(800, 1200,500), null));
            additionalLegFace.Contour.AddContourPoint(new ContourPoint(new Point(800, 1200, 0), null));
            // Insert the additional leg face
            rebarSetAddition.LegFaces.Add(additionalLegFace);
            rebarSetAddition.Father = rebarSet;
            rebarSetAddition.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace