Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase Methods
The ReinforcementBase type exposes the following members.
Methods
Name | Description
Delete
 Deletes the drawing reinforcement from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 Inserts the drawing reinforcement into the current drawing database. NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
Modify
 Modifies the drawing reinforcement in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing reinforcement from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
ReinforcementBase Class
Tekla.Structures.Drawing Namespace