Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_CShapeProfile Class
 The IFC2X3_ParametricObject_CShapeProfile class contains the C-shape profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CShapeProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_CShapeProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_CShapeProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_CShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
Girth
 The girth.
InternalFilletRadius
 The internal fillet radius.
WallThickness
 The wall thickness.
Width
 The width.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace