Tekla Open API Reference for Tekla Structures 2025
BaseComponent Methods
The BaseComponent type exposes the following members.
Methods
Name | Description
GetAttribute(String, Double)
 Retrieves the attribute with the given name.
GetAttribute(String, Int32)
 Retrieves the attribute with the given name.
GetAttribute(String, String)
 Retrieves the attribute with the given name.
LoadAttributesFromFile
 Loads the attributes for the component from the given file. These attributes will be loaded before all the attributes that have been set with the SetAttribute methods, so any attributes that are set with SetAttribute will override those loaded from the given standard file.
SetAttribute(String, Double)
 Sets the attribute's value to the given value.
SetAttribute(String, Int32)
 Sets the attribute's value to the given value.
SetAttribute(String, String)
 Sets the attribute's value to the given value.
Top
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace