Tekla Open API Reference for Tekla Structures 2025
DrawingEnumerator Class
 The DrawingEnumerator class provides the means to iterate through drawing instances. Drawing enumerators are generated by the drawing handler.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DrawingEnumeratorBase
 Tekla.Structures.Drawing.DrawingEnumerator
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class DrawingEnumerator : DrawingEnumeratorBase
Public NotInheritable Class DrawingEnumerator
	Inherits DrawingEnumeratorBase
The DrawingEnumerator type exposes the following members.
Properties
Name | Description
Current
 Gets the current drawing.
Top
Methods
Name | Description
Top
Fields
Name | Description
Top
Examples
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           DrawingHandler DrawingHandler = new DrawingHandler();
           // Loop through all available drawings and delete all GA drawings.
           DrawingEnumerator AllDrawings = DrawingHandler.GetDrawings();
           while(AllDrawings.MoveNext())
           {
               Drawing CurrentDrawing = AllDrawings.Current as GADrawing;
               if(CurrentDrawing != null)
               {
                   CurrentDrawing.Delete();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace