Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadGroup Properties
The AnalysisLoadGroup type exposes the following members.
Properties
Name | Description
Compatible
 Gets or sets a value indicating whether the load group is compatible.
CompatibleNumber
 Gets or sets the load group compatible number.
Direction
 Gets or sets the direction of the load group.
Incompatible
 Gets or sets a value indicating whether the load group is incompatible.
IncompatibleNumber
 Gets or sets the load group incompatible number.
LoadGroupID
 Gets or sets the identifier of the load group.
Name
 Gets or sets the name of the load group.
Type
 Gets or sets the type of the load group.
Top
See Also
Reference
AnalysisLoadGroup Class
Tekla.Structures.Analysis Namespace