Tekla Open API Reference for Tekla Structures 2025
LinkBase Properties
The LinkBase type exposes the following members.
Properties
Name | Description
Angle
 Gets or sets the angle of the link.
Attributes
 Gets or sets the link attributes.
InsertionPoint
 Gets or sets the insertion point of the link.
Text
 Gets or sets the link text that is visible on the screen.
Top
See Also
Reference
LinkBase Class
Tekla.Structures.Drawing Namespace