Tekla Open API Reference for Tekla Structures 2025
PluginFormBase Properties
The PluginFormBase type exposes the following members.
Properties
Name | Description
ShowInTaskbar
 Hides (shadows) the ShowInTaskbar property by setting the property to false.
Top
See Also
Reference
PluginFormBase Class
Tekla.Structures.Dialog Namespace