Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem.Select Method
Overload List
Name | Description
Select(String)
 Selects the profile item in the profile database using the given name.
Top
See Also
Reference
LibraryProfileItem Class
Tekla.Structures.Catalogs Namespace