Tekla Open API Reference for Tekla Structures 2025
PickerInputObject Properties
The PickerInputObject type exposes the following members.
Properties
Name | Description
PickedObject
 Gets or sets the picked object in the view.
Top
See Also
Reference
PickerInputObject Class
Tekla.Structures.Drawing Namespace