Tekla Open API Reference for Tekla Structures 2025
Weld Class
 The Weld class represents weldings in drawing views that refer to actual welds in the model database. It has properties and methods to control the graphical representation of welding lines. Instances of Weld class cannot be inserted with code. These appear in drawings when views are created/updated. To modify its graphical representation, attributes of Weld class can use .welo setting files.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.Weld
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Weld : ModelObject
<SerializableAttribute>
Public NotInheritable Class Weld
	Inherits ModelObject
The Weld type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the weld. For more information see Weld.WeldAttributes.
Top
Methods
Name | Description
Delete
 Deletes the drawing weld from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED. Welding lines that refer to welds in the model database appear in views when drawing views are created/updated.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the weld. Class can use .welo setting files to modify graphical representation of the welding lines.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing weld from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace