Tekla Open API Reference for Tekla Structures 2025
ControlLine Class
 The ControlLine class defines a user defined (possibly magnetic) line helping in modeling work.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.ControlLine
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ControlLine : ModelObject
<SerializableAttribute>
Public NotInheritable Class ControlLine
	Inherits ModelObject
The ControlLine type exposes the following members.
Constructors
Name | Description
ControlLine()
 Creates a new control line instance.
The default values are as follows:
Line = new LineSegment();
IsMagnetic = false;
Color = ControlLineColorEnum.YELLOW;
Extension = 0.0;
ControlLine(LineSegment, Boolean)
 Creates a new control line instance taking the line segment and magnetism as input.
Top
Properties
Name | Description
Color
 The color of the control line.
Extension
 The extension of the control line.
IsMagnetic
 Determines whether the line is magnetic or not.
Line
 The line segment defining the position of the control line.
LineType
 The line type of the control line.
Top
Methods
Name | Description
Delete
 Deletes the control line with the given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control line into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control line with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the control line with the given Identifier.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           ControlLine controlLine = new ControlLine();
           LineSegment line = new LineSegment();
           line.Point1 = new Point(6000,6000,0);
           line.Point2 = new Point(6000,12000,0);
           controlLine.Line = line;
           controlLine.IsMagnetic = true;
           bool Result = false;
           Result = controlLine.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace