Tekla Open API Reference for Tekla Structures 2025
RebarEndDetailModifier Methods
The RebarEndDetailModifier type exposes the following members.
Methods
Name | Description
GetAffectedBars
 Gets the virtual bars affected by this modifier.
Top
See Also
Reference
RebarEndDetailModifier Class
Tekla.Structures.Model Namespace