Tekla Open API Reference for Tekla Structures 2025
MultiDrawing Methods
The MultiDrawing type exposes the following members.
Methods
Name | Description
Insert
 Not supported.
 (Overrides DatabaseObject.Insert().)
Modify
 Applies the changes made to the drawing attributes.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
MultiDrawing Class
Tekla.Structures.Drawing Namespace