Tekla Open API Reference for Tekla Structures 2025
RebarGroup Methods
The RebarGroup type exposes the following members.
Methods
Name | Description
Delete
 Deletes the rebar group instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the rebar group into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing rebar group in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a rebar group from the model database. The reinforcement identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
RebarGroup Class
Tekla.Structures.Model Namespace