Tekla Open API Reference for Tekla Structures 2025
Symbol Properties
The Symbol type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the symbol attributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
InsertionPoint
 Gets or sets the symbol insertion point.
Placing
 The current placing of the object. See the placing types for different placing options.
SymbolInfo
 Gets or sets the symbol information.
Top
See Also
Reference
Symbol Class
Tekla.Structures.Drawing Namespace