Tekla Open API Reference for Tekla Structures 2025
StraightDimension Properties
The StraightDimension type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the dimension's attributes.
Distance
 Gets or sets the distance of the dimension line from the start point of the dimension.
EndPoint
 Gets or sets the end point of the dimension.
StartPoint
 Gets or sets the start point of the dimension.
UpDirection
 Gets or sets the direction from the dimension points to the dimension line.
Value
 Gets the content of the dimension mark.
Top
See Also
Reference
StraightDimension Class
Tekla.Structures.Drawing Namespace