Tekla Open API Reference for Tekla Structures 2025
FacePerpendicularToIntersectionLineException Class
 The FacePerpendicularToIntersectionLineException class represents an error when, face perpendicular to intersection line.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.FacePerpendicularToIntersectionLineException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class FacePerpendicularToIntersectionLineException : ConnectiveGeometryException
<SerializableAttribute>
Public Class FacePerpendicularToIntersectionLineException
	Inherits ConnectiveGeometryException
The FacePerpendicularToIntersectionLineException type exposes the following members.
Constructors
Name | Description
FacePerpendicularToIntersectionLineException
 Initializes a new instance of the FacePerpendicularToIntersectionLineException class with "face perpendicular to intersection line" error message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace