Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes Class
 The CurvedDimensionSetRadialAttributes class contains the attributes for managing all the attributes of the curved dimension with radial reference lines.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes
 Tekla.Structures.Drawing.CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
 Tekla.Structures.Drawing.CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedDimensionSetRadialAttributes : CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
<SerializableAttribute>
Public NotInheritable Class CurvedDimensionSetRadialAttributes
	Inherits CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
The CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes type exposes the following members.
Constructors
Name | Description
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes()
 Creates a new curved dimension set radial attributes instance which loads standard attributes.
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes(Boolean)
 Creates a new curved dimension set radial attributes instance which loads standard attributes. If it set to true attributes won't be lodaded.
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes(String)
 Creates a new curved dimension set radial attributes instance that loads the specified attributes.
Top
Properties
Name | Description
CurvedDimensionType
 The curved dimension type.
DimensionType
 The dimension type.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace