Tekla Open API Reference for Tekla Structures 2025
TaskDependency Methods
The TaskDependency type exposes the following members.
Methods
Name | Description
Delete
 Deletes the task dependency instance from the model.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the task dependency instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the task dependency instance in the model. The identifier must be set.
 (Overrides ModelObject.Modify().)
Select
 Selects the task dependency instance from the model. The identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
TaskDependency Class
Tekla.Structures.Model Namespace