Tekla Open API Reference for Tekla Structures 2025
ControlCircle Class
 The ControlCircle class defines a user defined (not magnetic) circle helping in modeling work. If there are duplicated input points or 3 input points are in a line, ControlCircle.Insert() will return false. ControlCircle.Select() will return the center point of the circle to Point1.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.ControlCircle
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ControlCircle : ModelObject
<SerializableAttribute>
Public NotInheritable Class ControlCircle
	Inherits ModelObject
The ControlCircle type exposes the following members.
Constructors
Name | Description
ControlCircle()
 Initializes a new instance of the ControlCircle class.
 The default values are as follows:
 Color = ControlCircleColorEnum.YELLOW;
 Extension = 0.0;
ControlCircle(Point, Point, Point)
 Initializes a new instance of the ControlCircle class. The control circle is not magnetic.
Top
Properties
Name | Description
Color
 Gets or sets the color of the control circle.
Extension
 Gets or sets the extension of the control circle.
LineType
 The line type of the control circle.
Point1
 Gets or sets the first point. Point1 becomes the center point of the circle after selecting the control circle.
Point2
 Gets or sets the second point. Point2 contains the original input Point1 after selecting the control circle.
Point3
 Gets or sets the third point. Point3 contains the calculated result from the orthogonal point and the center point after selecting the control circle.
Top
Methods
Name | Description
Delete
 Deletes the control circle with the given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control circle into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control circle with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the control circle with the given Identifier.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Point p1 = new Point(4500, 4500, 0);
           Point p2 = new Point(4500, 9000, 0);
           Point p3 = new Point(0, 0, 0);
           ControlCircle controlCircle = new ControlCirle(p1, p2, p3);
           bool Result = false;
           Result = ControlCircle.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace