Tekla Open API Reference for Tekla Structures 2025
TaskWorktype Class
 The TaskWorktype class defines a single worktype for a task object. Each task may belong to only one worktype.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.TaskWorktype
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class TaskWorktype : ModelObject
<SerializableAttribute>
Public NotInheritable Class TaskWorktype
	Inherits ModelObject
The TaskWorktype type exposes the following members.
Constructors
Name | Description
TaskWorktype
 Creates a new task worktype instance.
Top
Properties
Name | Description
Name
 The name of the task worktype.
Top
Methods
Name | Description
Delete
 Deletes the task worktype instance from the model. The identifier must be set.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the task worktype instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the task worktype instance in the model. The identifier must be set.
 (Overrides ModelObject.Modify().)
Select
 Selects the task worktype instance from the model. The identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Tekla.Structures.Model Namespace