Tekla Open API Reference for Tekla Structures 2025
CurvedRebarGroup Class
 The CurvedRebarGroup class represents a group of reinforcing bars which have a curved shape.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Reinforcement
 Tekla.Structures.Model.BaseRebarGroup
 Tekla.Structures.Model.CurvedRebarGroup
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedRebarGroup : BaseRebarGroup
<SerializableAttribute>
Public NotInheritable Class CurvedRebarGroup
	Inherits BaseRebarGroup
The CurvedRebarGroup type exposes the following members.
Constructors
Name | Description
CurvedRebarGroup
 Initializes a new curved rebar group instance with empty attributes.
Top
Properties
Name | Description
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
ExcludeType
 Defines which bars to omit from the group. The options are:
EXCLUDE_TYPE_NONE
EXCLUDE_TYPE_FIRST
EXCLUDE_TYPE_LAST
Polygon
 A polygon definition for the curved reinforcing bar group shape. The polygon must have 3 points.
SpacingType
 The type of spacing. The options are (BaseRebarGroup.RebarGroupSpacingTypeEnum.):
SPACING_TYPE_UNDEFINED
SPACING_TYPE_EXACT_SPACINGS
SPACING_TYPE_EXACT_NUMBER
SPACING_TYPE_TARGET_SPACE
SPACING_TYPE_EXACT_SPACE_FLEX_AT_START
SPACING_TYPE_EXACT_SPACE_FLEX_AT_END
SPACING_TYPE_EXACT_SPACE_FLEX_AT_BOTH
Top
Methods
Name | Description
Delete
 Deletes the curved rebar group instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the curved rebar group into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing curved rebar group in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a curved rebar group from the model database. The identifier of the curved rebar group must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Beam Beam = new Beam(new Point(5000, 8000, 0), new Point(6000, 8000, 0));
           Beam.Profile.ProfileString = "D500";
           Beam.Material.MaterialString = "K40-1";
           Beam.Finish = "PAINT";
           Beam.Insert();
           double MinimumX = Beam.GetSolid().MinimumPoint.X;
           double MinimumY = Beam.GetSolid().MinimumPoint.Y;
           double MinimumZ = Beam.GetSolid().MinimumPoint.Z;
           double MaximumX = Beam.GetSolid().MaximumPoint.X;
           double MaximumY = Beam.GetSolid().MaximumPoint.Y;
           double MaximumZ = Beam.GetSolid().MaximumPoint.Z;
           CurvedRebarGroup CurvedRebarGroup = new CurvedRebarGroup();
           CurvedRebarGroup.Polygon.Points.Add(new Point(MinimumX, MaximumY, MinimumZ));
           CurvedRebarGroup.Polygon.Points.Add(new Point(MinimumX, MinimumY, MinimumZ));
           CurvedRebarGroup.Polygon.Points.Add(new Point(MinimumX, MinimumY, MaximumZ));
           CurvedRebarGroup.StartPoint = new Point(MinimumX, MaximumY, MinimumZ);
           CurvedRebarGroup.EndPoint = new Point(MaximumX, MaximumY, MinimumZ);
           CurvedRebarGroup.Father = Beam;
           CurvedRebarGroup.RadiusValues.Add(40.0);
           CurvedRebarGroup.SpacingType = BaseRebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_EXACT_SPACINGS;
           CurvedRebarGroup.Spacings.Add(30); //if you use: RebarGroup.Spacings.Add(30.0); ->then it works
           CurvedRebarGroup.ExcludeType = BaseRebarGroup.ExcludeTypeEnum.EXCLUDE_TYPE_NONE;
           CurvedRebarGroup.Name = "RebarGroup";
           CurvedRebarGroup.Class = 3;
           CurvedRebarGroup.Size = "8";
           CurvedRebarGroup.NumberingSeries.StartNumber = 0;
           CurvedRebarGroup.NumberingSeries.Prefix = "Group";
           CurvedRebarGroup.Grade = "A500HW";
           CurvedRebarGroup.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace