Tekla Open API Reference for Tekla Structures 2025
DrawingObjectEnumerator Class
 The DrawingObjectEnumerator class provides the means to iterate through drawing object instances. Drawing object enumerators are generated by the container view and they contain drawing objects that are children of the container view instance.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DrawingEnumeratorBase
 Tekla.Structures.Drawing.DrawingObjectEnumerator
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class DrawingObjectEnumerator : DrawingEnumeratorBase
Public NotInheritable Class DrawingObjectEnumerator
	Inherits DrawingEnumeratorBase
The DrawingObjectEnumerator type exposes the following members.
Properties
Name | Description
Current
 Gets the current drawing object.
Top
Methods
Name | Description
Top
Fields
Name | Description
Top
Examples
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           DrawingHandler DrawingHandler = new DrawingHandler();
           Drawing CurrentDrawing = DrawingHandler.GetActiveDrawing();
           // Loop through all objects in the drawing and delete all existing line objects.
           DrawingObjectEnumerator AllObjects = CurrentDrawing.GetSheet().GetAllObjects();
           while(AllObjects.MoveNext())
           {
               if(AllObjects.Current is Line)
               {
                   AllObjects.Current.Delete();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace