Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_EllipseProfile Properties
The IFC2X3_ParametricObject_EllipseProfile type exposes the following members.
Properties
Name | Description
SemiAxis1
 The first semi-axis.
SemiAxis2
 The second semi-axis.
Top
See Also
Reference
IFC2X3_ParametricObject_EllipseProfile Class
Tekla.Structures.Model.Collaboration Namespace