Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObject Class
 The ReferenceModelObject class contains methods related to reference model objects. A reference model object is a subobject of a reference model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.ReferenceModelObject
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReferenceModelObject : ModelObject
<SerializableAttribute>
Public NotInheritable Class ReferenceModelObject
	Inherits ModelObject
The ReferenceModelObject type exposes the following members.
Constructors
Name | Description
ReferenceModelObject()
 Creates a new reference model object instance.
ReferenceModelObject(Int32, Identifier)
 Creates a new reference model object instance using the given parameters.
Top
Properties
Name | Description
Top
Methods
Name | Description
Delete
 At the moment reference objects cannot be deleted.
 (Overrides ModelObject.Delete().)
GetFather
 Returns the reference hierarchy father.
GetReferenceModel
 Gets the reference model that the reference object belongs to.
Insert
 At the moment reference objects cannot be inserted.
 (Overrides ModelObject.Insert().)
Modify
 At the moment reference objects cannot be modified.
 (Overrides ModelObject.Modify().)
Select
 Selects the reference model with the given identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Tekla.Structures.Model Namespace