Tekla Open API Reference for Tekla Structures 2025
LoftedPlate Methods
The LoftedPlate type exposes the following members.
Methods
Name | Description
Delete
 Deletes the lofted plate with this instance identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the lofted plate into the model database. All the attributes must be set and there must be at minimum 2 base curves.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the lofted plate object values in the database.
 (Overrides ModelObject.Modify().)
Select
 Selects a lofted plate object from the database.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
LoftedPlate Class
Tekla.Structures.Model Namespace