Tekla Open API Reference for Tekla Structures 2025
SurfaceFilterExpressions.Class Class
 The Class class represents the class filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.Class
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Class : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class Class
	Inherits NumericFilterExpression
The SurfaceFilterExpressions.Class type exposes the following members.
Constructors
Name | Description
SurfaceFilterExpressions.Class
 Initializes a new instance of the Class class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace