Tekla Open API Reference for Tekla Structures 2025
NormalLineType Methods
The NormalLineType type exposes the following members.
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
 (Overrides LineTypes.Clone().)
Equals
 Returns true if the current object and the given object are equal.
 (Overrides LineTypes.Equals(Object).)
GetHashCode
 Returns a hash code for the object.
 (Overrides LineTypes.GetHashCode().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides LineTypes.IsEqual(Object).)
Top
See Also
Reference
NormalLineType Class
Tekla.Structures.Drawing Namespace