Tekla Open API Reference for Tekla Structures 2025
GridSurface Class
 The GridSurface class defines a user defined (possibly magnetic) surface helping in modeling work. A grid surface must always belong to a parent GridBase instance.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.GridSurface
 Tekla.Structures.Model.GridCylindricalSurface
 Tekla.Structures.Model.GridPlane
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class GridSurface : ModelObject
<SerializableAttribute>
Public MustInherit Class GridSurface
	Inherits ModelObject
The GridSurface type exposes the following members.
Constructors
Name | Description
GridSurface()
 Creates a new grid surface instance.
The default values are as follows:
Label = "Default";
IsMagnetic = false;
ExtensionLeft = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;
GridSurface(String)
 Creates a new grid surface instance taking the label as input.
Top
Properties
Name | Description
DrawingVisibility
 The visibility of the grid surface in drawings.
ExtensionAbove
 The line extension above.
ExtensionBelow
 The line extension below.
ExtensionLeft
 The line extension on the left.
ExtensionRight
 The line extension on the right.
IsMagnetic
 Whether the grid surface is magnetic or not.
IsManual
 Gets or sets if the line was manually created.
Label
 The label for the grid surface.
Parent
 The parent grid of the grid surface.
Top
Methods
Name | Description
Delete
 Deletes the grid surface with the given ID.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the grid surface into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the grid surface with the given ID.
 (Overrides ModelObject.Modify().)
Select
 Selects the grid surface with the given ID.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Tekla.Structures.Model Namespace