Tekla Open API Reference for Tekla Structures 2025
Seam Class
 The Seam class represents a seam. A seam is something that connects a main part to other parts along an edge.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseComponent
 Tekla.Structures.Model.Seam
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Seam : BaseComponent
<SerializableAttribute>
Public NotInheritable Class Seam
	Inherits BaseComponent
The Seam type exposes the following members.
Constructors
Name | Description
Seam
 Creates a new seam instance.
Top
Properties
Name | Description
AutoDirectionType
 The auto direction type. Default value is AUTODIR_BASIC. Value should be AUTODIR_NA to set direction with UpVector property. Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with seam attribute file.
AutoPosition
 The auto position type. Defines that the seam will internally evaluate the final position more accurately. The input positions are still needed for reference.
Class
 The class of the seam.
Code
 The code of the seam. The code can be used to classify the seam. The code can be reported and shown in drawings. The maximum length of the string is 20 characters.
Status
 The read only status of the seam. The status can be reported and shown in drawings. The color of the connection symbol in the model indicates the status of the seam.
UpVector
 A vector indicating which direction is considered the up direction for the seam.
Top
Methods
Name | Description
Delete
 Deletes the seam instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetInputPolygon
 Returns the input polygon of the seam.
GetPrimaryObject
 Returns the primary object.
GetSecondaryObjects
 Returns an array list containing all the secondary objects.
GetStartAndEndPositions
 Returns the start and end points of the seam.
Insert
 Inserts the seam into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing seam in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a seam from the model database. The seam ID must be set.
 (Overrides ModelObject.Select().)
SetInputPolygon
 Sets the input polygon of the seam.
SetInputPositions
 Sets the start and end point of the seam.
SetPrimaryObject
 Sets the primary object.
SetSecondaryObject
 Sets the secondary object of the seam. Use this method if you wish to add only one secondary object to the seam.
SetSecondaryObjects
 Sets the secondary objects.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using Tekla.Structures;
using System;
public class Example
{
       public void Example1()
       {
           Beam B1 = new Beam(new Point(15000,3000,0), new Point(21000,3000,0));
           B1.Profile.ProfileString = "780*380";
           B1.Material.MaterialString = "K40-1";
           B1.Class = "5";
           B1.Position.Plane = Position.PlaneEnum.MIDDLE;
           B1.Position.Rotation = Position.RotationEnum.TOP;
           B1.Position.Depth = Position.DepthEnum.BEHIND;
           Beam B2 = new Beam(new Point(15000,3000,0), new Point(21000,3000,0));
           B2.Profile.ProfileString = "780*380";
           B2.Material.MaterialString = "K40-1";
           B2.Class = "6";
           B2.Position.Plane = Position.PlaneEnum.MIDDLE;
           B2.Position.Rotation = Position.RotationEnum.TOP;
           B2.Position.Depth = Position.DepthEnum.FRONT;
           B1.Insert();
           B2.Insert();
           Seam S = new Seam();
           S.Name = "seamdm";
           S.Number = -1;
           S.LoadAttributesFromFile("standard");
           S.UpVector = new Vector(0,0,0);
           S.AutoDirectionType = AutoDirectionTypeEnum.AUTODIR_BASIC;
           S.AutoPosition = true;
           S.SetPrimaryObject(B1);
           S.SetSecondaryObject(B2);
           S.SetInputPositions(new Point(15000,3000,0), new Point(21000,3000,0));
           if(!S.Insert())
               Console.WriteLine("Seam Insert failed");
           else
               Console.WriteLine(S.Identifier.ID);
       }
}
See Also
Reference
Tekla.Structures.Model Namespace