Tekla Open API Reference for Tekla Structures 2025
GeneralConnectiveGeometryException Class
 The GeneralConnectiveGeometryException class represents a general error that occurred during the ConnectiveGeometry creation or modification.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.GeneralConnectiveGeometryException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class GeneralConnectiveGeometryException : ConnectiveGeometryException
<SerializableAttribute>
Public Class GeneralConnectiveGeometryException
	Inherits ConnectiveGeometryException
The GeneralConnectiveGeometryException type exposes the following members.
Constructors
Name | Description
GeneralConnectiveGeometryException
 Initializes a new instance of the GeneralConnectiveGeometryException class with "Failed to create or modify connective geometry" message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace