Tekla Open API Reference for Tekla Structures 2025
AnalysisAreaPolygon Class
 The AnalysisAreaPolygon class contains information related to analysis area polygons.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisAreaPolygon
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AnalysisAreaPolygon : AnalysisObject
Public Class AnalysisAreaPolygon
	Inherits AnalysisObject
The AnalysisAreaPolygon type exposes the following members.
Constructors
Name | Description
AnalysisAreaPolygon
 Creates a new instance of the AnalysisAreaPolygon class.
Top
Properties
Name | Description
Edges
 The edges of the area polygon.
Positions
 The positions of the area polygon.
Top
Methods
Name | Description
Add
 Adds a position to the analysis area polygon. Also adds an edge.
GetEdges
 Gets the edges of the area polygon.
GetPositions
 Gets the positions of the area polygon.
Insert
 Inserts an analysis area polygon. The AnalysisModelName has to be set.
Select
 Selects an analysis area polygon. The AnalysisObjectType has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace