Tekla Open API Reference for Tekla Structures 2025
MeshSelectionForm Class
 The MeshSelectionForm class represents a dialog to select meshes using the mesh catalog.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.FormBase
 Tekla.Structures.Dialog.ApplicationFormBase
 Tekla.Structures.Dialog.UIControls.MeshSelectionForm
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class MeshSelectionForm : ApplicationFormBase
Public Class MeshSelectionForm
	Inherits ApplicationFormBase
The MeshSelectionForm type exposes the following members.
Constructors
Name | Description
MeshSelectionForm(List<MeshItem>)
 Creates a new instance of the MeshSelectionForm.
MeshSelectionForm(List<MeshItem>, String, String)
 Creates a new instance of the MeshSelectionForm and will select in the tree the mesh that contains the given parameters (if possible).
Top
Properties
Name | Description
SelectedMeshGrade
 The selected mesh grade.
SelectedMeshName
 The selected mesh name.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace