Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetOrthogonal Properties
The CurvedDimensionSetOrthogonal type exposes the following members.
Properties
Name | Description
Attributes
 The curved dimension set orthogonal attributes.
Top
See Also
Reference
CurvedDimensionSetOrthogonal Class
Tekla.Structures.Drawing Namespace