Tekla Open API Reference for Tekla Structures 2025
Weld Properties
The Weld type exposes the following members.
Properties
Name | Description
Direction
 Defines the Weld edge search direction normalized to length 1000.0. Overrides Position if set.
Position
 Defines the position. Use of Direction is preferred over this.
Top
See Also
Reference
Weld Class
Tekla.Structures.Model Namespace