Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedAreaLoad Class
 The AnalysisDecomposedAreaLoad class contains decomposed area load information.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDecomposedAreaLoad : AnalysisDecomposedLoad
Public NotInheritable Class AnalysisDecomposedAreaLoad
	Inherits AnalysisDecomposedLoad
The AnalysisDecomposedAreaLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedAreaLoad
Initializes a new instance of the AnalysisDecomposedAreaLoad class
Top
Properties
Name | Description
Direction
 The direction of the decomposed area load.
Magnitudes
 The magnitudes of the decomposed area load.
Positions
 The positions of the decomposed area load.
Top
Methods
Name | Description
Select
 Selects an analysis decomposed area load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace