Tekla Open API Reference for Tekla Structures 2025
PourObjectFilterExpressions.PourType Class
 The PourType class represents the pour type filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.PourType
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PourType : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class PourType
	Inherits StringFilterExpression
The PourObjectFilterExpressions.PourType type exposes the following members.
Constructors
Name | Description
PourObjectFilterExpressions.PourType
 Initializes a new instance of the PourType class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace