Tekla Open API Reference for Tekla Structures 2025
Fitting Class
 The Fitting class defines how the part end fits to a plane. A fitting can make the part either longer or shorter.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Boolean
 Tekla.Structures.Model.Fitting
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Fitting : Boolean
<SerializableAttribute>
Public NotInheritable Class Fitting
	Inherits Boolean
The Fitting type exposes the following members.
Constructors
Name | Description
Fitting
 Initializes a new instance of the Fitting class with empty attributes.
Top
Properties
Name | Description
Plane
 The plane that fits the part.
Top
Methods
Name | Description
Delete
 Deletes the fitting instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the fitting into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing fitting in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a fitting from the model database. The fitting ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Point Point = new Point(0, 0, 0);
           Point Point2 = new Point(1000, 0, 0);
           Beam Beam = new Beam();
           Beam.StartPoint = Point;
           Beam.EndPoint = Point2;
           Beam.Profile.ProfileString = "HEA400";
           Beam.Finish = "PAINT";
           Beam.Insert();
           Fitting Fitting = new Fitting();
           Fitting.Plane = new Plane();
           Fitting.Plane.Origin = new Point(500, 0, 0);
           Fitting.Plane.AxisX = new Vector(0, 1000, 0);
           Fitting.Plane.AxisY = new Vector(0, 0, -1000);
           Fitting.Father = Beam;
           Fitting.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace