Tekla Open API Reference for Tekla Structures 2025
RebarSet Methods
The RebarSet type exposes the following members.
Methods
Name | Description
Delete
 Deletes the rebar set instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetAssembly
 Returns the assembly that the rebar set belongs to.
GetRebarLegSurfaces
 Returns an enumerator of all child RebarLegSurfaceObject objects.
GetRebarModifiers
 Returns an enumerator of all child BaseRebarModifier objects.
GetRebarSetAdditions
 Returns an enumerator of all child RebarSetAddition objects.
GetReinforcements
 Returns an enumerator of all the connected SingleRebar objects.
Insert
 Inserts the rebar set into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the rebar set in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the rebar set from the model database. The rebar set identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
RebarSet Class
Tekla.Structures.Model Namespace