Tekla Open API Reference for Tekla Structures 2025
FacetedBrepWithNormals Class
 The FacetedBRepWithNormals class defines a faceted BREP that has also vertex normal vectors.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.FacetedBrep
 Tekla.Structures.Geometry3d.FacetedBrepWithNormals
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class FacetedBrepWithNormals : FacetedBrep
<SerializableAttribute>
Public Class FacetedBrepWithNormals
	Inherits FacetedBrep
The FacetedBrepWithNormals type exposes the following members.
Constructors
Name | Description
FacetedBrepWithNormals
 Initializes a new instance of the FacetedBrepWithNormals class.
Top
Properties
Name | Description
Normals
 Gets or sets the vertex normal unit vectors
Top
Methods
Name | Description
Top
Examples
public void Example()
{
    /* See the method <b>InsertUsingNormals</b> in the <b>ShapeItem</b> class for a code example*/
}
See Also
Reference
Tekla.Structures.Geometry3d Namespace