Tekla Open API Reference for Tekla Structures 2025
TaskFilterExpressions.Critical Class
 The Critical class represents the critical filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.Critical
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Critical : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Critical
	Inherits StringFilterExpression
The TaskFilterExpressions.Critical type exposes the following members.
Constructors
Name | Description
TaskFilterExpressions.Critical
 Initializes a new instance of the Critical class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace