Tekla Open API Reference for Tekla Structures 2025
AssemblyFilterExpressions.Series Class
 The Series class represents the series filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Series
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Series : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Series
	Inherits StringFilterExpression
The AssemblyFilterExpressions.Series type exposes the following members.
Constructors
Name | Description
AssemblyFilterExpressions.Series
 Initializes a new instance of the Series class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace