Tekla Open API Reference for Tekla Structures 2025
AngleDimensionAttributes Class
 The AngleDimensionAttributes class contains the attributes for angle dimensions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes
 Tekla.Structures.Drawing.AngleDimensionAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class AngleDimensionAttributes : DimensionSetBaseAttributes
<SerializableAttribute>
Public NotInheritable Class AngleDimensionAttributes
	Inherits DimensionSetBaseAttributes
The AngleDimensionAttributes type exposes the following members.
Constructors
Name | Description
AngleDimensionAttributes()
 Creates a new angle dimension attributes instance which loads standard attributes.
AngleDimensionAttributes(String)
 Creates a new angle dimension attributes instance that loads the specified attributes.
Top
Properties
Name | Description
TriangleBase
 Gets or sets the triangle base length which controls the base dimension shown for bevel dimensions (only if Type is AngleTypes.Triangle).
Type
 The type of the angle.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
Examples
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           AngleDimensionAttributes attributes = new AngleDimensionAttributes("MyAttributes");
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace