Tekla Open API Reference for Tekla Structures 2025
InvalidRadiusException Class
 The InvalidRadiusException class represents an error when, cannot connect parts with a cylindrical section having the provided radius.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.InvalidRadiusException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class InvalidRadiusException : ConnectiveGeometryException
<SerializableAttribute>
Public Class InvalidRadiusException
	Inherits ConnectiveGeometryException
The InvalidRadiusException type exposes the following members.
Constructors
Name | Description
InvalidRadiusException
 Initializes a new instance of the InvalidRadiusException class with "Cannot connect parts with a cylindrical section having the provided radius" error message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace