Tekla Open API Reference for Tekla Structures 2025
ReinforcingBarFilterExpressions.Prefix Class
 The Prefix class represents the prefix filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Prefix
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Prefix : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Prefix
	Inherits StringFilterExpression
The ReinforcingBarFilterExpressions.Prefix type exposes the following members.
Constructors
Name | Description
ReinforcingBarFilterExpressions.Prefix
 Initializes a new instance of the Prefix class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace