Tekla Open API Reference for Tekla Structures 2025
BooleanConstantFilterExpression Class
 The BooleanConstantFilterExpression class represents a constant Boolean filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.BooleanConstantFilterExpression
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BooleanConstantFilterExpression : DataFilterExpression
<SerializableAttribute>
Public NotInheritable Class BooleanConstantFilterExpression
	Inherits DataFilterExpression
The BooleanConstantFilterExpression type exposes the following members.
Constructors
Name | Description
BooleanConstantFilterExpression(Boolean)
 Initializes a new instance of the BooleanConstantFilterExpression class.
BooleanConstantFilterExpression(Boolean, IFormatProvider)
 Initializes a new instance of the BooleanConstantFilterExpression class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace