Tekla Open API Reference for Tekla Structures 2025
CutPlane Class
 The CutPlane class defines how the end of a part is cut with a plane. A cut plane differs from a fitting because a cut can never extend the boundaries of the original part.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Boolean
 Tekla.Structures.Model.CutPlane
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CutPlane : Boolean
<SerializableAttribute>
Public NotInheritable Class CutPlane
	Inherits Boolean
The CutPlane type exposes the following members.
Constructors
Name | Description
CutPlane
 Initializes a new instance of the CutPlane class with empty attributes.
Top
Properties
Name | Description
Plane
 The plane that cuts the part.
Top
Methods
Name | Description
Delete
 Deletes the cut plane instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the cut plane into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing cut plane in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a cut plane from the model database. The part ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Point Point = new Point(0, 0, 0);
           Point Point2 = new Point(1000, 0, 0);
           Beam Beam = new Beam();
           Beam.StartPoint = Point;
           Beam.EndPoint = Point2;
           Beam.Profile.ProfileString = "HEA400";
           Beam.Finish = "PAINT";
           Beam.Insert();
           CutPlane CutPlane = new CutPlane();
           CutPlane.Plane = new Plane();
           CutPlane.Plane.Origin = new Point(0, 0, 0);
           CutPlane.Plane.AxisX = new Vector(0, 1000, 0);
           CutPlane.Plane.AxisY = new Vector(0, 0, -1000);
           CutPlane.Father = Beam;
           CutPlane.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace