Tekla Open API Reference for Tekla Structures 2025
DrawingLink Properties
The DrawingLink type exposes the following members.
Properties
Name | Description
Target
 Gets or sets the target drawing.
Top
See Also
Reference
DrawingLink Class
Tekla.Structures.Drawing Namespace