Tekla Open API Reference for Tekla Structures 2025
LoftedPlate Class
 This class represents a lofted plate
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Part
 Tekla.Structures.Model.LoftedPlate
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LoftedPlate : Part
<SerializableAttribute>
Public NotInheritable Class LoftedPlate
	Inherits Part
The LoftedPlate type exposes the following members.
Constructors
Name | Description
LoftedPlate
 Initializes a new instance of the LoftedPlate class.
Top
Properties
Name | Description
BaseCurves
 The curves that define the directrix lines of the lofted plate. A lofted plate is defined by at least to base curves (non empty if they are Polycurve(s)).
FaceType
 Gets or sets what type of solid faces will be used to create lofted plate solid.
Top
Methods
Name | Description
Delete
 Deletes the lofted plate with this instance identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the lofted plate into the model database. All the attributes must be set and there must be at minimum 2 base curves.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the lofted plate object values in the database.
 (Overrides ModelObject.Modify().)
Select
 Selects a lofted plate object from the database.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
    private static List<ICurve> GetPlateBaseGeometries()
    {
        var bottomArc = new Arc(new Point(0, 0, 0), new Point(1000, 0, 0), new Vector(0, 0, 1), Math.PI);
        var topArc = new Arc(new Point(0, 0, 10000), new Point(1000, 0, 10000), new Vector(0, 0, 1), Math.PI);
        return new List<ICurve> { bottomArc, topArc };
    }
    public static void Example1()
    {
        var baseCurves = GetPlateBaseGeometries();
        var loftedPlate = new LoftedPlate
        {
            BaseCurves = baseCurves,
            Finish = "FOO"
        };
        loftedPlate.Profile.ProfileString = "PL10";
        loftedPlate.Material.MaterialString = "Steel_Undefined";
        loftedPlate.Insert();
        new Model().CommitChanges();
    }
}
See Also
Reference
Tekla.Structures.Model Namespace