Tekla Open API Reference for Tekla Structures 2025
Text Class
 The Text class defines a drawing object that can hold a text string and is shown in a drawing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.Text
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Text : DrawingObject, IAxisAlignedBoundingBox,
	IObjectAlignedBoundingBox, IMovableRelative, IPlacing, IHasChildren, IHideable
<SerializableAttribute>
Public NotInheritable Class Text
	Inherits DrawingObject
	Implements IAxisAlignedBoundingBox, IObjectAlignedBoundingBox, IMovableRelative, IPlacing,
	IHasChildren, IHideable
The Text type exposes the following members.
Constructors
Name | Description
Text(ViewBase, Point, String)
 Creates a new text instance with the given text string.
Text(ViewBase, Point, String, PlacingBase)
 Creates a new text instance with the given text string using a specific placing type.
Text(ViewBase, Point, String, Text.TextAttributes)
 Creates a new text instance with the given text string and text attributes.
Text(ViewBase, Point, String, PlacingBase, Text.TextAttributes)
 Creates a new text instance with the given text string and text attributes using a specific placing type.
Top
Properties
Name | Description
Attributes
 The attributes for the text.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
InsertionPoint
 The insertion point of the text.
Placing
 The current placing of the object. See the placing types for different placing options.
TextString
 The contents of the text.
Top
Methods
Name | Description
Delete
 Deletes the text from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Returns the axis aligned bounding box of the text (rectangle format).
GetObjectAlignedBoundingBox
 Returns the object aligned bounding box of the text (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
Insert
 Inserts the text into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the text in the current drawing database.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object using the move vector.
Select
 Selects the text from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace