Tekla Open API Reference for Tekla Structures 2025
PickerInputPoint Class
 The PickerInputPoint class represents a pick of one point in a view. Used for values asked by UI.Picker.PickPoint(string Prompt, out Point PickedPoint, out ViewBase PickedView).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputWithinAView
 Tekla.Structures.Drawing.PickerInputPointsWithinAView
 Tekla.Structures.Drawing.PickerInputPoint
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PickerInputPoint : PickerInputPointsWithinAView
Public Class PickerInputPoint
	Inherits PickerInputPointsWithinAView
The PickerInputPoint type exposes the following members.
Constructors
Name | Description
PickerInputPoint
 Creates a new PickerInputPoint instance with one point selected in a view.
Top
Properties
Name | Description
PickedPoint
 The picked point in the view coordinates.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PickerInputPointsWithinAView.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace