Tekla Open API Reference for Tekla Structures 2025
PourUnitFilterExpressions.Guid Class
 The Guid class represents the GUID filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.PourUnitFilterExpressions.Guid
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Guid : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Guid
	Inherits StringFilterExpression
The PourUnitFilterExpressions.Guid type exposes the following members.
Constructors
Name | Description
PourUnitFilterExpressions.Guid
 Initializes a new instance of the Guid class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace