Tekla Open API Reference for Tekla Structures 2025
Weld Properties
The Weld type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the weld. For more information see Weld.WeldAttributes.
Top
See Also
Reference
Weld Class
Tekla.Structures.Drawing Namespace