Tekla Open API Reference for Tekla Structures 2025
SinglePartDrawing Class
 The SinglePartDrawing class is for handling single part drawings.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.Drawing
 Tekla.Structures.Drawing.SinglePartDrawing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SinglePartDrawing : Drawing
<SerializableAttribute>
Public NotInheritable Class SinglePartDrawing
	Inherits Drawing
The SinglePartDrawing type exposes the following members.
Constructors
Name | Description
SinglePartDrawing(Identifier)
 Instantiates a new single part drawing with standard attributes.
SinglePartDrawing(Identifier, Int32)
 Instantiates a new single part drawing with standard attributes and with a specified sheet number.
SinglePartDrawing(Identifier, String)
 Instantiates a new single part drawing with given attributes.
SinglePartDrawing(Identifier, Int32, String)
 Instantiates a new single part drawing with standard attributes and with a specified sheet number.
Top
Properties
Name | Description
PartIdentifier
 The identifier of the model object part.
SheetNumber
 The sheet number of the drawing.
Top
Methods
Name | Description
Insert
 Inserts a new single part drawing. Views are added according to the View Creation rules of the standard file. A drawing can be inserted only when there is no active drawing.
 (Overrides DatabaseObject.Insert().)
Modify
 Updates the drawing object in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace