Tekla Open API Reference for Tekla Structures 2025
LoftedPlate Properties
The LoftedPlate type exposes the following members.
Properties
Name | Description
BaseCurves
 The curves that define the directrix lines of the lofted plate. A lofted plate is defined by at least to base curves (non empty if they are Polycurve(s)).
FaceType
 Gets or sets what type of solid faces will be used to create lofted plate solid.
Top
See Also
Reference
LoftedPlate Class
Tekla.Structures.Model Namespace