Tekla Open API Reference for Tekla Structures 2025
RebarMesh Class
 The RebarMesh class represents a reinforcement mesh.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Reinforcement
 Tekla.Structures.Model.RebarMesh
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RebarMesh : Reinforcement
<SerializableAttribute>
Public NotInheritable Class RebarMesh
	Inherits Reinforcement
The RebarMesh type exposes the following members.
Constructors
Name | Description
RebarMesh
 Initializes a new mesh instance with empty attributes.
Top
Properties
Name | Description
CatalogName
 The name of the rebar mesh catalog.
CrossBarLocation
 Defines the location of the crossing bars.
CrossDistances
 The crossing spacing double value(s).
CrossSize
 The size of the crossing rebar.
CutByFatherPartCuts
 Defines whether the rebar mesh is cut by father part cuts or not.
EndFromPlaneOffset
 The end offset value from the part surface.
EndHook
 The hook at the end of the reinforcing.
EndPoint
 The end point of the direction in which the longitudinal bars are distributed.
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
FromPlaneOffset
 The offset value from the part surface applied in both sides.
 (Overrides Reinforcement.FromPlaneOffset.)
LeftOverhangCross
 The overhang of the crossing part's left side.
LeftOverhangLongitudinal
 The overhang of the longitudinal bar's left side.
Length
 The length of the rectangle rebar mesh.
LongitudinalDistances
 The longitudinal spacing double value(s).
LongitudinalSize
 The size of the longitudinal rebar.
LongitudinalSpacingMethod
 The type of spacing between rebar mesh bars. Used both for longitudinal and crossing bars. The options are (RebarMesh.RebarMeshSpacingMethodEnum.):
SPACING_TYPE_SAME_DISTANCE
SPACING_TYPE_MULTIPLE_VARYING_DISTANCES
MeshType
 The type of the reinforcement mesh. The options are:
RECTANGULAR_MESH
POLYGON_MESH
BENT_MESH
Polygon
 The polygon of the mesh.
RightOverhangCross
 The right overhang of the crossing bar.
RightOverhangLongitudinal
 The right overhang of the longitudinal bar.
StartFromPlaneOffset
 The start offset value from the part surface.
StartHook
 The hook at the beginning of the reinforcing.
StartPoint
 The start point of the direction in which the longitudinal bars are distributed.
Width
 The width of the rectangle rebar mesh.
Top
Methods
Name | Description
Delete
 Deletes the reinforcement mesh instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the reinforcement mesh into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing reinforcement mesh in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a reinforcement mesh from the model database. The reinforcement identifier must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           ContourPlate CP = new ContourPlate();
           RebarMesh RebarMesh = new RebarMesh();
           RebarMesh.MeshType = Tekla.Structures.Model.RebarMesh.RebarMeshTypeEnum.RECTANGULAR_MESH;
           RebarMesh.Father = CP;
           RebarMesh.StartPoint = new Point(3000, 0, 0);
           RebarMesh.EndPoint = new Point(5000, 0, 0);
           RebarMesh.CatalogName = "MyCatalog";
           RebarMesh.LongitudinalSize = "6";
           RebarMesh.CrossSize = "6";
           RebarMesh.LeftOverhangCross = 20;
           RebarMesh.LeftOverhangLongitudinal = 40;
           RebarMesh.RightOverhangCross = 20;
           RebarMesh.RightOverhangLongitudinal = 40;
           RebarMesh.LongitudinalSpacingMethod = RebarMesh.RebarMeshSpacingMethodEnum.SPACING_TYPE_SAME_DISTANCE;
           RebarMesh.LongitudinalDistances.Add(50.0);
           RebarMesh.CrossDistances.Add(20.0);
           RebarMesh.Name = "Mesh Test";
           RebarMesh.Class = 7;
           RebarMesh.NumberingSeries.StartNumber = 0;
           RebarMesh.NumberingSeries.Prefix = "Mesh";
           RebarMesh.Grade = "B500K";
           RebarMesh.OnPlaneOffsets.Add(10.0);
           RebarMesh.FromPlaneOffset = -50;
           RebarMesh.StartPointOffsetType = Reinforcement.RebarOffsetTypeEnum.OFFSET_TYPE_COVER_THICKNESS;
           RebarMesh.StartPointOffsetValue = 10;
           RebarMesh.CutByFatherPartCuts = false;
           RebarMesh.CrossBarLocation = Tekla.Structures.Model.RebarMesh.RebarMeshCrossBarLocationEnum.LOCATION_TYPE_ABOVE;
           RebarMesh.Length = 1500;
           RebarMesh.Width = 3500;
           RebarMesh.Insert();
           RebarMesh.Grade = "B600KX";
           RebarMesh.LongitudinalSize = "8";
           RebarMesh.RightOverhangLongitudinal = 75;
           RebarMesh.Length = 1800;
           RebarMesh.Width = 3800;
           RebarMesh.Modify();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace