Tekla Open API Reference for Tekla Structures 2025
PourObject Class
 The PourObject class contains methods related to pours. A pour is a drawing object derived from a model object. It represents a drawing pour that has a reference to the actual pour in the model database.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.PourObject
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PourObject : ModelObject
<SerializableAttribute>
Public NotInheritable Class PourObject
	Inherits ModelObject
The PourObject type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the pour. For more information see PourObject.PourAttributes.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace