Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementStrandAttributes Class
 The ReinforcementStrandAttributes class is the base attributes class for ReinforcementStrand.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReinforcementStrandAttributes : ReinforcementBase.ReinforcementBaseAttributes
<SerializableAttribute>
Public NotInheritable Class ReinforcementStrandAttributes
	Inherits ReinforcementBase.ReinforcementBaseAttributes
The ReinforcementBase.ReinforcementStrandAttributes type exposes the following members.
Constructors
Name | Description
ReinforcementBase.ReinforcementStrandAttributes()
 Creates a new default reinforcement attributes instance that loads standard attributes.
ReinforcementBase.ReinforcementStrandAttributes(Boolean)
 Creates a new default reinforcement attributes instance that loads standard attributes. If it set to true attributes won't be lodaded.
ReinforcementBase.ReinforcementStrandAttributes(String)
 Creates a new reinforcement attributes instance that loads the specified attributes.
Top
Properties
Name | Description
HookedEndSymbolType
 Defines how the hooked ends of reinforcing bars should look like.
ReinforcementVisibility
 Defines which bars in the group appear in drawings.
StraightEndSymbolType
 Defines how the straight ends of reinforcing bars should look like.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ReinforcementBase.ReinforcementBaseAttributes.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace