Tekla Open API Reference for Tekla Structures 2025
ControlPoint Methods
The ControlPoint type exposes the following members.
Methods
Name | Description
Delete
 Deletes the control point with the given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control point into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control point with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the control point with the given Identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
ControlPoint Class
Tekla.Structures.Model Namespace