Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementSetGroupAttributes Class
 The ReinforcementSetGroupAttributes class is the base attributes class for ReinforcementSetGroup.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReinforcementSetGroupAttributes : ReinforcementBase.ReinforcementBaseAttributes
<SerializableAttribute>
Public NotInheritable Class ReinforcementSetGroupAttributes
	Inherits ReinforcementBase.ReinforcementBaseAttributes
The ReinforcementBase.ReinforcementSetGroupAttributes type exposes the following members.
Constructors
Name | Description
ReinforcementBase.ReinforcementSetGroupAttributes()
 Initializes a new instance of the ReinforcementBase.ReinforcementSetGroupAttributes class.
ReinforcementBase.ReinforcementSetGroupAttributes(String)
 Initializes a new instance of the ReinforcementBase.ReinforcementSetGroupAttributes class that loads the specified attributes.
Top
Properties
Name | Description
HookedEndSymbolType
 Gets or sets how the hooked ends of reinforcing bars should look like.
ReinforcementVisibility
 Gets or sets which bars in the group appear in drawings.
StraightEndSymbolType
 Gets or sets how the straight ends of reinforcing bars should look like.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ReinforcementBase.ReinforcementBaseAttributes.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace