Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedNodeLoad Properties
The AnalysisDecomposedNodeLoad type exposes the following members.
Properties
Name | Description
F
 Gets or sets the force of the analysis decomposed node load.
M
 Gets or sets the moment of the analysis decomposed node load.
Top
See Also
Reference
AnalysisDecomposedNodeLoad Class
Tekla.Structures.Analysis Namespace