Tekla Open API Reference for Tekla Structures 2025
AnalysisModelConnectivityRule Properties
The AnalysisModelConnectivityRule type exposes the following members.
Properties
Name | Description
Group1
 The group name 1 of the connectivity rule.
Group2
 The group name 2 of the connectivity rule.
Linkage1
 The linkage 1 of the connectivity rule.
Linkage2
 The linkage 2 of the connectivity rule.
MagneticDistance
 The magnetic distance of the connectivity rule.
Status
 The status of the connectivity rule.
Top
See Also
Reference
AnalysisModelConnectivityRule Class
Tekla.Structures.Analysis Namespace