Tekla Open API Reference for Tekla Structures 2025
AngleDimension Properties
The AngleDimension type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the angle dimension attributes.
Distance
 Gets or sets the distance (from the origin to the second point's direction). The distance is measured in paper millimeters.
Origin
 Gets or sets the origin of the dimension.
Point1
 Gets or sets the first point.
Point2
 Gets or sets the second point.
Top
See Also
Reference
AngleDimension Class
Tekla.Structures.Drawing Namespace