Tekla Open API Reference for Tekla Structures 2025
BentPlate Class
 A class for the bent plate
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Part
 Tekla.Structures.Model.BentPlate
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BentPlate : Part
<SerializableAttribute>
Public NotInheritable Class BentPlate
	Inherits Part
The BentPlate type exposes the following members.
Constructors
Name | Description
BentPlate
 Initializes a new instance of the BentPlate class.
Top
Properties
Name | Description
Geometry
 Gets or sets the geometry of the bent plate.
Thickness
 Gets thickness of the bent plate.
Top
Methods
Name | Description
Delete
 Deletes the bent plate with this instance identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the bent plate into the model database. All the attributes must be set and geometry should have at least one bend.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the bent plate object values in the database.
 (Overrides ModelObject.Modify().)
Select
 Selects a bent plate object from the database.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
           private ContourPlate CreateContourPlate(Point point1, Point point2, Point point3)
           {
               ContourPoint contourPoint1 =  new ContourPoint(point1, null);
               ContourPoint contourPoint2 = new ContourPoint(point2, null);
               ContourPoint contourPoint3 = new ContourPoint(point3, null);
               ContourPlate CP = new ContourPlate();
               CP.AddContourPoint(contourPoint1);
               CP.AddContourPoint(contourPoint2);
               CP.AddContourPoint(contourPoint3);
               CP.Finish = "FOO";
               CP.Profile.ProfileString = "PL200";
               CP.Material.MaterialString = "Steel_Undefined";
               CP.Insert();
               return CP;
           }
           public void Example1()
           {
               Point point1 = new Point(0, 4000, 1000);
               Point point2 = new Point(2000, 4000, 1000);
               Point point3 = new Point(0, 6000, 3000);
               Point point4 = new Point(0, 0, 0);
               Point point5 = new Point(0, 2000, 0);
               Point point6 = new Point(2000, 2000, 0);
               Part contourPlate1 = CreateContourPlate(point1, point2, point3);
               Part contourPlate2 = CreateContourPlate(point4, point5, point6);
               BentPlate bentPlate = Operations.Operation.CreateBentPlateByParts(contourPlate1, contourPlate2);
           }
}
See Also
Reference
Tekla.Structures.Model Namespace