Tekla Open API Reference for Tekla Structures 2025
ReferenceModel Methods
The ReferenceModel type exposes the following members.
Methods
Name | Description
Delete
 Reference model objects cannot be deleted.
 (Overrides DatabaseObject.Delete().)
Insert
 Reference model objects cannot be inserted.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the reference model object.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the reference model object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
ReferenceModel Class
Tekla.Structures.Drawing Namespace