Tekla Open API Reference for Tekla Structures 2025
SpiralBeam Methods
The SpiralBeam type exposes the following members.
Methods
Name | Description
Delete
 Deletes the spiral beam with this instance identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the spiral beam into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the spiral beam object values in the database.
 (Overrides ModelObject.Modify().)
Select
 Selects a spiral beam object from the database.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace