Tekla Open API Reference for Tekla Structures 2025
ModelObject Class
 The ModelObject class is an abstract base class for all model objects, such as parts, bolts, welds and reinforcements.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 More...
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ModelObject : Object,
	IComparable, IEquatable<ModelObject>
<SerializableAttribute>
Public MustInherit Class ModelObject
	Inherits Object
	Implements IComparable, IEquatable(Of ModelObject)
The ModelObject type exposes the following members.
Properties
Name | Description
IsUpToDate
Gets if the object does not have a modification which is not shared.
ModificationTime
Gets latest time of the object was modified or created.
Top
Methods
Name | Description
CompareTo
 Compares Identifiers of model objects.
Delete
 Deletes the instance from the model database.
Equals
 Check if Identifiers of model objects are same.
GetAllReportProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
GetAllUserProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
GetChildren
 Returns an enumerator of all the children model objects.
GetCoordinateSystem
 Returns the coordinate system for the given model object.
GetCustomObjectType
 Gets custom object type name from an existing object.
GetDoubleReportProperties
 Retrieves multiple double report properties for the model object. It is faster to fetch multiple properties at once.
GetDoubleUserProperties
 Retrieves all double properties for the model object.
GetDynamicStringProperty
 Gets a dynamic string property from the model object.
GetFatherComponent
 Returns the father component of the model object.
GetHierarchicObjects
 Returns an enumerator of all the connected hierarchic objects.
GetIntegerReportProperties
 Retrieves multiple integer report properties for the model object. It is faster to fetch multiple properties at once.
GetIntegerUserProperties
 Retrieves all integer properties for the model object.
GetPhase
 Retrieves the phase of the model object (the phase number, the phase name, the phase comment and whether the phase is the current one or not).
GetReportProperty(String, Double)
 Retrieves a double property of the report for the model object.
GetReportProperty(String, Int32)
 Retrieves an integer property of the report for the model object.
GetReportProperty(String, String)
 Retrieves a string property of the report for the model object.
GetStringReportProperties
 Retrieves multiple string report properties for the model object. It is faster to fetch multiple properties at once.
GetStringUserProperties
 Retrieves all string properties for the model object.
GetUserProperty(String, Double)
 Retrieves a double property for the model object.
GetUserProperty(String, Int32)
 Retrieves an integer property for the model object.
GetUserProperty(String, String)
 Retrieves a string property for the model object.
Insert
 Inserts the model object instance into the model database.
Modify
 Modifies the model instance in the model database.
Select
 Selects the model object instance from the model database.
SetCustomObjectType
 Sets a custom object type name for an existing object.
SetDynamicStringProperty
 Sets a dynamic string property for the model object.
SetLabel
 Sets a label for an object when a new instance is created, this method must be called before Insert. The label is used in plug-ins for identifying the changed object in modification.
SetPhase
 Sets the phase of the model object.
SetUserProperties
 Sets multiple properties for the model object.
SetUserProperty(String, Double)
 Sets a double property for the model object.
SetUserProperty(String, Int32)
 Sets an integer property for the model object.
SetUserProperty(String, String)
 Sets a string property for the model object.
Top
Remarks
 One way to find out the correct names of the report properties is to open the Template Editor. With the Template Editor you can see the listing of all the properties that can be added to report templates.
Examples
 In the following example a connection to the Tekla Structures model has already been established and next the values of some user-defined attributes (UDAs) are going to be found out. The UDAs asked are the string value of CHECKED_BY, the double value of CHECKED_DATE, and the integer value of OBJECT_LOCKED.
using Tekla.Structures.Model;
using System;
using System.Windows.Forms;
public class Example
{
       public void Example1()
       {
           Model Model = new Model();
           ModelObjectEnumerator ObjectEnum = Model.GetModelObjectSelector().GetAllObjects();
           ObjectEnum.SelectInstances = false; // Set the "SelectInstances" to false to speed up the enquiry; possible because only report properties are asked.
           string Result = "CHECKED BY, CHECKED DATE, OBJECT LOCKED \n";
           while(ObjectEnum.MoveNext())
           {
               if(ObjectEnum.Current != null)
               {
                   Beam BeamObject = ObjectEnum.Current as Beam;
                   if(BeamObject != null)
                   {
                       string CheckedBy = "";
                       double DateCheckedValue = 0.0;
                       int LockedStatus = -1;
                       DateTime DateChecked = new System.DateTime(1970, 1, 1);
                       BeamObject.GetUserProperty("CHECKED_BY", ref CheckedBy);
                       BeamObject.GetUserProperty("CHECKED_DATE", ref DateCheckedValue);
                       BeamObject.GetUserProperty("OBJECT_LOCKED", ref LockedStatus);
                       if(CheckedBy.Length > 0 || DateCheckedValue > 0.0
                           LockedStatus != -1)
                       DateChecked = DateChecked.AddSeconds(DateCheckedValue);
                       Result += CheckedBy;
                       Result += ", ";
                       Result += DateChecked.ToString("dd.MM.yyyy");
                       if(LockedStatus == 1)
                       {
                           Result += ", Locked\n";
                       }
                       else
                       {
                           Result += ", Not locked\n";
                       }
                   }
               }
           }
           MessageBox.Show(Result);
       }
}
See Also
Reference
Tekla.Structures.Model Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Assembly
 Tekla.Structures.Model.BaseComponent
 Tekla.Structures.Model.BaseRebarModifier
 Tekla.Structures.Model.BaseWeld
 Tekla.Structures.Model.BoltGroup
 Tekla.Structures.Model.Boolean
 Tekla.Structures.Model.ControlArc
 Tekla.Structures.Model.ControlCircle
 Tekla.Structures.Model.ControlLine
 Tekla.Structures.Model.ControlPlane
 Tekla.Structures.Model.ControlPoint
 Tekla.Structures.Model.ControlPolycurve
 Tekla.Structures.Model.GridBase
 Tekla.Structures.Model.GridSurface
 Tekla.Structures.Model.HierarchicDefinition
 Tekla.Structures.Model.HierarchicObject
 Tekla.Structures.Model.Load
 Tekla.Structures.Model.LoadGroup
 Tekla.Structures.Model.Part
 Tekla.Structures.Model.PourBreak
 Tekla.Structures.Model.PourObject
 Tekla.Structures.Model.PourUnit
 Tekla.Structures.Model.RebarSet
 Tekla.Structures.Model.RebarSetAddition
 Tekla.Structures.Model.RebarSplice
 Tekla.Structures.Model.ReferenceModel
 Tekla.Structures.Model.ReferenceModelObject
 Tekla.Structures.Model.Reinforcement
 Tekla.Structures.Model.SurfaceObject
 Tekla.Structures.Model.SurfaceTreatment
 Tekla.Structures.Model.Task
 Tekla.Structures.Model.TaskDependency
 Tekla.Structures.Model.TaskWorktype