Tekla Open API Reference for Tekla Structures 2025
RebarEndDetailModifier Class
 The RebarEndDetailModifier class represents a modifier that can modify the characteristics of RebarSet reinforcing bars that pass through it. It can modify reinforcing bar end properties and will therefore affect the end of the reinforcing bars it is nearest to.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseRebarModifier
 Tekla.Structures.Model.RebarEndDetailModifier
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarEndDetailModifier : BaseRebarModifier
<SerializableAttribute>
Public Class RebarEndDetailModifier
	Inherits BaseRebarModifier
The RebarEndDetailModifier type exposes the following members.
Constructors
Name | Description
RebarEndDetailModifier
 Initializes a new instance of the RebarEndDetailModifier class.
Top
Properties
Name | Description
EndType
 Gets or sets the end type.
RebarCranking
 Gets or sets the rebar cranking.
RebarHook
 Gets or sets the reinforcing bar hook data.
RebarLengthAdjustment
 Gets or sets the reinforcing bar length adjustment data.
RebarThreading
 Gets or sets the reinforcing bar threading data.
Top
Methods
Name | Description
GetAffectedBars
 Gets the virtual bars affected by this modifier.
Top
Examples
 The following example shows how to create and add a RebarEndDetailModifier, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
            // Create and insert a rebarset (see the RebarSet example).
            var rebarSet = new RebarSet();
            // Create the RebarEndDetailModifier.
            var strip = new RebarEndDetailModifier();
            strip.Father = rebarSet;
            strip.EndType = RebarEndDetailModifier.EndTypeEnum.HOOK;
            strip.RebarHook.Shape = RebarHookData.RebarHookShapeEnum.HOOK_90_DEGREES;
            strip.RebarThreading.ThreadingType = "ThreadingType1";
            strip.RebarThreading.Length = 100;
            strip.RebarThreading.ExtraFabricationLength = 50;
            strip.Curve.AddContourPoint(new ContourPoint(new Point(0, 200, 500), null));
            strip.Curve.AddContourPoint(new ContourPoint(new Point(0,1000, 500), null));
            strip.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace