Tekla Open API Reference for Tekla Structures 2025
Assembly Methods
The Assembly type exposes the following members.
Methods
Name | Description
Add(ArrayList)
 Adds an array list of given assemblable instances to the assembly. For assemblies use Add(Assembly Assembly). Notice that adding other than assembly instances will actually assume that you are adding objects to a cast unit assembly.
Add(Assembly)
 Adds a new subassembly for the assembly instance.
Add(IAssemblable)
 Adds the given assemblable instance to the assembly. Notice that adding other than assembly instances will assume that you are adding objects to a cast unit assembly.
CompareTo(Assembly)
 Compares the instantiated assembly with another one.
Delete
 Explodes the assembly instance.
 (Overrides ModelObject.Delete().)
DeleteUserDefinedCoordSys
 Deletes the assembly's user defined coordinate system, if it has one.
GetAssembly
 Returns the assembly instance the assembly belongs to (null if none).
GetAssemblyType
 Returns the type of the assembly.
GetFatherPour
 Returns the pour that the assembly is directly associated to.
GetFatherPourUnit
 Returns the pour unit that the bolt group is associated to.
GetMainObject
 Selects and returns the main object of the assembly or null if none.
GetMainPart
 Selects and returns the main part of the assembly or null if none.
GetSecondaries
 Selects and returns all the secondary assemblables belonging to the assembly. The method replaces the old GetObjects() method. Notice that the number of secondaries is limited to 2048.
GetSubAssemblies
 Selects and returns a list of subassemblies belonging to the assembly.
HasUserDefinedCoordSys
 Returns whether the assembly has a user defined coordinate system.
Insert
 Inserts the Assembly instance in the model. At the moment only rebar assemblies can be inserted. The main object of the assembly must be a Reinforcement or RebarSet. If the main rebar is not set (null), the main rebar will be automatically set to the secondary rebar with the biggest weight.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the assembly instance in the model.
 (Overrides ModelObject.Modify().)
Remove
 Removes the given instance from the assembly. Before removing steel parts from an assembly all connecting workshop welds and bolts must be deleted.
Select
 Selects the assembly instance from the model. The identifier of the instance must be set.
 (Overrides ModelObject.Select().)
SetMainObject
 Sets the main object of the assembly.
SetMainPart
 Sets the main part of the assembly.
SetUserDefinedCoordSys
 Set user defined assembly coordinate system. If set, GetCoordinateSystem will return this value.
Top
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace