Tekla Open API Reference for Tekla Structures 2025
PluginWindowBase Class
 The PluginWindowBase class is the base class for plug-in WPF dialogs. The class extends the WindowBase class by adding communications with Tekla Structures.
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Window
 Tekla.Structures.Dialog.WindowBase
 Tekla.Structures.Dialog.PluginWindowBase
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PluginWindowBase : WindowBase,
	IDisposable
Public Class PluginWindowBase
	Inherits WindowBase
	Implements IDisposable
The PluginWindowBase type exposes the following members.
Constructors
Name | Description
PluginWindowBase
 Runs the WindowBase constructor and loads the default .NET localization file (DotNetDialogStrings.ail). Datastorage is built based on given viewmodel object
Top
Properties
Name | Description
ShowInTaskbar
 Hides (shadows) the ShowInTaskbar property by setting the property to false.
Top
Methods
Name | Description
Dispose
 Cleans up any resources being used.
Get
 Gets the dialog values from the part that is currently selected in Tekla Structures.
ReloadWindow
 Reloads the dialog values.
Top
Events
Name | Description
AttributesLoadedFromModel
 The AttributesLoadedFromModel event is triggered just after the attributes have been loaded from the model into the dialog.
Top
See Also
Reference
Tekla.Structures.Dialog Namespace