Tekla Open API Reference for Tekla Structures 2025
RadiusDimension Methods
The RadiusDimension type exposes the following members.
Methods
Name | Description
Delete
 Deletes the dimension from the database.
 (Overrides DatabaseObject.Delete().)
GetDimensionSet()
 Radius dimensions don't have dimension sets.
 (Overrides DimensionBase.GetDimensionSet().)
GetDimensionSet(Boolean)
 Radius dimensions don't have dimension sets.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Insert
 Inserts the dimension into the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the existing dimension in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the radius dimension from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
RadiusDimension Class
Tekla.Structures.Drawing Namespace