Tekla Open API Reference for Tekla Structures 2025
Mark Properties
The Mark type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the mark attributes.
Top
See Also
Reference
Mark Class
Tekla.Structures.Drawing Namespace