Tekla Open API Reference for Tekla Structures 2025
Part Class
 The Part class represents a part in the model. A part can be either a beam, a polybeam or a contour plate.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Part
 More...
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class Part : ModelObject,
	IAssemblable
<SerializableAttribute>
Public MustInherit Class Part
	Inherits ModelObject
	Implements IAssemblable
The Part type exposes the following members.
Constructors
Name | Description
Part
 Initializes a new instance of the Part class with default attributes.
The default values are set as follows:
Position = new Position();
Profile = new Profile();
Material = new Material();
DeformingData = new DeformingData();
Name = "";
Class = "";
Finish = "";
PartNumber = new NumberingSeries("P", 1);
AssemblyNumber = new NumberingSeries("A", 1);
CastUnitType = CastUnitTypeEnum.PRECAST;
Top
Properties
Name | Description
AssemblyNumber
 Gets or sets the assembly number. Defines the numbering in the assembly sense.
CastUnitType
 Gets or sets the cast unit type of the part.
Class
 Gets or sets the class of the part.
DeformingData
 Gets or sets the deforming data of the part.
Finish
 Gets or sets the finish of the part.
Material
 Gets or sets the material the part is made of.
Name
 Gets or sets the name of the part.
PartNumber
 Gets or sets the part number. Defines the numbering in the part sense.
Position
 Gets or sets the part position. Defines the way the part is positioned in the model.
PourPhase
 Gets or sets the pour phase of the part.
Profile
 Gets or sets the profile of the part.
Top
Methods
Name | Description
CompareTo(Part)
 Compares the instantiated part with another one.
GetAssembly
 Returns the assembly that the part belongs to.
GetBolts
 Returns an enumerator of all the connected bolts.
GetBooleans
 Returns an enumerator of all the connected boolean objects.
GetCenterLine
 Returns the center line for the given part.
GetComponents
 Returns an enumerator of all the connected components, connections, seams and details inherited from the base component.
GetDSTVCoordinateSystem
 Get DSTV coordinate system.
GetPartMark
 Returns the part mark.
GetPours
 Returns an enumerator of all the pours that the part belongs to.
GetReferenceLine
 Returns the reference line for the given part.
GetReinforcements
 Returns an enumerator of all the connected reinforcements.
GetSolid()
 Returns the solid of the part.
GetSolid(FormingStates)
 Returns the solid of the part.
GetSolid(Solid.SolidCreationTypeEnum)
 Returns the solid of the part.
GetSurfaceObjects
 Returns an enumerator of all the connected surface objects.
GetSurfaceTreatments
 Returns an enumerator of all the connected surface treatments.
GetWelds
 Returns an enumerator of all the connected welds.
Top
See Also
Reference
Tekla.Structures.Model Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Part
 Tekla.Structures.Model.Beam
 Tekla.Structures.Model.BentPlate
 Tekla.Structures.Model.Brep
 Tekla.Structures.Model.ContourPlate
 Tekla.Structures.Model.LoftedPlate
 Tekla.Structures.Model.PolyBeam
 Tekla.Structures.Model.SpiralBeam