Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionOrthogonal Class
 The CurvedDimensionOrthogonal class defines a curved dimension with orthogonal reference lines.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.CurvedDimensionBase
 Tekla.Structures.Drawing.CurvedDimensionOrthogonal
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedDimensionOrthogonal : CurvedDimensionBase
<SerializableAttribute>
Public NotInheritable Class CurvedDimensionOrthogonal
	Inherits CurvedDimensionBase
The CurvedDimensionOrthogonal type exposes the following members.
Constructors
Name | Description
CurvedDimensionOrthogonal(ViewBase, Point, Point, Point, Point, Point, Double)
 Creates a new curved dimension with orthogonal reference lines using default attributes.
CurvedDimensionOrthogonal(ViewBase, Point, Point, Point, Point, Point, Double, CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes)
 Creates a new curved dimension with orthogonal reference lines.
Top
Properties
Name | Description
Attributes
 Gets or sets the curved dimension set orthogonal attributes.
Top
Methods
Name | Description
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides CurvedDimensionBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace