Tekla Open API Reference for Tekla Structures 2025
InvalidFacePointsException Class
 The InvalidFacePointsException class represents an error when, cannot create geometry from requested face points.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.InvalidFacePointsException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class InvalidFacePointsException : ConnectiveGeometryException
<SerializableAttribute>
Public Class InvalidFacePointsException
	Inherits ConnectiveGeometryException
The InvalidFacePointsException type exposes the following members.
Constructors
Name | Description
InvalidFacePointsException
 Initializes a new instance of the InvalidFacePointsException class with "Cannot create geometry from requested face points" error message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace