Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_CircleHollowProfile Properties
The IFC2X3_ParametricObject_CircleHollowProfile type exposes the following members.
Properties
Name | Description
Radius
 The radius.
WallThickness
 The wall thickness.
Top
See Also
Reference
IFC2X3_ParametricObject_CircleHollowProfile Class
Tekla.Structures.Model.Collaboration Namespace