Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment Methods
The SurfaceTreatment type exposes the following members.
Methods
Name | Description
Delete
 Deletes the surface treatment with the given identifier from the database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the surface treatment to the database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the surface treatment with the given identifier in the database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the surface treatment with the given identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
SurfaceTreatment Class
Tekla.Structures.Model Namespace