Tekla Open API Reference for Tekla Structures 2025
Detail Methods
The Detail type exposes the following members.
Methods
Name | Description
Delete
 Deletes the detail instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetPrimaryObject
 Returns the primary object.
GetReferencePoint
 Returns the reference point.
Insert
 Inserts the detail into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing detail in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a detail from the model database. The detail ID must be set.
 (Overrides ModelObject.Select().)
SetPrimaryObject
 Sets the detail's primary object.
SetReferencePoint
 Sets the reference point; the point the user would pick for the detail to appear to.
Top
See Also
Reference
Detail Class
Tekla.Structures.Model Namespace