Tekla Open API Reference for Tekla Structures 2025
Vector Class
 The Vector class defines a direction and magnitude from the current origin.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.Point
 Tekla.Structures.Geometry3d.Vector
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class Vector : Point
<SerializableAttribute>
Public Class Vector
	Inherits Point
The Vector type exposes the following members.
Constructors
Name | Description
Vector()
 Instantiates a zero length vector.
Vector(Point)
 Instatiates a new vector with the given point.
Vector(Double, Double, Double)
 Instantiates a vector with the given coordinates.
Top
Methods
Name | Description
Cross(Vector)
 Returns a new cross product vector of the current vector and the given vector.
Cross(Vector, Vector)
 Returns a new cross product vector of the given two vectors.
Dot(Vector)
 Returns a dot product of the current vector and the given vector.
Dot(Vector, Vector)
 Returns a dot product of the given two vectors.
GetAngleBetween
 Gets the angle (in radians) between the current vector and the given vector.
GetLength
 Gets the length (magnitude) of a vector.
GetNormal
 Returns a new normalized equivalent of the current vector.
Normalize()
 Normalizes the vector using the length 1.0 (the length of a unit vector).
Normalize(Double)
 Normalizes the vector using the given length.
ToString
 Formats the 3D vector into a string with fixed decimals, in the following way: "(X, Y, Z)".
 (Overrides Point.ToString().)
Top
Operators
Name | Description
Multiply(Double, Vector)
 Calculates the multiplication of the given vector with the given scalar.
Multiply(Vector, Double)
 Calculates the multiplication of the given vector with the given scalar.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace