Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_LShapeProfile Properties
The IFC2X3_ParametricObject_LShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
EdgeRadius
 The edge radius.
FilletRadius
 The fillet radius.
LegSlope
 The leg slope.
Thickness
 The thickness.
Width
 The width.
Top
See Also
Reference
IFC2X3_ParametricObject_LShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace