Tekla Open API Reference for Tekla Structures 2025
LeaderLine Methods
The LeaderLine type exposes the following members.
Methods
Name | Description
Delete
 A leader line cannot be deleted.
 (Overrides DatabaseObject.Delete().)
Insert
 A leader line cannot be inserted.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the leader line in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the leader line from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
LeaderLine Class
Tekla.Structures.Drawing Namespace