Tekla Open API Reference for Tekla Structures 2025
ConstructionObjectFilterExpressions.Phase Class
 The Phase class represents the phase filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.ConstructionObjectFilterExpressions.Phase
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Phase : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class Phase
	Inherits NumericFilterExpression
The ConstructionObjectFilterExpressions.Phase type exposes the following members.
Constructors
Name | Description
ConstructionObjectFilterExpressions.Phase
 Initializes a new instance of the Phase class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace