Tekla Open API Reference for Tekla Structures 2025
PartFilterExpressions.PrimaryPart Class
 The PrimaryPart class represents the primary part filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.PrimaryPart
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PrimaryPart : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class PrimaryPart
	Inherits StringFilterExpression
The PartFilterExpressions.PrimaryPart type exposes the following members.
Constructors
Name | Description
PartFilterExpressions.PrimaryPart
 Initializes a new instance of the PrimaryPart class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace