Tekla Open API Reference for Tekla Structures 2025
LevelMark Properties
The LevelMark type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the level mark attributes.
BasePoint
 Gets or sets the level mark base point.
Hideable
 Gets the information if this object is hidden or not or if it should be.
InsertionPoint
 Gets or sets the level mark insertion point.
ModelObjectIdentifier
 Gets the model object identifier
Placing
 Gets or sets the current placing of the object. See the placing types for different placing options.
SubType
 Gets or sets the subtype of the level mark.
Top
See Also
Reference
LevelMark Class
Tekla.Structures.Drawing Namespace