Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_RectangleProfile Properties
The IFC2X3_ParametricObject_RectangleProfile type exposes the following members.
Properties
Name | Description
XDim
 The X dimension.
YDim
 The Y dimension.
Top
See Also
Reference
IFC2X3_ParametricObject_RectangleProfile Class
Tekla.Structures.Model.Collaboration Namespace