Tekla Open API Reference for Tekla Structures 2025
UndefinedCurveDirectionException Class
 The UndefinedCurveDirectionException class represents an error when, cannot make inward/outward curve check.
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.ConnectiveGeometryException
 Tekla.Structures.Model.UndefinedCurveDirectionException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class UndefinedCurveDirectionException : ConnectiveGeometryException
<SerializableAttribute>
Public Class UndefinedCurveDirectionException
	Inherits ConnectiveGeometryException
The UndefinedCurveDirectionException type exposes the following members.
Constructors
Name | Description
UndefinedCurveDirectionException
 Initializes a new instance of the UndefinedCurveDirectionException class with "Cannot make inward/outward curve check" error message.
Top
Fields
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace