Tekla Open API Reference for Tekla Structures 2025
BoltCircle Methods
The BoltCircle type exposes the following members.
Methods
Name | Description
Delete
 Deletes the bolt circle instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the bolt circle into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing bolt circle in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
 (Overrides ModelObject.Modify().)
Select
 Selects a bolt circle from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
BoltCircle Class
Tekla.Structures.Model Namespace