Tekla Open API Reference for Tekla Structures 2025
RectangleBoundingBox Methods
The RectangleBoundingBox type exposes the following members.
Methods
Name | Description
CreateRectangleBoundingBox
 Creates a new RectangleBoundingBox with the given values.
IsEqual
 Compares the current object with an object of the same type.
ToString
 Returns the rectangle bounding box values as a string.
 (Overrides Object.ToString().)
Top
See Also
Reference
RectangleBoundingBox Class
Tekla.Structures.Drawing Namespace