Tekla Open API Reference for Tekla Structures 2025
CurvedSectionMark Methods
The CurvedSectionMark type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides SectionMarkBase.IsEqual(Object).)
Top
See Also
Reference
CurvedSectionMark Class
Tekla.Structures.Drawing Namespace