Tekla Open API Reference for Tekla Structures 2025
LoadFilterExpressions.Group Class
 The Group class represents the group filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.LoadFilterExpressions.Group
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Group : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Group
	Inherits StringFilterExpression
The LoadFilterExpressions.Group type exposes the following members.
Constructors
Name | Description
LoadFilterExpressions.Group
 Initializes a new instance of the Group class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace