Tekla Open API Reference for Tekla Structures 2025
Cloud Properties
The Cloud type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the cloud.
Bulge
 The bulge (curve) to use for the cloud (a bulge is the ratio between the height and width of an object).
Points
 The list of points for the cloud. The points you insert will specify the corner points of the cloud. After you insert the object, you will get every cloud point back.
Top
See Also
Reference
Cloud Class
Tekla.Structures.Drawing Namespace