Tekla Open API Reference for Tekla Structures 2025
Grid Properties
The Grid type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the grid. For more information see Grid.GridAttributes.
Top
See Also
Reference
Grid Class
Tekla.Structures.Drawing Namespace