Tekla Open API Reference for Tekla Structures 2025
ControlCircle Methods
The ControlCircle type exposes the following members.
Methods
Name | Description
Delete
 Deletes the control circle with the given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control circle into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control circle with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the control circle with the given Identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
ControlCircle Class
Tekla.Structures.Model Namespace