Tekla Open API Reference for Tekla Structures 2025
ControlLine Methods
The ControlLine type exposes the following members.
Methods
Name | Description
Delete
 Deletes the control line with the given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control line into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control line with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the control line with the given Identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
ControlLine Class
Tekla.Structures.Model Namespace