Tekla Open API Reference for Tekla Structures 2025
DrawingObject Properties
The DrawingObject type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the current object. Only attributes of the same type as the object are allowed.
Top
See Also
Reference
DrawingObject Class
Tekla.Structures.Drawing Namespace