Tekla Open API Reference for Tekla Structures 2025
Text Methods
The Text type exposes the following members.
Methods
Name | Description
Delete
 Deletes the text from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Returns the axis aligned bounding box of the text (rectangle format).
GetObjectAlignedBoundingBox
 Returns the object aligned bounding box of the text (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
Insert
 Inserts the text into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the text in the current drawing database.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object using the move vector.
Select
 Selects the text from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Text Class
Tekla.Structures.Drawing Namespace