Tekla Open API Reference for Tekla Structures 2025
ApplicationWindowBase Class
 The ApplicationWindowBase class is the base class for all Tekla Structures WPF dialogs. The class provides localization, unit conversion and data storage (temporary and file-based) among other things.
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Window
 Tekla.Structures.Dialog.WindowBase
 Tekla.Structures.Dialog.ApplicationWindowBase
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class ApplicationWindowBase : WindowBase
Public Class ApplicationWindowBase
	Inherits WindowBase
The ApplicationWindowBase type exposes the following members.
Constructors
Name | Description
ApplicationWindowBase
 The default constructor that does not need parameters. Initializes the window, property binding can be initialized with InitializeDataStorage()-method.
Top
Properties
Name | Description
Top
Methods
Name | Description
InitializeDataStorage
 Initializes the datastorage and registers property bindings for defined viewmodel.
Top
See Also
Reference
Tekla.Structures.Dialog Namespace