Tekla Open API Reference for Tekla Structures 2025
Task Methods
The Task type exposes the following members.
Methods
Name | Description
AddObjectsToTask
 Adds objects to the task.
Delete
 Deletes the task instance from the model. The identifier must be set.
 (Overrides ModelObject.Delete().)
GetAllTasksOfSelectedObjects
 Returns an enumerator of all the tasks related to the selected objects.
GetDependencies
 Returns an enumerator of all the task dependency objects where the task is involved.
GetFathers
 Returns an enumerator of all the task type fathers for the task object.
Insert
 Inserts the task instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the task instance in the model. The identifier must be set.
 (Overrides ModelObject.Modify().)
RemoveObjectsFromTask
 Removes objects from the task.
Select
 Selects the task instance from the model. The identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Task Class
Tekla.Structures.Model Namespace