Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet Methods
The StraightDimensionSet type exposes the following members.
Methods
Name | Description
Delete
 Deletes the dimension set and its child dimensions from the database.
 (Overrides DatabaseObject.Delete().)
GetAllExcludePartsAccordingToFilter
 Retrieves all the possible valid filters for ExcludePartsAccordingToFilter.
Insert
 Dimension sets cannot be inserted into the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the existing dimension set in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the straight dimension set from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
StraightDimensionSet Class
Tekla.Structures.Drawing Namespace