Tekla Open API Reference for Tekla Structures 2025
AssemblyDrawing Class
 The AssemblyDrawing class is for handling assembly drawings.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.Drawing
 Tekla.Structures.Drawing.AssemblyDrawing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class AssemblyDrawing : Drawing
<SerializableAttribute>
Public NotInheritable Class AssemblyDrawing
	Inherits Drawing
The AssemblyDrawing type exposes the following members.
Constructors
Name | Description
AssemblyDrawing(Identifier)
 Instantiates a new assembly drawing with standard attributes.
AssemblyDrawing(Identifier, Int32)
 Instantiates a new assembly drawing with standard attributes and with a specified sheet number.
AssemblyDrawing(Identifier, String)
 Instantiates a new assembly drawing with given attributes.
AssemblyDrawing(Identifier, Int32, String)
 Instantiates a new assembly drawing with given attributes and with a specified sheet number.
Top
Properties
Name | Description
AssemblyIdentifier
 The identifier of the model object assembly.
SheetNumber
 The sheet number of the drawing.
Top
Methods
Name | Description
Insert
 Inserts a new assembly drawing. Views are added according to the View Creation rules of the standard file. A drawing can be inserted only when there is no active drawing.
 (Overrides DatabaseObject.Insert().)
Modify
 Updates the drawing object in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace