Tekla Open API Reference for Tekla Structures 2025
Cloud.CloudAttributes Class
 The CloudAttributes class is the attributes class for the cloud.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes
 Tekla.Structures.Drawing.Cloud.CloudAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CloudAttributes : ClosedGraphicObject.ClosedGraphicObjectAttributes
<SerializableAttribute>
Public NotInheritable Class CloudAttributes
	Inherits ClosedGraphicObject.ClosedGraphicObjectAttributes
The Cloud.CloudAttributes type exposes the following members.
Constructors
Name | Description
Cloud.CloudAttributes()
 Creates a new default cloud attributes instance that loads standard attributes.
Cloud.CloudAttributes(String)
 Creates a new cloud attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace