Tekla Open API Reference for Tekla Structures 2025
AnalysisModelLoad Class
 The AnalysisModelLoad class contains information related to the model loads that are included in the analysis model. The identifier is the identifier of the Tekla.Structures.Model object.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisModelLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisModelLoad : AnalysisObject
Public NotInheritable Class AnalysisModelLoad
	Inherits AnalysisObject
The AnalysisModelLoad type exposes the following members.
Constructors
Name | Description
AnalysisModelLoad
Initializes a new instance of the AnalysisModelLoad class
Top
Properties
Name | Description
Top
Methods
Name | Description
Select
 Selects an analysis node. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace