Tekla Open API Reference for Tekla Structures 2025
AnalysisNodeLink Properties
The AnalysisNodeLink type exposes the following members.
Properties
Name | Description
CoordinateSystem
 The coordinate system of the analysis node link.
Disabled
 Indicates whether the analysis node link is disabled.
EndConnectivity
 The end connectivity of the analysis node link.
EndNode
 The end node.
IsUserConnectivity
 Indicates whether the analysis node has a user defined connectivity.
IsUserNodeLink
 Indicates whether the analysis node is a user node link.
OwnerPartIDs
 The list of the identifiers of the owner parts.
StartConnectivity
 The start connectivity of the analysis node link.
StartNode
 The start node.
Top
See Also
Reference
AnalysisNodeLink Class
Tekla.Structures.Analysis Namespace