Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_UShapeProfile Properties
The IFC2X3_ParametricObject_UShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
EdgeRadius
 The edge radius.
FilletRadius
 The fillet radius.
FlangeSlope
 The flange slope.
FlangeThickness
 The flange thickness.
FlangeWidth
 The flange width.
WebThickness
 The web thickness.
Top
See Also
Reference
IFC2X3_ParametricObject_UShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace