Tekla Open API Reference for Tekla Structures 2025
BaseRebarGroup Properties
The BaseRebarGroup type exposes the following members.
Properties
Name | Description
EndFromPlaneOffset
 The end offset value from the part surface.
EndHook
 The hook at the end of the reinforcing bar.
EndPoint
 The end point of the direction in which the bars are distributed.
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
ExcludeType
 Defines which bars to omit from the group. The options are:
EXCLUDE_TYPE_NONE
EXCLUDE_TYPE_FIRST
EXCLUDE_TYPE_LAST
EXCLUDE_TYPE_BOTH
FromPlaneOffset
 The offset value from the part surface applied in both sides.
 (Overrides Reinforcement.FromPlaneOffset.)
Size
 The size of the reinforcement.
Spacings
 The spacing value(s). If the type of the spacing is SPACING_TYPE_EXACT_NUMBER Spacings has only one value that defines the number of the reinforcing bars.
SpacingType
 The type of spacing. The options are (BaseRebarGroup.RebarGroupSpacingTypeEnum.):
SPACING_TYPE_UNDEFINED
SPACING_TYPE_EXACT_SPACINGS
SPACING_TYPE_EXACT_NUMBER
SPACING_TYPE_TARGET_SPACE
SPACING_TYPE_EXACT_SPACE_FLEX_AT_START
SPACING_TYPE_EXACT_SPACE_FLEX_AT_END
SPACING_TYPE_EXACT_SPACE_FLEX_AT_BOTH
SPACING_TYPE_EXACT_SPACE_FLEX_AT_MIDDLE
StartFromPlaneOffset
 The start offset value from the part surface.
StartHook
 The hook at the beginning of the reinforcing bar.
StartPoint
 The start point of the direction in which the bars are distributed.
Top
See Also
Reference
BaseRebarGroup Class
Tekla.Structures.Model Namespace