Tekla Open API Reference for Tekla Structures 2025
ModelObjectHatchAttributes Properties
The ModelObjectHatchAttributes type exposes the following members.
Properties
Name | Description
AutomaticScaling
 Specifies whether automatic scaling is enabled. If disabled, custom scale values will be used (see ScaleX and ScaleY).
Top
See Also
Reference
ModelObjectHatchAttributes Class
Tekla.Structures.Drawing Namespace