Tekla Open API Reference for Tekla Structures 2025
LoadGroup Class
 The LoadGroup class implements grouping functionality related to all loads. Each load should be assigned to a load group. Each load group contains loads caused by the same action and to which you want to refer collectively.
 Tekla Structures assumes that all loads in a group
Have the same partial safety and other combination factors
Have the same action direction
Occur at the same time and all together
 You may create new load groups, modify existing ones and delete load groups via the .NET interface. You may also change the assigned load group of a load and list all the load groups found in the model via the ModelObjectSelector interface. The model always has at least one load group.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.LoadGroup
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LoadGroup : ModelObject
<SerializableAttribute>
Public NotInheritable Class LoadGroup
	Inherits ModelObject
The LoadGroup type exposes the following members.
Constructors
Name | Description
LoadGroup
 Creates a new load group instance.
Top
Properties
Name | Description
Color
 The load group color. This variable indicates the color with which all loads that belong to this same group are drawn in Tekla Structures views.
Compatible
 This variable is used to store information on which groups are compatible with each other in structural analysis load combination. Load combination is a process in which some simultaneously acting load groups are multiplied by their partial safety factors and combined with each other according to specific rules. To accurately combine loads which have the same load group type, you need to identify which load groups can occur at the same time, i.e. are compatible. This variable stores one integer, and all groups who have this same integer are known to be compatible with each other. Depending on the analysis needs, they may be calculated together, in smaller combinations, or separately.
Direction
 The load group direction.
GroupName
 The load group name. The maximum size is 126 characters.
GroupType
 The load group type.
Incompatible
 This variable is used to store information on which groups exclude each other in structural analysis load combination. Load combination is a process in which some simultaneously acting load groups are multiplied by their partial safety factors and combined with each other according to specific rules. To accurately combine loads which have the same load group type, you need to identify which load groups exclude each other, i.e. are incompatible. This variable stores one integer, and all groups who have this same integer are known to be incompatible with each other.
Top
Methods
Name | Description
Delete
 Deletes the load group instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the load group into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing load group in the model database to match the current one. At the moment it is not possible to change the load attachment or the father.
 (Overrides ModelObject.Modify().)
Select
 Selects a load group from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
 Creating a new load group:
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           LoadGroup WindLoads = new LoadGroup();
           WindLoads.GroupName = "ExtremeNorthWind";
           WindLoads.GroupType = LoadGroup.LoadGroupType.EUROCODE_WIND_LOAD;
           WindLoads.Direction = LoadGroup.LoadGroupDirection.DIR_Y;
           WindLoads.Compatible = 2;
           WindLoads.Incompatible = 15;
           WindLoads.Color = LoadGroup.Colors.RED;
           WindLoads.Insert();
       }
}
 Selecting and browsing through all load groups:
using Tekla.Structures.Model;
using System;
public class Example
{
       public void Example1()
       {
           Model Model = new Model();
           ModelObjectEnumerator LoadGroups =
               Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.LOAD_GROUP);
           foreach (LoadGroup group in LoadGroups)
           {
               Console.WriteLine("Group: " + group.GroupName + "(ID " + group.Identifier.ID + ")");
           }
       }
}
See Also
Reference
Tekla.Structures.Model Namespace