Tekla Open API Reference for Tekla Structures 2025
ReinforcementGroup Methods
The ReinforcementGroup type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
See Also
Reference
ReinforcementGroup Class
Tekla.Structures.Drawing Namespace