Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier Properties
The RebarPropertyModifier type exposes the following members.
Properties
Name | Description
AffectsWholeBarPlane
 Gets or sets a value indicating whether the modifier affects all bars in the plane or just those that it touches.
FatherPart
 Gets or sets the father part for all bars touching the property modifier.
GroupingType
 Gets or sets the grouping type.
RebarProperties
 Gets or sets the reinforcing bar properties.
SpacingOverride
 Gets or sets the spacing override.
Top
See Also
Reference
RebarPropertyModifier Class
Tekla.Structures.Model Namespace