Tekla Open API Reference for Tekla Structures 2025
CutPlane Properties
The CutPlane type exposes the following members.
Properties
Name | Description
Plane
 The plane that cuts the part.
Top
See Also
Reference
CutPlane Class
Tekla.Structures.Model Namespace