Tekla Open API Reference for Tekla Structures 2025
Reinforcement Class
 The Reinforcement class represents a reinforcement in the model. A reinforcement can either be a mesh, a single rebar, a rebar group or a strand.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Reinforcement
 Tekla.Structures.Model.BaseRebarGroup
 Tekla.Structures.Model.RebarMesh
 Tekla.Structures.Model.RebarStrand
 Tekla.Structures.Model.SingleRebar
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class Reinforcement : ModelObject,
	IAssemblable
<SerializableAttribute>
Public MustInherit Class Reinforcement
	Inherits ModelObject
	Implements IAssemblable
The Reinforcement type exposes the following members.
Properties
Name | Description
Class
 Gets or sets the class of the reinforcement. The class is used to group reinforcements.
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
OFFSET_TYPE_COVER_THICKNESS
EndPointOffsetValue
 Gets or sets the concrete cover thickness or leg length at the second end of the bar.
Father
 Gets or sets the father object of the reinforcement; the model object instance to operate on.
FromPlaneOffset
 Gets or sets the offset value from the part surface.
Grade
 Gets or sets the steel grade of the reinforcing bar. The grade indicates the strength of the steel used in reinforcing bars. It can also indicate other factors, such as the weldability or surface deformations of the bar.
InputPointDeformingState
 Gets or sets the reinforcement input point deforming state.
Name
 Gets or sets the name of the reinforcement.
NumberingSeries
 Gets or sets the numbering series of the reinforcement.
OnPlaneOffsets
 Gets or sets the double offset value for each leg on the same plane as the bar.
RadiusValues
 Gets or sets the radius value(s) of the bends in the bar.
StartPointOffsetType
 Gets or sets the type of the start point offset is either OFFSET_TYPE_LEG_LENGTH or OFFSET_TYPE_COVER_THICKNESS.
StartPointOffsetValue
 Gets or sets the concrete cover thickness or leg length at the first end of the bar.
Top
Methods
Name | Description
GetAssembly
 Returns the assembly that the reinforcement belongs to.
GetFatherPour
 Returns the pour that the rebar is associated to.
GetFatherPourUnit
 Returns the pour unit that the rebar is associated to.
GetNumberOfRebars
 Returns the number of rebars in the reinforcing group.
GetRebarComplexGeometries(Boolean, Boolean, Boolean)
 Retrieves a list of physical reinforcing bars (of type RebarComplexGeometry). These objects contain physical curves in the 3D space of each reinforcing bar as shown in model view. RebarComplexGeometry only differs from RebarGeometry by containing a polycurve rather than a polyline.
GetRebarComplexGeometries(Boolean, Boolean, Boolean, Reinforcement.RebarGeometrySimplificationTypeEnum)
 Retrieves a list of physical reinforcing bars (of type RebarComplexGeometry). These objects contain physical curves in the 3D space of each reinforcing bar as shown in model view. RebarComplexGeometry only differs from RebarGeometry by containing a polycurve (of Arc and LineSegment objects) rather than a polyline. The polycurve only contains arcs if the "simplified" parameter is RATIONALIZED or FABRICATION. If "simplified" is NONE, any arcs will be returned as a series of line segments.
GetRebarGeometries(Boolean)
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar.
GetRebarGeometries(Reinforcement.RebarGeometryOptionEnum)
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar.
GetRebarGeometriesWithoutClashes
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar as shown in model view. In case rebar polygon clashes with itself, physical points are moved to avoid clashing.
GetSingleRebar
 Returns a single rebar inside the rebar group located by the given index. The indexing starts from the start point. The rebar represents a physical reinforcing bar and contains physical points in the 3D space of the bar. The method returns null on error, for example if given an erroneous index. The number of rebars in the group can be requested with GetNumberOfRebars().
GetSingleRebarWithoutClash
 Returns a single rebar inside the rebar group located by the given index. The indexing starts from the start point. The rebar represents a physical reinforcing bar and contains physical, non-clashing points in the 3D space of the bar. The method returns null on error, for example if given an erroneous index. The number of rebars in the group can be requested with GetNumberOfRebars().
GetSolid
 Method for getting the solid information of the reinforcement.
IsGeometryValid
 Tells whether the geometry of a reinforcement object is valid or not.
Top
See Also
Reference
Tekla.Structures.Model Namespace