Tekla Open API Reference for Tekla Structures 2025
RebarSplitter Properties
The RebarSplitter type exposes the following members.
Properties
Name | Description
Cranking
 Gets or sets the rebar cranking.
Lapping
 Gets or sets the rebar lapping.
SplitOffset
 Gets or sets the offset of the split from the location of the rebar splitter.
SplitType
 Gets or sets the split type.
StaggerOffset
 Gets or sets the additional offset (stagger) of the split location for every other split reinforcing bar.
StaggerType
 Gets or sets the stagger type.
Top
See Also
Reference
RebarSplitter Class
Tekla.Structures.Model Namespace