Tekla Open API Reference for Tekla Structures 2025
TextFile.TextFileAttributes Class
 The TextFileAttributes class contains the attributes for the text file object.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.EmbeddedObjectAttributes
 Tekla.Structures.Drawing.TextFile.TextFileAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class TextFileAttributes : EmbeddedObjectAttributes
<SerializableAttribute>
Public NotInheritable Class TextFileAttributes
	Inherits EmbeddedObjectAttributes
The TextFile.TextFileAttributes type exposes the following members.
Constructors
Name | Description
TextFile.TextFileAttributes
 Creates a new text file attributes instance that loads standard attributes.
Top
Properties
Name | Description
Font
 Gets or sets the font.
Line
 Gets or sets the line type.
LineType |  Obsolete.
Scaling
 Gets or sets the scaling.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides EmbeddedObjectAttributes.IsEqual(Object).)
LoadAttributes
 Loads the specified attribute file.
 (Overrides EmbeddedObjectAttributes.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace