Tekla Open API Reference for Tekla Structures 2025
PourBreak Methods
The PourBreak type exposes the following members.
Methods
Name | Description
Delete
 Deletes the drawing pour break from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the drawing pour break.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing pour break from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
PourBreak Class
Tekla.Structures.Drawing Namespace