Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes Class
 The DimensionSetBaseAttributes class is the base class for all dimension set attributes. The class contains attributes that are common to all dimension sets.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes
 Tekla.Structures.Drawing.AngleDimensionAttributes
 Tekla.Structures.Drawing.CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes
 Tekla.Structures.Drawing.RadiusDimensionAttributes
 Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class DimensionSetBaseAttributes : AttributesBase
<SerializableAttribute>
Public MustInherit Class DimensionSetBaseAttributes
	Inherits AttributesBase
The DimensionSetBaseAttributes type exposes the following members.
Constructors
Name | Description
DimensionSetBaseAttributes()
 Creates a new default dimension set base attributes instance that loads standard attributes.
DimensionSetBaseAttributes(String)
 Creates a new dimension set base attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the dimension.
Color
 The color of the dimension line.
Format
 The format attributes of the dimension.
Placing
 The placing attributes of the dimension.
Text
 The text attributes of the dimension.
TransparentBackground
 The dimension text background transparency. (transparent/opaque)
TrueColor
 The true color (RGB enabled) of the dimension line.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace