Tekla Open API Reference for Tekla Structures 2025
HierarchicObject Class
 The HierarchicObject class defines an object in a tree-structured hierarchy. The hierarchy structure is defined by hierarchical definitions which the hierarchical objects instantiate. Hierarchical objects may contain other hierarchical objects, thus forming a sub-hierarchy, or model objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.HierarchicObject
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class HierarchicObject : ModelObject
<SerializableAttribute>
Public NotInheritable Class HierarchicObject
	Inherits ModelObject
The HierarchicObject type exposes the following members.
Constructors
Name | Description
HierarchicObject()
 Creates a new hierarchical object instance.
HierarchicObject(Identifier)
 Instantiates a hierarchical object with a known identifier. The instantiation has to be done before the hierarchical definition instance can be selected.
Top
Properties
Name | Description
Definition
 The hierarchical definition which the hierarchical object is associated with.
Father
 The father of the hierarchical object.
HierarchicChildren
 An array list that contains the hierarchical object's hierarchical children (of the type hierarchical object).
Name
 The name of the hierarchical object.
Top
Methods
Name | Description
AddObjects
 Associates model objects with the hierarchical object. Fails if the hierarchical definition doesn't exist in the model.
Delete
 Deletes the hierarchical object instance from the model. The ID must be set.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the hierarchical object instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the hierarchical object instance in the model. The ID must be set.
 (Overrides ModelObject.Modify().)
RemoveObjects
 Removes associations to the given list of model objects. Fails if the hierarchical definition doesn't exist in the model.
Select
 Selects the hierarchical object instance from the model. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           HierarchicDefinition scenarioDefinition = new HierarchicDefinition();
           scenarioDefinition.Name = "Scenario type";
           scenarioDefinition.HierarchyType = HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_TASK_SCENARIO;
           scenarioDefinition.Insert();
           HierarchicObject scenario = new HierarchicObject();
           scenario.Name = "First scenario";
           scenario.Definition = scenarioDefinition;
           scenario.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace
Tekla.Structures.Model.HierarchicDefinition