Tekla Open API Reference for Tekla Structures 2025
View Class
 The View class contains methods related to views. Views are views that contain other drawing objects, excluding other views. Views also contain drawing representations of model objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ViewBase
 Tekla.Structures.Drawing.View
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class View : ViewBase
<SerializableAttribute>
Public NotInheritable Class View
	Inherits ViewBase
The View type exposes the following members.
Constructors
Name | Description
View(ContainerView, CoordinateSystem, CoordinateSystem, ArrayList)
 Creates a new view instance with the given coordinate systems and part list.
View(ContainerView, CoordinateSystem, CoordinateSystem, AABB)
 Creates a new view instance with the given coordinate systems and model area.
View(ContainerView, CoordinateSystem, CoordinateSystem, ArrayList, String)
 Creates a new view instance with the given coordinate systems, part list and attributes file's filename.
View(ContainerView, CoordinateSystem, CoordinateSystem, AABB, String)
 Creates a new view instance with the given coordinate systems, model area and attributes file's filename.
Top
Properties
Name | Description
Attributes
 The view attributes.
DisplayCoordinateSystem
 The coordinate system of the display plane. This can be used to transform global points from the model that is to be inserted in the view.
Name
 The name of the view.
RestrictionBox
 The axis aligned bounding box that represents the volume of the view.
ViewCoordinateSystem
 The coordinate system of the view plane.
ViewType
 The view type information.
Top
Methods
Name | Description
Create3dView(Drawing, Point, View.ViewAttributes, View)
 Generates a new 3d view on the sheet of the given active drawing.
Create3dView(Drawing, CoordinateSystem, CoordinateSystem, AABB, Point, View.ViewAttributes, View)
 Generates a new 3d view on the sheet of the given active drawing using given view plane and display plane.
CreateBackView
 Generates a new back view on the sheet of the given active drawing.
CreateBottomView
 Generates a new bottom view on the sheet of the given active drawing.
CreateCurvedSectionView
 Generates a new curved section view on the sheet of the active drawing and the associated section mark for the specified view.
CreateDetailView
 Generates a new detail view on the sheet of the active drawing and the associated detail mark for the specified view.
CreateFrontView
 Generates a new front view on the sheet of the given active drawing.
CreateSectionView
 Generates a new section view on the sheet of the active drawing and the associated section mark for the specified view.
CreateTopView
 Generates a new top view on the sheet of the given active drawing.
GetModelObjects()
 Gets the model objects that are in the view.
GetVisibleAreaRestrictionBoxes
 Gets the restriction boxes that represent the visible areas of the view.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewBase.IsEqual(Object).)
RotateViewOnAxisX
 Rotate the view on the X axis.
RotateViewOnAxisY
 Rotate the view on the Y axis.
RotateViewOnAxisZ
 Rotate the view on the Z axis.
RotateViewOnDrawingPlane
 Rotate the view on the drawings plane. This works just like the user interface command "Rotate view".
Top
Examples
 The following example creates and inserts two new views to the active drawing. A drawing must be open when executing the code.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Beam beam = new Beam(new Point(0, 0, 0), new Point(500, 0, 0));
           beam.Profile.ProfileString = "HEA300";
           beam.Insert();
           Beam column = new Beam(new Point(0, 0, 0), new Point(0, 0, 500));
           column.Profile.ProfileString = "HEA200";
           column.Insert();
           new Model().CommitChanges();
           DrawingHandler myDrawingHandler = new DrawingHandler();
           if(myDrawingHandler.GetConnectionStatus())
           {
               Drawing currentDrawing = myDrawingHandler.GetActiveDrawing();
               CoordinateSystem coordSysPlan = new CoordinateSystem(
                    new Point(), new Vector(1, 0, 0), new Vector(0, 1, 0));
               CoordinateSystem coordSys3d = new CoordinateSystem(
                   new Point(), new Vector(0.5, 0.866, 0), new Vector(-0.296, 0.171, 0.94));
               View newPlanView = new View(Drawing.GetSheet(), coordSysPlan, coordSysPlan,
                   new AABB(new Point(-1000, -1000, -1000), new Point(1000, 1000, 1000)));
               newPlanView.Insert();
               View new3dView = new View(Drawing.GetSheet(), coordSysPlan, coordSys3d,
                   new AABB(new Point(-1000, -1000, -1000), new Point(1000, 1000, 1000)));
               new3dView.Insert();
               currentDrawing.PlaceViews();
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace