Tekla Open API Reference for Tekla Structures 2025
WeldFilterExpressions.ReferenceText Class
 The ReferenceText class represents the reference text filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.ReferenceText
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReferenceText : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class ReferenceText
	Inherits StringFilterExpression
The WeldFilterExpressions.ReferenceText type exposes the following members.
Constructors
Name | Description
WeldFilterExpressions.ReferenceText
 Initializes a new instance of the ReferenceText class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace