Tekla Open API Reference for Tekla Structures 2025
AnalysisPosition Properties
The AnalysisPosition type exposes the following members.
Properties
Name | Description
Node
 The node of the position.
Type
 The type of the position.
Top
See Also
Reference
AnalysisPosition Class
Tekla.Structures.Analysis Namespace