Tekla Open API Reference for Tekla Structures 2025
LoadGroup Properties
The LoadGroup type exposes the following members.
Properties
Name | Description
Color
 The load group color. This variable indicates the color with which all loads that belong to this same group are drawn in Tekla Structures views.
Compatible
 This variable is used to store information on which groups are compatible with each other in structural analysis load combination. Load combination is a process in which some simultaneously acting load groups are multiplied by their partial safety factors and combined with each other according to specific rules. To accurately combine loads which have the same load group type, you need to identify which load groups can occur at the same time, i.e. are compatible. This variable stores one integer, and all groups who have this same integer are known to be compatible with each other. Depending on the analysis needs, they may be calculated together, in smaller combinations, or separately.
Direction
 The load group direction.
GroupName
 The load group name. The maximum size is 126 characters.
GroupType
 The load group type.
Incompatible
 This variable is used to store information on which groups exclude each other in structural analysis load combination. Load combination is a process in which some simultaneously acting load groups are multiplied by their partial safety factors and combined with each other according to specific rules. To accurately combine loads which have the same load group type, you need to identify which load groups exclude each other, i.e. are incompatible. This variable stores one integer, and all groups who have this same integer are known to be incompatible with each other.
Top
See Also
Reference
LoadGroup Class
Tekla.Structures.Model Namespace