Tekla Open API Reference for Tekla Structures 2025
Drawing Properties
The Drawing type exposes the following members.
Properties
Name | Description
CommitMessage
 Gets the commit message
CreationDate
 The drawing creation date.
DrawingTypeStr
 The type of the drawing
IsFrozen
 Describes whether the drawing is frozen.
IsIssued
 Describes whether the drawing is issued.
IsIssuedButModified
 Describes whether the drawing is issued but modified since it was issued.
IsLocked
 Describes whether the drawing is locked.
IsLockedBy
 Gets the logged in username that set the drawing to locked
IsMasterDrawing
 Describes whether the drawing is a master drawing (shown with a special symbol on the drawing list).
IsReadyForIssue
 Describes whether the drawing is ready for issue.
IsReadyForIssueBy
 Gets the logged in username that set the drawing Ready for issue
IssuingDate
 The drawing issuing date.
Layout
 Gets the drawing layout attributes.
Mark
 The drawing mark.
ModificationDate
 The drawing modification date.
Name
 The name of the drawing.
OutputDate
 The drawing output date. XS_DISABLE_DRAWING_PLOT_DATE controls whether this date is set.
SectionViewStartLabel
 Gets the drawing attribute for start label of section view
Title1
 The first drawing title.
Title2
 The second drawing title.
Title3
 The third drawing title.
UpToDateStatus
 Gets the drawing up to date status.
Top
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace