Tekla Open API Reference for Tekla Structures 2025
DateTimeFilterExpression Class
 The DateTimeFilterExpression class represents a DateTime filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.DateTimeFilterExpression
 More...
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class DateTimeFilterExpression : DataFilterExpression
<SerializableAttribute>
Public Class DateTimeFilterExpression
	Inherits DataFilterExpression
The DateTimeFilterExpression type exposes the following members.
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.DateTimeFilterExpression
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.ConstructionObjectFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.LoadFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.PourBreakFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.PourUnitFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.ReferenceObjectFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.SurfaceFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.ActualEndDate
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.ActualStartDate
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.PlannedEndDate
 Tekla.Structures.Filtering.Categories.TaskFilterExpressions.PlannedStartDate
 Tekla.Structures.Filtering.Categories.TemplateFilterExpressions.CustomDateTime
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.CustomDateTime