Tekla Open API Reference for Tekla Structures 2025
NormalLineType Class
 The NormalLineType class defines the non-custom line types that can be used by the drawing objects.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.LineTypes
 Tekla.Structures.Drawing.NormalLineType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class NormalLineType : LineTypes,
	ICloneable
<SerializableAttribute>
Public Class NormalLineType
	Inherits LineTypes
	Implements ICloneable
The NormalLineType type exposes the following members.
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
 (Overrides LineTypes.Clone().)
Equals
 Returns true if the current object and the given object are equal.
 (Overrides LineTypes.Equals(Object).)
GetHashCode
 Returns a hash code for the object.
 (Overrides LineTypes.GetHashCode().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides LineTypes.IsEqual(Object).)
Top
Operators
Name | Description
Equality
 Returns true if the current object and the given object are equal.
Inequality
 Returns true if the current object and the given object are not equal.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace