Tekla Open API Reference for Tekla Structures 2025
AnalysisBar Properties
The AnalysisBar type exposes the following members.
Properties
Name | Description
AnalysisDesignCode
 Gets or sets the analysis design code of the analysis bar.
AnalysisType
 Gets or sets the analysis type of the analysis bar.
CardinalPoint
 Gets or sets the cardinal point of the analysis bar.
Composite
 Gets or sets the composite beam of the analysis bar.
Curvature
 Gets or sets the curvature of the analysis bar.
Label
 Gets or sets the label of the analysis bar.
Material
 Gets or sets the material of the analysis bar.
Members
 Gets the members of the analysis bar.
Positions
 Gets the positions of the analysis bar.
ProfileEnd
 Gets or sets the end profile of the analysis bar.
ProfileStart
 Gets or sets the start profile of the analysis bar.
Top
See Also
Reference
AnalysisBar Class
Tekla.Structures.Analysis Namespace