Tekla Open API Reference for Tekla Structures 2025
BoltArray Class
 The BoltArray class defines a bolt group with an array shape.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BoltGroup
 Tekla.Structures.Model.BoltArray
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BoltArray : BoltGroup
<SerializableAttribute>
Public NotInheritable Class BoltArray
	Inherits BoltGroup
The BoltArray type exposes the following members.
Constructors
Name | Description
BoltArray
 Creates a new bolt array instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
AddBoltDistX
 Adds an X distance to the bolt array.
AddBoltDistY
 Adds a Y distance to the bolt array.
Delete
 Deletes the bolt array instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetBoltDistX
 Returns the X distance defined by the argument.
GetBoltDistXCount
 Returns the amount of X distances in the bolt array.
GetBoltDistY
 Returns the Y distance defined by the argument.
GetBoltDistYCount
 Returns the amount of Y distances in the bolt array.
Insert
 Inserts the bolt array into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing bolt array in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
 (Overrides ModelObject.Modify().)
RemoveBoltDistX
 Removes an X distance from the bolt array in the index position.
RemoveBoltDistY
 Removes a Y distance from the bolt array in the index position.
Select
 Selects a bolt array from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
SetBoltDistX
 Sets the X distance at the index defined by the argument.
SetBoltDistY
 Sets the Y distance at the index defined by the argument.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           ContourPlate cp = new ContourPlate();
           cp.Profile.ProfileString = "PL20";
           cp.AddContourPoint(new ContourPoint(new Point( 3000,  6000, 0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 6000,  6000, 0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 6000, 12000, 0),null));
           cp.AddContourPoint(new ContourPoint(new Point( 3000, 12000, 0),null));
           if (!cp.Insert())
               Console.WriteLine("ContourPlate Insert failed!");
           BoltArray B = new BoltArray();
           B.PartToBeBolted = cp;
           B.PartToBoltTo   = cp;
           B.FirstPosition  = new Point(3200,  6200, 0);
           B.SecondPosition = new Point(6000, 12000, 0);
           B.BoltSize     = 16;
           B.Tolerance    = 3.00;
           B.BoltStandard = "NELSON";
           B.BoltType     = BoltGroup.BoltTypeEnum.BOLT_TYPE_WORKSHOP;
           B.CutLength    = 105;
           B.Length       = 100;
           B.ExtraLength  = 15;
           B.ThreadInMaterial = BoltGroup.BoltThreadInMaterialEnum.THREAD_IN_MATERIAL_NO;
           B.Position.Depth          = Position.DepthEnum.MIDDLE;
           B.Position.Plane          = Position.PlaneEnum.MIDDLE;
           B.Position.Rotation       = Position.RotationEnum.FRONT;
           B.Bolt    = true;
           B.Washer1 = true;
           B.Washer2 = true;
           B.Washer3 = true;
           B.Nut1    = true;
           B.Nut2    = true;
           B.Hole1   = true;
           B.Hole2   = true;
           B.Hole3   = true;
           B.Hole4   = true;
           B.Hole5   = true;
           B.AddBoltDistX(100);
           B.AddBoltDistX(90);
           B.AddBoltDistX(80);
           B.AddBoltDistY(70);
           B.AddBoltDistY(60);
           B.AddBoltDistY(50);
           if (!B.Insert())
               Console.WriteLine("BoltArray Insert failed!");
       }
}
See Also
Reference
Tekla.Structures.Model Namespace