Tekla Open API Reference for Tekla Structures 2025
ReferenceModel Properties
The ReferenceModel type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the reference model object attributes.
Top
See Also
Reference
ReferenceModel Class
Tekla.Structures.Drawing Namespace