Tekla Open API Reference for Tekla Structures 2025
TextFile Properties
The TextFile type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the text file attributes.
Top
See Also
Reference
TextFile Class
Tekla.Structures.Drawing Namespace