Tekla Open API Reference for Tekla Structures 2025
WeldFilterExpressions.WeldingSite Class
 The WeldingSite class represents the welding site filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.WeldingSite
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class WeldingSite : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class WeldingSite
	Inherits NumericFilterExpression
The WeldFilterExpressions.WeldingSite type exposes the following members.
Constructors
Name | Description
WeldFilterExpressions.WeldingSite
 Initializes a new instance of the WeldingSite class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace