Tekla Open API Reference for Tekla Structures 2025
ParametricObject_ObjectBoundingBox Properties
The ParametricObject_ObjectBoundingBox type exposes the following members.
Properties
Name | Description
yDir
 The Y direction.
Top
See Also
Reference
ParametricObject_ObjectBoundingBox Class
Tekla.Structures.Model.Collaboration Namespace