Tekla Open API Reference for Tekla Structures 2025
OpenGraphicObjectAttributes Properties
The OpenGraphicObject.OpenGraphicObjectAttributes type exposes the following members.
Properties
Name | Description
Arrowhead
 The arrowhead attributes of the open graphic object. The end points of an open graphic object can contain arrowheads.
Top
See Also
Reference
OpenGraphicObject.OpenGraphicObjectAttributes Class
Tekla.Structures.Drawing Namespace