Tekla Open API Reference for Tekla Structures 2025
ControlPolycurve Class
 The ControlPolycurve class defines a user defined polycurve object which contains a chain of line and arc geometries.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.ControlPolycurve
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class ControlPolycurve : ModelObject
<SerializableAttribute>
Public Class ControlPolycurve
	Inherits ModelObject
The ControlPolycurve type exposes the following members.
Constructors
Name | Description
ControlPolycurve()
 Initializes a new instance of the ControlPolycurve class.
The default values are as follows:
Color = ControlObjectColorEnum.BLUE;
LineType = LineType.DashDot;
ControlPolycurve(Polycurve)
 Initializes a new instance of the ControlPolycurve class.
Top
Properties
Name | Description
Color
 Gets or sets color of the Polycurve.
Geometry
 Gets or sets geometry list that defines geometry of the polycurve.
LineType
 Gets or sets the line type of the polycurve.
Top
Methods
Name | Description
Delete
 Deletes a polycurve with given Identifier.
 (Overrides ModelObject.Delete().)
Insert
 Inserts a polycurve into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies a polycurve with the given Identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects a polycurve with the given Identifier.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Tekla.Structures.Model Namespace