Tekla Open API Reference for Tekla Structures 2025
RadiusDimension Class
 The RadiusDimension class defines a radius dimension that displays the radius of the given arc.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionBase
 Tekla.Structures.Drawing.RadiusDimension
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RadiusDimension : DimensionBase
<SerializableAttribute>
Public NotInheritable Class RadiusDimension
	Inherits DimensionBase
The RadiusDimension type exposes the following members.
Constructors
Name | Description
RadiusDimension(ViewBase, Point, Point, Point, Double)
 Creates a new radius dimension instance using three points and the distance.
RadiusDimension(ViewBase, Point, Point, Point, Double, RadiusDimensionAttributes)
 Creates a new radius dimension instance with the attributes, three points and the distance.
Top
Properties
Name | Description
ArcPoint1
 Gets the first arc point.
ArcPoint2
 Gets the second arc point.
ArcPoint3
 Gets the third arc point.
Attributes
 The radius dimension attributes.
Distance
 Gets or sets the distance.
Top
Methods
Name | Description
Delete
 Deletes the dimension from the database.
 (Overrides DatabaseObject.Delete().)
GetDimensionSet()
 Radius dimensions don't have dimension sets.
 (Overrides DimensionBase.GetDimensionSet().)
GetDimensionSet(Boolean)
 Radius dimensions don't have dimension sets.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Insert
 Inserts the dimension into the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the existing dimension in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the radius dimension from the database.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           ViewBase _view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
           RadiusDimension basicDimension = new RadiusDimension(_view,
               new Point(-1000, 0, 0),
               new Point(0, 1000, 0),
               new Point(1000, 0, 0),
               200);
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace