Tekla Open API Reference for Tekla Structures 2025
RebarSetAddition Properties
The RebarSetAddition type exposes the following members.
Properties
Name | Description
Father
 Gets or sets the RebarSet to which the rebar set addition applies.
LegFaces
 Gets or sets the rebar set addition's RebarLegFace objects.
Top
See Also
Reference
RebarSetAddition Class
Tekla.Structures.Model Namespace