Tekla Open API Reference for Tekla Structures 2025
PourUnit Class
 The PourUnit class represents a pour unit in the model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.PourUnit
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PourUnit : ModelObject
<SerializableAttribute>
Public Class PourUnit
	Inherits ModelObject
The PourUnit type exposes the following members.
Constructors
Name | Description
PourUnit
Initializes a new instance of the PourUnit class
Top
Properties
Name | Description
Name
 Gets or sets the name of the pour unit.
Top
Methods
Name | Description
Delete
 At the moment pour units cannot be deleted.
 (Overrides ModelObject.Delete().)
GetObjects
 Returns all objects related to pour unit, pour object not included.
GetPourObject
 Returns the pour object in pour unit.
Insert
 At the moment pour units cannot be inserted.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the pour unit with the given identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the pour unit instance from the model. The identifier of the instance must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
    public void Example1()
    {
        Beam beam = new Beam(new Point(1000, 1000, 400), new Point(3000, 1000, 400));
        beam.Profile.ProfileString = "380*380";
        beam.Material.MaterialString = "K40-1";
        beam.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
        if (beam.Insert())
        {
            Beam beam2 = new Beam(new Point(800, 1000, 0), new Point(800, 1000, 3000));
            beam2.Profile.ProfileString = "380*380";
            beam2.Material.MaterialString = "K40-1";
            beam2.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
            if (beam2.Insert())
            {
                new Model().CommitChanges();
                ModelObjectEnumerator pours = beam.GetPours();
                while (pours.MoveNext())
                {
                    PourObject pour = pours.Current as PourObject;
                    if (pour != null)
                    {
                        Solid solid = pour.GetSolid();
                        if (solid != null)
                            Console.WriteLine("Fetching solid from pour successfully!");
                        PourUnit pourUnit = pour.GetFatherPourUnit();
                        pourUnit.Name = "test";
                        pourUnit.Modify();
                        new Model().CommitChanges();
                    }
                }
            }
        }
    }
}
See Also
Reference
Tekla.Structures.Model Namespace