Tekla Open API Reference for Tekla Structures 2025
Circle Properties
The Circle type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the circle.
CenterPoint
 The center point of the circle.
Radius
 The radius of the circle.
Top
See Also
Reference
Circle Class
Tekla.Structures.Drawing Namespace