Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementMeshAttributes Class
 The ReinforcementMeshAttributes class is the base attributes class for ReinforcementMesh.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReinforcementMeshAttributes : ReinforcementBase.ReinforcementBaseAttributes
<SerializableAttribute>
Public NotInheritable Class ReinforcementMeshAttributes
	Inherits ReinforcementBase.ReinforcementBaseAttributes
The ReinforcementBase.ReinforcementMeshAttributes type exposes the following members.
Constructors
Name | Description
ReinforcementBase.ReinforcementMeshAttributes()
 Creates a new default reinforcement attributes instance that loads standard attributes.
ReinforcementBase.ReinforcementMeshAttributes(Boolean)
 Creates a new default reinforcement attributes instance that loads standard attributes. If it set to true attributes won't be lodaded.
ReinforcementBase.ReinforcementMeshAttributes(String)
 Creates a new reinforcement attributes instance that loads the specified attributes.
Top
Properties
Name | Description
MeshReinforcementSymbolIndex
 Defines the index for the mesh symbol to be used. The mesh symbol appears in the middle of the mesh line when ReinforcementRepresentation == OutLine. The index starts from 0 and corresponds to the symbol in the file mesh.sym.
MeshReinforcementSymbolSize
 Defines the size of the reinforcement mesh symbol.
MeshReinforcementVisibilityCrossing
 Defines which crossing bars in the mesh appear in drawings.
MeshReinforcementVisibilityLongitudinal
 Defines which longitudinal wires in the mesh appear in drawings.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ReinforcementBase.ReinforcementBaseAttributes.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace