Tekla Open API Reference for Tekla Structures 2025
DrawingLink Class
 The DrawingLink class defines a drawing link object in a drawing. When a drawing link is double clicked, the target drawing is opened.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.LinkBase
 Tekla.Structures.Drawing.DrawingLink
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DrawingLink : LinkBase
<SerializableAttribute>
Public NotInheritable Class DrawingLink
	Inherits LinkBase
The DrawingLink type exposes the following members.
Constructors
Name | Description
DrawingLink(ViewBase, Point, Drawing, String)
 Creates a new drawing link instance using standard attributes.
DrawingLink(ViewBase, Point, Drawing, String, LinkAttributes)
 Creates a new drawing link instance using the given attributes.
DrawingLink(ViewBase, Point, Drawing, String, Size)
 Creates a new drawing link instance of the given size.
DrawingLink(ViewBase, Point, Drawing, String, Size, LinkAttributes)
 Creates a new drawing link instance of the given size.
Top
Properties
Name | Description
Target
 Gets or sets the target drawing.
Top
Methods
Name | Description
Delete
 Deletes the link.
 (Overrides DatabaseObject.Delete().)
Insert
 Inserts the link.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the link.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the link.
 (Overrides DatabaseObject.Select().)
Top
Examples
 The following example shows how to create a basic drawing link to the current drawing. The drawing mark is used as the link text.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           DrawingHandler _drawingHandler = new DrawingHandler();
           ViewBase _view = _drawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
           Size size = new Size(10.0, 10.0);
           Point insertionPoint = new Point(200, 200);
           DrawingLink link = new DrawingLink(_view, insertionPoint,
               _drawingHandler.GetActiveDrawing(), String.Empty, size);
           link.Insert();
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace