Tekla Open API Reference for Tekla Structures 2025
AnalysisArea Properties
The AnalysisArea type exposes the following members.
Properties
Name | Description
AnalysisDesignCode
 Gets or sets the design code of the analysis area.
AnalysisType
 Gets or sets the analysis type of the analysis area.
Area
 Gets or sets the area polygon of the analysis area.
AreaHoles
 Gets or sets the area holes of the analysis area.
InnerPositions
 Gets or sets the inner positions of the analysis area.
Label
 Gets or sets the label of the analysis area.
Material
 Gets or sets the material of the analysis area.
Profile
 Gets or sets the profile of the analysis area.
RigidDiaphragm
 Gets or sets the rigid diaphragm of the analysis area.
Thickness
 Gets or sets the thickness of the analysis area.
Top
See Also
Reference
AnalysisArea Class
Tekla.Structures.Analysis Namespace