Tekla Open API Reference for Tekla Structures 2025
RebarMesh Methods
The RebarMesh type exposes the following members.
Methods
Name | Description
Delete
 Deletes the reinforcement mesh instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the reinforcement mesh into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing reinforcement mesh in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a reinforcement mesh from the model database. The reinforcement identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace