Tekla Open API Reference for Tekla Structures 2025
CurvedSectionMark Class
 The CurvedSectionMark class defines a drawing object that illustrates a curved section in a specific view. In contrast to straight section mark, the curved section mark can only be inserted as a result of creating a curved section view.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.SectionMarkBase
 Tekla.Structures.Drawing.CurvedSectionMark
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedSectionMark : SectionMarkBase
<SerializableAttribute>
Public NotInheritable Class CurvedSectionMark
	Inherits SectionMarkBase
The CurvedSectionMark type exposes the following members.
Properties
Name | Description
MiddlePoint
 The middle arc point of a curved section mark.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides SectionMarkBase.IsEqual(Object).)
Top
Examples
 The following code modifies a curved section mark in the current drawing:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class CurvedSectionMarkExample
{
    public void CurvedSectionMarkModify()
    {
        DrawingHandler myDrawingHandler = new DrawingHandler();
        DrawingObjectSelector dos = myDrawingHandler.GetDrawingObjectSelector();
        DrawingObjectEnumerator allObjectsOnSheet = dos.GetSelected();
        while (allObjectsOnSheet.MoveNext())
        {
            if (allObjectsOnSheet.Current is Tekla.Structures.Drawing.CurvedSectionMark)
            {
                CurvedSectionMark sectionMark = allObjectsOnSheet.Current as Tekla.Structures.Drawing.CurvedSectionMark;
                sectionMark.Attributes.LineWidthOffsetLeft = 5;
                sectionMark.Attributes.LineWidthOffsetRight = 5;
                sectionMark.Modify();
            }
        }
    }
}
See Also
Reference
Tekla.Structures.Drawing Namespace