Tekla Open API Reference for Tekla Structures 2025
Load Class
 The Load class is an abstract base class for all loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Load
 Tekla.Structures.Model.LoadArea
 Tekla.Structures.Model.LoadLine
 Tekla.Structures.Model.LoadPoint
 Tekla.Structures.Model.LoadTemperature
 Tekla.Structures.Model.LoadUniform
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class Load : ModelObject
<SerializableAttribute>
Public MustInherit Class Load
	Inherits ModelObject
The Load type exposes the following members.
Constructors
Name | Description
Load
 Creates a new load instance.
Top
Properties
Name | Description
AutomaticPrimaryAxisWeight
 The automatic primary axis weight.
BoundingBoxDx
 The dimension of the bounding box in the X direction.
BoundingBoxDy
 The dimension of the bounding box in the Y direction.
BoundingBoxDz
 The dimension of the bounding box in the Z direction.
CreateFixedSupportConditionsAutomatically
 Indicates whether fixed support conditions are created automatically.
FatherId
 The identifier of the father object that the load is attached to.
Group
 The load group object for the load.
LoadAttachment
 The load attachment.
LoadDispersionAngle
 The load dispersion angle.
PartFilter
 The part filter.
PartNames
 The part names.
PrimaryAxisDirection
 The vector for the primary axis direction.
Spanning
 The load spanning.
Weight
 The weight.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Model Namespace