Tekla Open API Reference for Tekla Structures 2025
ControlPoint Properties
The ControlPoint type exposes the following members.
Properties
Name | Description
Point
 Gets or sets the position of the control point.
Top
See Also
Reference
ControlPoint Class
Tekla.Structures.Model Namespace