Tekla Open API Reference for Tekla Structures 2025
GridPlane Class
 The GridPlane class defines a user defined (possibly magnetic) plane helping in modeling work. A grid plane must always belong to a father grid instance.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.GridSurface
 Tekla.Structures.Model.GridPlane
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class GridPlane : GridSurface
<SerializableAttribute>
Public NotInheritable Class GridPlane
	Inherits GridSurface
The GridPlane type exposes the following members.
Constructors
Name | Description
GridPlane()
 Creates a new grid plane instance.
The default values are as follows:
Plane = new Plane();
Plane.Origin = new Point(500.0, 500.0, 0.0);
Plane.AxisX = new Vector(2000.0, 0.0, 0.0);
Plane.AxisY = new Vector(0.0, 0.0, 2000.0);
Label = "Default";
IsMagnetic = false;
ExtensionLeft = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;
GridPlane(Plane, String)
 Creates a new grid plane instance taking the plane and label as input.
Top
Properties
Name | Description
Color |  Obsolete.
 The color of the grid plane. This works only in wireframe views. The color of grid planes in rendered views can be changed using the advanced option XS_GRID_COLOR.
DrawingVisibility
 The visibility of the grid surface in drawings.
ExtensionAbove
 The line extension above.
ExtensionBelow
 The line extension below.
ExtensionForMagneticArea |  Obsolete.
 The extension for the magnetic area.
ExtensionLeft
 The line extension on the left.
ExtensionRight
 The line extension on the right.
Father |  Obsolete.
 The father grid of the grid plane.
IsMagnetic
 Whether the grid surface is magnetic or not.
Label
 The label for the grid surface.
Plane
 The plane defining the position of the grid plane.
Top
Methods
Name | Description
Delete
 Deletes the grid surface with the given ID.
 (Overrides GridSurface.Delete().)
Insert
 Inserts the grid surface into the model.
 (Overrides GridSurface.Insert().)
Modify
 Modifies the grid plane with the given ID.
 (Overrides GridSurface.Modify().)
Select
 Selects the grid surface with the given ID.
 (Overrides GridSurface.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           GridPlane GridPlane = new GridPlane();
           Plane plane = new Plane();
           plane.Origin = new Point(6000,6000,0);
           plane.AxisX = new Vector(-3000,0,0);
           plane.AxisY = new Vector(0,6000,0);
           GridPlane.Plane = plane;
           GridPlane.IsMagnetic = true;
           bool Result = false;
           Result = GridPlane.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace