Tekla Open API Reference for Tekla Structures 2025
CustomPart Class
 The CustomPart class represents a custom part object in the Tekla Structures model. A custom part is a modeling tool that typically assembles multiple parts to build some type of a beam-like structure, for example a tapered beam or a sandwich panel.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseComponent
 Tekla.Structures.Model.CustomPart
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CustomPart : BaseComponent,
	IAssemblable
<SerializableAttribute>
Public NotInheritable Class CustomPart
	Inherits BaseComponent
	Implements IAssemblable
The CustomPart type exposes the following members.
Constructors
Name | Description
CustomPart()
 Creates a new custom part instance.
CustomPart(Point, Point)
 Creates a new custom part instance with the given input.
Top
Properties
Name | Description
Position
 The way the custom part is positioned in the model.
Top
Methods
Name | Description
Delete
 Deletes the custom part instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetAssembly
 Returns the assembly that the custom part belongs to.
GetBooleans
 Returns an enumerator of all the connected boolean objects.
GetComponents
 Returns an enumerator of all the connected components.
GetStartAndEndPositions
 Returns the start and end points of the custom part.
Insert
 Inserts the custom part into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing custom part in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a custom part from the model database. The custom part identifier must be set.
 (Overrides ModelObject.Select().)
SetInputPositions
 Sets the start and end point of the custom part.
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           CustomPart CPart = new CustomPart();
           CPart.Name = "HPKM39";
           CPart.Number = BaseComponent.CUSTOM_OBJECT_NUMBER;
           CPart.Position.Plane = Position.PlaneEnum.LEFT;
           CPart.Position.PlaneOffset = 10;
           CPart.Position.Depth = Position.DepthEnum.BEHIND;
           CPart.Position.DepthOffset = 30;
           CPart.Position.RotationOffset = 45;
           CPart.Position.Rotation = Position.RotationEnum.TOP;
           CPart.SetInputPositions(new Point(100, 0, 0), new Point(300, 0, 0));
           CPart.SetAttribute("P2a", "TEST");
           CPart.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace