Tekla Open API Reference for Tekla Structures 2025
AnalysisAreaPolygon Properties
The AnalysisAreaPolygon type exposes the following members.
Properties
Name | Description
Edges
 The edges of the area polygon.
Positions
 The positions of the area polygon.
Top
See Also
Reference
AnalysisAreaPolygon Class
Tekla.Structures.Analysis Namespace