Tekla Open API Reference for Tekla Structures 2025
RebarGroup Class
 The RebarGroup class represents a group of reinforcing bars.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Reinforcement
 Tekla.Structures.Model.BaseRebarGroup
 Tekla.Structures.Model.RebarGroup
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RebarGroup : BaseRebarGroup
<SerializableAttribute>
Public NotInheritable Class RebarGroup
	Inherits BaseRebarGroup
The RebarGroup type exposes the following members.
Constructors
Name | Description
RebarGroup
 Initializes a new rebar group instance with empty attributes.
Top
Properties
Name | Description
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
ExcludeType
 Defines which bars to omit from the group. The options are:
EXCLUDE_TYPE_NONE
EXCLUDE_TYPE_FIRST
EXCLUDE_TYPE_LAST
Polygons
 An array list of polygons to define the reinforcing bar group shape. Use 1 polygon when defining non-tapered or spiral rebar groups. Use 2 to 99 polygons when defining tapered rebar groups. Each polygon must have an equal number of points.
SpacingType
 The type of spacing. The options are (BaseRebarGroup.RebarGroupSpacingTypeEnum.):
SPACING_TYPE_UNDEFINED
SPACING_TYPE_EXACT_SPACINGS
SPACING_TYPE_EXACT_NUMBER
SPACING_TYPE_TARGET_SPACE
SPACING_TYPE_EXACT_SPACE_FLEX_AT_START
SPACING_TYPE_EXACT_SPACE_FLEX_AT_END
SPACING_TYPE_EXACT_SPACE_FLEX_AT_BOTH
StirrupType
 The type of the stirrup. The options are:
STIRRUP_TYPE_POLYGONAL
STIRRUP_TYPE_SPIRAL
STIRRUP_TYPE_TAPERED_CURVED
Top
Methods
Name | Description
Delete
 Deletes the rebar group instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the rebar group into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing rebar group in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a rebar group from the model database. The reinforcement identifier must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           Beam Beam = new Beam(new Point(5000, 8000, 0), new Point(6000, 8000, 0));
           Beam.Profile.ProfileString = "250*250";
           Beam.Material.MaterialString = "K40-1";
           Beam.Finish = "PAINT";
           Beam.Insert();
           double MinimumX = Beam.GetSolid().MinimumPoint.X;
           double MinimumY = Beam.GetSolid().MinimumPoint.Y;
           double MinimumZ = Beam.GetSolid().MinimumPoint.Z;
           double MaximumX = Beam.GetSolid().MaximumPoint.X;
           double MaximumY = Beam.GetSolid().MaximumPoint.Y;
           double MaximumZ = Beam.GetSolid().MaximumPoint.Z;
           Polygon Polygon = new Polygon();
           Polygon.Points.Add(new Point(MinimumX, MaximumY, MinimumZ));
           Polygon.Points.Add(new Point(MinimumX, MinimumY, MinimumZ));
           Polygon.Points.Add(new Point(MinimumX, MinimumY, MaximumZ));
           Polygon.Points.Add(new Point(MinimumX, MaximumY, MaximumZ));
           Polygon Polygon2 = new Polygon();
           Polygon2.Points.Add(new Point(MaximumX, MaximumY, MinimumZ));
           Polygon2.Points.Add(new Point(MaximumX, MinimumY, MinimumZ));
           Polygon2.Points.Add(new Point(MaximumX, MinimumY, MaximumZ));
           Polygon2.Points.Add(new Point(MaximumX, MaximumY, MaximumZ));
           RebarGroup RebarGroup = new RebarGroup();
           RebarGroup.Polygons.Add(Polygon);
           RebarGroup.Polygons.Add(Polygon2);
           RebarGroup.RadiusValues.Add(40.0);
           RebarGroup.SpacingType = RebarGroup.RebarGroupSpacingTypeEnum.SPACING_TYPE_TARGET_SPACE;
           RebarGroup.Spacings.Add(30.0);
           RebarGroup.ExcludeType = RebarGroup.ExcludeTypeEnum.EXCLUDE_TYPE_BOTH;
           RebarGroup.Father = Beam;
           RebarGroup.Name = "RebarGroup";
           RebarGroup.Class = 3;
           RebarGroup.Size = "12";
           RebarGroup.NumberingSeries.StartNumber = 0;
           RebarGroup.NumberingSeries.Prefix = "Group";
           RebarGroup.Grade = "A500HW";
           RebarGroup.StartHook.Shape = RebarHookData.RebarHookShapeEnum.CUSTOM_HOOK;
           RebarGroup.StartHook.Angle = -90;
           RebarGroup.StartHook.Length = 3;
           RebarGroup.StartHook.Radius = 20;
           RebarGroup.EndHook.Shape = RebarHookData.RebarHookShapeEnum.CUSTOM_HOOK;
           RebarGroup.EndHook.Angle = -90;
           RebarGroup.EndHook.Length = 3;
           RebarGroup.EndHook.Radius = 20;
           RebarGroup.OnPlaneOffsets.Add(25.0);
           RebarGroup.OnPlaneOffsets.Add(10.0);
           RebarGroup.OnPlaneOffsets.Add(25.0);
           RebarGroup.StartPointOffsetType = Reinforcement.RebarOffsetTypeEnum.OFFSET_TYPE_COVER_THICKNESS;
           RebarGroup.StartPointOffsetValue = 20;
           RebarGroup.EndPointOffsetType = Reinforcement.RebarOffsetTypeEnum.OFFSET_TYPE_COVER_THICKNESS;
           RebarGroup.EndPointOffsetValue = 60;
           RebarGroup.FromPlaneOffset = 40;
           RebarGroup.Insert();
           RebarGroup.Name = "Modified Group 1";
           RebarGroup.Modify();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace