Tekla Open API Reference for Tekla Structures 2025
Surfacing Methods
The Surfacing type exposes the following members.
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing surfacing from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Surfacing Class
Tekla.Structures.Drawing Namespace