Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedBarLoad Class
 The AnalysisDecomposedBarLoad class contains information related to decomposed bar loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedBarLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDecomposedBarLoad : AnalysisDecomposedLoad
Public NotInheritable Class AnalysisDecomposedBarLoad
	Inherits AnalysisDecomposedLoad
The AnalysisDecomposedBarLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedBarLoad
Initializes a new instance of the AnalysisDecomposedBarLoad class
Top
Properties
Name | Description
CSCode
 The CS code of the decomposed bar load.
EndDistance
 The end distance of the decomposed bar load.
EndValue
 The end value of the decomposed bar load.
StartDistance
 The start distance of the decomposed bar load.
StartValue
 The start value of the decomposed bar load.
Top
Methods
Name | Description
Select
 Selects an analysis decomposed bar load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace