Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem Properties
The ParametricProfileItem type exposes the following members.
Properties
Name | Description
ProfilePrefix
 The parametric profile item prefix.
Top
See Also
Reference
ParametricProfileItem Class
Tekla.Structures.Catalogs Namespace