Tekla Open API Reference for Tekla Structures 2025
RectangleBoundingBox Properties
The RectangleBoundingBox type exposes the following members.
Properties
Name | Description
AngleToAxis
 The angle of the bounding box in relation to the axis (the coordinate system's X-plane).
Height
 The height of the bounding box.
LowerLeft
 The lower left corner point of the bounding box.
LowerRight
 The lower right corner point of the bounding box.
UpperLeft
 The upper left corner point of the bounding box.
UpperRight
 The upper right corner point of the bounding box.
Width
 The width of the bounding box.
Top
See Also
Reference
RectangleBoundingBox Class
Tekla.Structures.Drawing Namespace