Tekla Open API Reference for Tekla Structures 2025
TextFileAttributes Properties
The TextFile.TextFileAttributes type exposes the following members.
Properties
Name | Description
Font
 Gets or sets the font.
Line
 Gets or sets the line type.
LineType |  Obsolete.
Scaling
 Gets or sets the scaling.
Top
See Also
Reference
TextFile.TextFileAttributes Class
Tekla.Structures.Drawing Namespace