Tekla Open API Reference for Tekla Structures 2025
Grid Properties
The Grid type exposes the following members.
Properties
Name | Description
Color
 Gets or sets the color of the grid.
CoordinateX
 The coordinates for the X-axis.
CoordinateY
 The coordinates for the Y-axis.
CoordinateZ
 The coordinates for the Z-axis.
ExtensionForMagneticArea |  Obsolete.
 The extension for the magnetic area.
ExtensionLeftX
 The extension to the left X-axis.
ExtensionLeftY
 The extension to the left Y-axis.
ExtensionLeftZ
 The extension to the left Z-axis.
ExtensionRightX
 The extension to the right X-axis.
ExtensionRightY
 The extension to the right Y-axis.
ExtensionRightZ
 The extension to the right Z-axis.
LabelX
 The labels for the X-axis.
LabelY
 The labels for the Y-axis.
LabelZ
 The labels for the Z-axis.
Top
See Also
Reference
Grid Class
Tekla.Structures.Model Namespace