Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase Class
 The SectionMarkBase class is a base class for both the SectionMark class and the CurvedSectionMark class.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.SectionMarkBase
 Tekla.Structures.Drawing.CurvedSectionMark
 Tekla.Structures.Drawing.SectionMark
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class SectionMarkBase : DrawingObject
<SerializableAttribute>
Public MustInherit Class SectionMarkBase
	Inherits DrawingObject
The SectionMarkBase type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the section mark.
LeftPoint
 The starting point of the left symbol of the section mark.
RightPoint
 The starting point of the right symbol of the section mark.
Top
Methods
Name | Description
Delete
 Deletes the section mark from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 Inserts the section mark into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the section mark in the current drawing database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the section mark from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace