Tekla Open API Reference for Tekla Structures 2025
TextFile Class
 The TextFile class defines a text file object in a drawing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.EmbeddedObjectBase
 Tekla.Structures.Drawing.TextFile
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class TextFile : EmbeddedObjectBase,
	IResizeable, IMovableRelative, IAxisAlignedBoundingBox, IObjectAlignedBoundingBox
<SerializableAttribute>
Public NotInheritable Class TextFile
	Inherits EmbeddedObjectBase
	Implements IResizeable, IMovableRelative, IAxisAlignedBoundingBox, IObjectAlignedBoundingBox
The TextFile type exposes the following members.
Constructors
Name | Description
TextFile(ViewBase, Point, String)
 Creates a new text file instance using standard attributes.
TextFile(ViewBase, Point, String, Size)
 Creates a new text file instance using standard attributes.
TextFile(ViewBase, Point, String, TextFile.TextFileAttributes)
 Creates a new text file instance using specific attributes.
TextFile(ViewBase, Point, String, Size, TextFile.TextFileAttributes)
 Creates a new text file instance using specific attributes.
Top
Properties
Name | Description
Attributes
 Gets or sets the text file attributes.
Top
Methods
Name | Description
Delete
 Deletes the text file object.
 (Overrides EmbeddedObjectBase.Delete().)
Insert
 Inserts the text file object.
 (Overrides EmbeddedObjectBase.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides EmbeddedObjectBase.IsEqual(Object).)
Modify
 Modifies the text file object.
 (Overrides EmbeddedObjectBase.Modify().)
Select
 Selects the text file object.
 (Overrides EmbeddedObjectBase.Select().)
Top
Remarks
 A text file object can be inserted as-is without scaling or it can be forced to fit inside the given space. The content is scaled in the Y direction, but it can overflow in the X direction.
Examples
 The following example shows how to insert a text file object:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System.IO;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           ViewBase _sheet = MyDrawingHandler.GetActiveDrawing().GetSheet();
           TextFile text = new TextFile(_sheet, new Point(-300, 100), Path.GetFullPath("my_text.txt"));
           text.Insert();
       }
}
 The following code inserts an object whose height is forced to 400 and width to 500, but it can overflow if the text is too long.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
using System.IO;
public class Example
{
       public void Example1()
       {
           Drawing myDrawing = new GADrawing();
           TextFile text = new TextFile(myDrawing.GetSheet(), new Point(-300, 100),
               Path.GetFullPath("my_text.txt"), new Size(500, 400));
           text.Insert();
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace