Tekla Open API Reference for Tekla Structures 2025
AnalysisModelConnectivityRule Class
 The AnalysisModelConnectivityRule class contains information related to analysis model connectivity rules.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisModelConnectivityRule
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisModelConnectivityRule : AnalysisObject
Public NotInheritable Class AnalysisModelConnectivityRule
	Inherits AnalysisObject
The AnalysisModelConnectivityRule type exposes the following members.
Constructors
Name | Description
AnalysisModelConnectivityRule
Initializes a new instance of the AnalysisModelConnectivityRule class
Top
Properties
Name | Description
Group1
 The group name 1 of the connectivity rule.
Group2
 The group name 2 of the connectivity rule.
Linkage1
 The linkage 1 of the connectivity rule.
Linkage2
 The linkage 2 of the connectivity rule.
MagneticDistance
 The magnetic distance of the connectivity rule.
Status
 The status of the connectivity rule.
Top
Methods
Name | Description
Select
 Selects an analysis connectivity rule. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace