Tekla Open API Reference for Tekla Structures 2025
RebarSplice Methods
The RebarSplice type exposes the following members.
Methods
Name | Description
Delete
 Deletes the rebar splice instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the rebar splice into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing rebar splice in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a rebar splice from the model database. The splice identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
RebarSplice Class
Tekla.Structures.Model Namespace