Tekla Open API Reference for Tekla Structures 2025
SpiralBeam Properties
The SpiralBeam type exposes the following members.
Properties
Name | Description
EndPoint
 Gets the spiral beam end point.
RotationAngle
 Gets or sets the rotation of the spiral beam in degrees. Each range of 360.0 degrees adds a full rotation.
RotationAxisBasePoint
 Gets or sets the first definition point of the spiral beam rotation axis.
RotationAxisDirection
 Gets the direction of the spiral beam rotation axis.
RotationAxisUpPoint
 Gets or sets the second definition point of the spiral beam rotation axis.
RotationCenterPoint
 Gets the geometric rotation center point at the start of the spiral beam.
StartPoint
 Gets or sets the start point of the spiral beam.
TotalRise
 Gets or sets the difference between the spiral beam start and end point in the direction of the rotation axis.
TwistAngleEnd
 Gets or sets the twist angle in degrees at the end of the spiral beam.
TwistAngleStart
 Gets or sets the twist angle in degrees at the start of the spiral beam.
Top
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace