Tekla Open API Reference for Tekla Structures 2025
PourBreak Class
 The PourBreak class represents a pour break in a model.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.PourBreak
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PourBreak : ModelObject
<SerializableAttribute>
Public Class PourBreak
	Inherits ModelObject
The PourBreak type exposes the following members.
Constructors
Name | Description
PourBreak
Initializes a new instance of the PourBreak class
Top
Properties
Name | Description
Polymesh
 Gets or sets the polymesh that forms the object geometry.
Top
Methods
Name | Description
Delete
 Deletes the model object from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts a new model object. The geometry of the object needs to be set by using the public Polymesh function, before calling insert.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing model object in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the model object from the model by the identifier of this instance.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
using System.Collections.Generic;
public class Example
{
   public void Example1()
   {
       Point startPointBeam = new Point(0.0, 0.0, 0.0);
       Point endPointBeam = new Point(7200.0, 0.0, 0.0);
       Beam beam = new Beam(startPointBeam, endPointBeam)
       {
           Profile = { ProfileString = "400*400" },
           Material = { MaterialString = "Concrete_Undefined" }
       };
       if (beam.Insert())
      {
          Vector[] vertices = new[]
          {
              new Vector(2000.0,  200.0,    0.0),
              new Vector(2000.0,  200.0, -400.0),
              new Vector(2000.0, -200.0, -400.0),
              new Vector(2000.0, -200.0,    0.0)
          };
          var outerWires = new int[1][];
          outerWires[0] = new int[vertices.Length];
          for (int i = 0; i < vertices.Length; i++)
              outerWires[0][i] = i;
          var innerWires = new Dictionary<int, int[][]> { };
          var pourBreak = new PourBreak { Polymesh = new FacetedBrep(vertices, outerWires, innerWires) };
          bool result = pourBreak.Insert();
      }
  }
}
See Also
Reference
Tekla.Structures.Model Namespace