Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer Properties
The EdgeChamfer type exposes the following members.
Properties
Name | Description
Chamfer
 The chamfer values for the EdgeChamfer.
FirstBevelDimension
 The bevel dimension if the first end is bevelled.
FirstChamferEndType
 The ChamferEndTypeEnum of the first end.
FirstEnd
 The start point of the EdgeChamfer.
Name
 The name of the EdgeChamfer instance.
SecondBevelDimension
 The bevel dimension if the second end is bevelled.
SecondChamferEndType
 The ChamferEndTypeEnum of the second end.
SecondEnd
 The end point of the EdgeChamfer.
Top
See Also
Reference
EdgeChamfer Class
Tekla.Structures.Model Namespace