Tekla Open API Reference for Tekla Structures 2025
PolyBeam Class
 The PolyBeam class represents a continuous beam with a contour as input.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Part
 Tekla.Structures.Model.PolyBeam
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PolyBeam : Part
<SerializableAttribute>
Public NotInheritable Class PolyBeam
	Inherits Part
The PolyBeam type exposes the following members.
Constructors
Name | Description
PolyBeam()
 Initializes a new instance of the PolyBeam class.
PolyBeam(PolyBeam.PolyBeamTypeEnum)
 Initializes a new instance of the PolyBeam class by using the defined type.
Top
Properties
Name | Description
Contour
 Gets or sets the contour for the polybeam.
Type
 Gets the read only type of the polybeam. The default type for a new polybeam instance is beam.
Top
Methods
Name | Description
AddContourPoint
 Adds a contour point to the polybeam.
Delete
 Deletes the polybeam instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetCenterLinePolycurve
 Get centerline as polycurve
GetPolybeamCoordinateSystems
 Returns a list of coordinate systems for the polybeam segments.
Insert
 Inserts the polybeam into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing polybeam in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a polybeam from the model database. The identifier of the polybeam must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           ContourPoint point = new ContourPoint(new Point(0,2000,0), null);
           ContourPoint point2 = new ContourPoint(new Point(2000,2000,0), null);
           ContourPoint point3 = new ContourPoint(new Point(0,4000,0), null);
           PolyBeam PolyBeam = new PolyBeam();
           PolyBeam.AddContourPoint(point);
           PolyBeam.AddContourPoint(point2);
           PolyBeam.AddContourPoint(point3);
           PolyBeam.Profile.ProfileString = "HEA400";
           PolyBeam.Finish = "PAINT";
           bool Result = false;
           Result = PolyBeam.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace