Tekla Open API Reference for Tekla Structures 2025
OpenGraphicObject Class
 The OpenGraphicObject class is an abstract base class for all open graphic objects (the arc, the line and the polyline).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.OpenGraphicObject
 Tekla.Structures.Drawing.Arc
 Tekla.Structures.Drawing.Line
 Tekla.Structures.Drawing.Polyline
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class OpenGraphicObject : GraphicObject
<SerializableAttribute>
Public MustInherit Class OpenGraphicObject
	Inherits GraphicObject
The OpenGraphicObject type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace