Tekla Open API Reference for Tekla Structures 2025
Rectangle.RectangleAttributes Class
 The RectangleAttributes class is the attributes class of the rectangle.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes
 Tekla.Structures.Drawing.Rectangle.RectangleAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RectangleAttributes : ClosedGraphicObject.ClosedGraphicObjectAttributes
<SerializableAttribute>
Public NotInheritable Class RectangleAttributes
	Inherits ClosedGraphicObject.ClosedGraphicObjectAttributes
The Rectangle.RectangleAttributes type exposes the following members.
Constructors
Name | Description
Rectangle.RectangleAttributes()
 Creates a new default rectangle attributes instance that loads standard attributes.
Rectangle.RectangleAttributes(String)
 Creates a new rectangle attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Bulge
 The bulge value for the rectangle.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace