Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedSelfweightLoad Class
 The AnalysisDecomposedSelfweightLoad class contains information of decomposed selfweight loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDecomposedSelfweightLoad : AnalysisDecomposedLoad
Public NotInheritable Class AnalysisDecomposedSelfweightLoad
	Inherits AnalysisDecomposedLoad
The AnalysisDecomposedSelfweightLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedSelfweightLoad
Initializes a new instance of the AnalysisDecomposedSelfweightLoad class
Top
Properties
Name | Description
Directions
 The directions of the decomposed selfweight load.
Factors
 The factors of the decomposed selfweight load.
Top
Methods
Name | Description
Select
 Selects an analysis decomposed selfweight load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace