Tekla Open API Reference for Tekla Structures 2025
MarkBase Methods
The MarkBase type exposes the following members.
Methods
Name | Description
GetAxisAlignedBoundingBox
 Returns the axis aligned bounding box of the text (rectangle format).
GetObjectAlignedBoundingBox
 Returns the object aligned bounding box of the text (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
MoveObjectRelative
 Moves the object using the move vector.
Top
See Also
Reference
MarkBase Class
Tekla.Structures.Drawing Namespace