Tekla Open API Reference for Tekla Structures 2025
WeldMark Class
 The WeldMark class defines a drawing object that illustrates a weld mark in a specific view. WeldMark class refers to welding marks that appear when creating/updating drawing views. In this case, ModelIdentifier has a value. WeldMark class also refers to weld marks created with drawing editor UI. In this case, ModelIdentifier value is zero. Graphical representation of welding marks (line and text properties) can be modified using .wel setting files. The welding mark settting files (.wls) cannot be used to modify instances of WeldMark class.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.WeldMark
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class WeldMark : DrawingObject,
	IObjectAlignedBoundingBox, IAxisAlignedBoundingBox, IMovableRelative, IHideable, IHasChildren
<SerializableAttribute>
Public NotInheritable Class WeldMark
	Inherits DrawingObject
	Implements IObjectAlignedBoundingBox, IAxisAlignedBoundingBox, IMovableRelative, IHideable,
	IHasChildren
The WeldMark type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the weld mark. For more information see WeldMark.WeldMarkAttributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
InsertionPoint
 The insertion point of the mark.
ModelIdentifier
 When instance refers to welding mark related to a weld in model database, ModelIdentifier has a value. When instance refers to weld mark created with drawing editor UI, value is zero.
Top
Methods
Name | Description
Delete
 Deletes the weld mark from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Returns the axis aligned bounding box of the weld mark (rectangle format).
GetObjectAlignedBoundingBox
 Returns the object aligned bounding box of the weld mark (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
Insert
 NOT YET IMPLEMENTED. Welding marks connected with welds in the model database appear when drawing views are created/updated. Weld marks created with drawing editor UI cannot be inserted with API code.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the weld mark in the current drawing database. Attributes can be modified with .wel setting files.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object using the move vector.
Select
 Selects the weld mark from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
Examples
 The following code modifies a weld mark in the current drawing:
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class WeldMarkExample
{
    public void WeldMarkModify()
    {
        DrawingHandler myDrawingHandler = new DrawingHandler();
        DrawingObjectSelector dos = myDrawingHandler.GetDrawingObjectSelector();
        DrawingObjectEnumerator allObjectsOnSheet = dos.GetSelected();
        while (allObjectsOnSheet.MoveNext())
        {
            if (allObjectsOnSheet.Current is Tekla.Structures.Drawing.WeldMark)
            {
                WeldMark weldMark = allObjectsOnSheet.Current as Tekla.Structures.Drawing.WeldMark;
                weldMark.Modify();
            }
        }
    }
}
See Also
Reference
Tekla.Structures.Drawing Namespace