Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetOrthogonal Class
 The CurvedDimensionSetOrthogonal class defines a curved dimension set with orthogonal reference lines.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionSetBase
 Tekla.Structures.Drawing.CurvedDimensionSetBase
 Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class CurvedDimensionSetOrthogonal : CurvedDimensionSetBase
<SerializableAttribute>
Public NotInheritable Class CurvedDimensionSetOrthogonal
	Inherits CurvedDimensionSetBase
The CurvedDimensionSetOrthogonal type exposes the following members.
Properties
Name | Description
Attributes
 The curved dimension set orthogonal attributes.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace