Tekla Open API Reference for Tekla Structures 2025
Symbol Class
 The Symbol class defines a drawing object that is displayed as a symbol in a drawing. Symbols are located in the environment directory under the folder named "symbols" in .sym files that can contain up to 255 symbols. Symbol files can be created with SymEd. See the Tekla Structures help for more information.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.Symbol
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Symbol : DrawingObject,
	IAxisAlignedBoundingBox, IObjectAlignedBoundingBox, IMovableRelative, IPlacing, IHasChildren,
	IHideable
<SerializableAttribute>
Public NotInheritable Class Symbol
	Inherits DrawingObject
	Implements IAxisAlignedBoundingBox, IObjectAlignedBoundingBox, IMovableRelative, IPlacing,
	IHasChildren, IHideable
The Symbol type exposes the following members.
Constructors
Name | Description
Symbol(ViewBase, Point)
 Creates a new symbol instance using the default symbol information and standard attributes.
Symbol(ViewBase, Point, PlacingBase)
 Creates a new symbol instance using the default symbol information, standard attributes and the given placing.
Symbol(ViewBase, Point, SymbolInfo)
 Creates a new symbol instance using standard attributes.
Symbol(ViewBase, Point, SymbolInfo, PlacingBase)
 Creates a new symbol instance using standard attributes.
Symbol(ViewBase, Point, SymbolInfo, Symbol.SymbolAttributes)
 Creates a new symbol instance using the given attributes.
Symbol(ViewBase, Point, SymbolInfo, Symbol.SymbolAttributes, PlacingBase)
 Creates a new symbol instance using the given attributes and placing.
Top
Properties
Name | Description
Attributes
 Gets or sets the symbol attributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
InsertionPoint
 Gets or sets the symbol insertion point.
Placing
 The current placing of the object. See the placing types for different placing options.
SymbolInfo
 Gets or sets the symbol information.
Top
Methods
Name | Description
Delete
 Deletes the symbol from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Returns the bounding box of the symbol (rectangle format).
GetObjectAlignedBoundingBox
 Returns the bounding box of the symbol (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
Insert
 Inserts the symbol into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the symbol in the current drawing database.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object using the move vector.
Select
 Selects the symbol from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           ViewBase view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
           Symbol xs = new Symbol(view, new Point(1000, 2000), new SymbolInfo("xsteel", 52));
           xs.Attributes.Angle = 30;
           xs.Attributes.Frame.Type = FrameTypes.Rectangular;
           xs.Attributes.Height = 4.0;
           xs.Insert();
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace