Tekla Open API Reference for Tekla Structures 2025
BoltFilterExpressions.Size Class
 The Size class represents the size filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.Size
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Size : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class Size
	Inherits NumericFilterExpression
The BoltFilterExpressions.Size type exposes the following members.
Constructors
Name | Description
BoltFilterExpressions.Size
 Initializes a new instance of the Size class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace