Tekla Open API Reference for Tekla Structures 2025
BoltXYList Methods
The BoltXYList type exposes the following members.
Methods
Name | Description
AddBoltDistX
 Adds an X distance to the bolt XY list.
AddBoltDistY
 Adds a Y distance to the bolt XY list.
Delete
 Deletes the bolt XY list instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetBoltDistX
 Returns the X distance defined by the argument.
GetBoltDistXCount
 Returns the amount of X distances in the bolt XY list.
GetBoltDistY
 Returns the Y distance defined by the argument.
GetBoltDistYCount
 Returns the amount of Y distances in the bolt XY list.
Insert
 Inserts the bolt XY list into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing bolt XY list in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
 (Overrides ModelObject.Modify().)
Select
 Selects a bolt XY list from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
BoltXYList Class
Tekla.Structures.Model Namespace