Tekla Open API Reference for Tekla Structures 2025
RebarSplitter Methods
The RebarSplitter type exposes the following members.
Methods
Name | Description
GetAffectedBars
 Gets the virtual bars affected by this splitter.
Top
See Also
Reference
RebarSplitter Class
Tekla.Structures.Model Namespace