Tekla Open API Reference for Tekla Structures 2025
LoadLine Methods
The LoadLine type exposes the following members.
Methods
Name | Description
Delete
 Deletes the load line instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the load line into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing load line in the model database to match the current one. At the moment it is not possible to change the load attachment or the father.
 (Overrides ModelObject.Modify().)
Select
 Selects a load line from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
LoadLine Class
Tekla.Structures.Model Namespace