Tekla Open API Reference for Tekla Structures 2025
WeldFilterExpressions.TypeAboveLine Class
 The TypeAboveLine class represents the type above line filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.TypeAboveLine
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class TypeAboveLine : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class TypeAboveLine
	Inherits NumericFilterExpression
The WeldFilterExpressions.TypeAboveLine type exposes the following members.
Constructors
Name | Description
WeldFilterExpressions.TypeAboveLine
 Initializes a new instance of the TypeAboveLine class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace