Tekla Open API Reference for Tekla Structures 2025
Weld Methods
The Weld type exposes the following members.
Methods
Name | Description
Delete
 Deletes the drawing weld from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED. Welding lines that refer to welds in the model database appear in views when drawing views are created/updated.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the weld. Class can use .welo setting files to modify graphical representation of the welding lines.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing weld from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Weld Class
Tekla.Structures.Drawing Namespace