Tekla Open API Reference for Tekla Structures 2025
SingleRebar Properties
The SingleRebar type exposes the following members.
Properties
Name | Description
EndHook
 The hook at the end of the reinforcing bar.
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
Polygon
 The polygon of the reinforcing bar.
Size
 The size of the reinforcement.
StartHook
 The hook at the beginning of the reinforcing bar.
Top
See Also
Reference
SingleRebar Class
Tekla.Structures.Model Namespace