Tekla Open API Reference for Tekla Structures 2025
DimensionSetBase Class
 The DimensionSetBase class is the common base class for all the different dimension sets. The dimension set base cannot be instantiated.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.DimensionSetBase
 Tekla.Structures.Drawing.CurvedDimensionSetBase
 Tekla.Structures.Drawing.StraightDimensionSet
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class DimensionSetBase : DrawingObject,
	IHasChildren, IHideable
<SerializableAttribute>
Public MustInherit Class DimensionSetBase
	Inherits DrawingObject
	Implements IHasChildren, IHideable
The DimensionSetBase type exposes the following members.
Properties
Name | Description
Attributes
 The dimension set attributes.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
Top
Methods
Name | Description
AddToDimensionSet
 Adds a dimension set to the current dimension set.
GetObjects()
 Gets the children straight dimensions of the current straight dimension set.
GetObjects(Type[])
 Gets the children straight dimensions of the current straight dimension set that are of certain types.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace