Tekla Open API Reference for Tekla Structures 2025
PickerInputObjectAndAPoint Class
 The PickerInputObjectAndAPoint class represents a pick of an object in a view. It provides both the picked object and the point used to pick the object. Used for values asked by UI.Picker.PickObject(string Prompt, out DrawingObject PickedObject, out ViewBase PickedView, out Point PickedPoint).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputWithinAView
 Tekla.Structures.Drawing.PickerInputObject
 Tekla.Structures.Drawing.PickerInputObjectAndAPoint
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PickerInputObjectAndAPoint : PickerInputObject
Public Class PickerInputObjectAndAPoint
	Inherits PickerInputObject
The PickerInputObjectAndAPoint type exposes the following members.
Constructors
Name | Description
PickerInputObjectAndAPoint
 Creates a new PickerInputObjectAndAPoint instance representing the pick of a drawing object and the coordinates of the point used to pick the object.
Top
Properties
Name | Description
PickedPoint
 Gets or sets the picked point in the view coordinates.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PickerInputObject.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace