Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionOrthogonal Methods
The CurvedDimensionOrthogonal type exposes the following members.
Methods
Name | Description
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides CurvedDimensionBase.IsEqual(Object).)
Top
See Also
Reference
CurvedDimensionOrthogonal Class
Tekla.Structures.Drawing Namespace