Tekla Open API Reference for Tekla Structures 2025
BoltArray Methods
The BoltArray type exposes the following members.
Methods
Name | Description
AddBoltDistX
 Adds an X distance to the bolt array.
AddBoltDistY
 Adds a Y distance to the bolt array.
Delete
 Deletes the bolt array instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
GetBoltDistX
 Returns the X distance defined by the argument.
GetBoltDistXCount
 Returns the amount of X distances in the bolt array.
GetBoltDistY
 Returns the Y distance defined by the argument.
GetBoltDistYCount
 Returns the amount of Y distances in the bolt array.
Insert
 Inserts the bolt array into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing bolt array in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
 (Overrides ModelObject.Modify().)
RemoveBoltDistX
 Removes an X distance from the bolt array in the index position.
RemoveBoltDistY
 Removes a Y distance from the bolt array in the index position.
Select
 Selects a bolt array from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
SetBoltDistX
 Sets the X distance at the index defined by the argument.
SetBoltDistY
 Sets the Y distance at the index defined by the argument.
Top
See Also
Reference
BoltArray Class
Tekla.Structures.Model Namespace