Tekla Open API Reference for Tekla Structures 2025
MeshSelectionForm Properties
The MeshSelectionForm type exposes the following members.
Properties
Name | Description
SelectedMeshGrade
 The selected mesh grade.
SelectedMeshName
 The selected mesh name.
Top
See Also
Reference
MeshSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace