Tekla Open API Reference for Tekla Structures 2025
LoadGroup Methods
The LoadGroup type exposes the following members.
Methods
Name | Description
Delete
 Deletes the load group instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the load group into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing load group in the model database to match the current one. At the moment it is not possible to change the load attachment or the father.
 (Overrides ModelObject.Modify().)
Select
 Selects a load group from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
LoadGroup Class
Tekla.Structures.Model Namespace