Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterMulti Class
 The AnalysisDesignParameterMulti class contains information related to analysis design parameters with multi values.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDesignParameterBase
 Tekla.Structures.Analysis.AnalysisDesignParameterMulti
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDesignParameterMulti : AnalysisDesignParameterBase
Public NotInheritable Class AnalysisDesignParameterMulti
	Inherits AnalysisDesignParameterBase
The AnalysisDesignParameterMulti type exposes the following members.
Constructors
Name | Description
AnalysisDesignParameterMulti(Int32)
 Initializes a new instance of the AnalysisDesignParameterMulti class.
AnalysisDesignParameterMulti(String, Int32, Identifier)
 Initializes a new instance of the AnalysisDesignParameterMulti class.
Top
Properties
Name | Description
MultiValueCount
 Gets the multi value count of the analysis design parameter.
Top
Methods
Name | Description
GetValue
 Gets the value specified by the index of the analysis design parameter.
Modify
 Modifies an analysis design parameter. The ID has to be set.
 (Overrides AnalysisDesignParameterBase.Modify().)
Select
 Selects an analysis design parameter.
 (Overrides AnalysisObject.Select().)
SetValue
 Sets the value specified by the index of the analysis design parameter.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace