Tekla Open API Reference for Tekla Structures 2025
ComponentFilterExpressions.RunningNumber Class
 The RunningNumber class represents the running number filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.ComponentFilterExpressions.RunningNumber
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class RunningNumber : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class RunningNumber
	Inherits StringFilterExpression
The ComponentFilterExpressions.RunningNumber type exposes the following members.
Constructors
Name | Description
ComponentFilterExpressions.RunningNumber
 Initializes a new instance of the RunningNumber class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace