Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_CShapeProfile Properties
The IFC2X3_ParametricObject_CShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
Girth
 The girth.
InternalFilletRadius
 The internal fillet radius.
WallThickness
 The wall thickness.
Width
 The width.
Top
See Also
Reference
IFC2X3_ParametricObject_CShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace