Tekla Open API Reference for Tekla Structures 2025
RebarSplitter Class
 The RebarSplitter class represents a modifier that can split the RebarSet reinforcing bars that pass through it.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseRebarModifier
 Tekla.Structures.Model.RebarSplitter
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarSplitter : BaseRebarModifier
<SerializableAttribute>
Public Class RebarSplitter
	Inherits BaseRebarModifier
The RebarSplitter type exposes the following members.
Constructors
Name | Description
RebarSplitter
 Initializes a new instance of the RebarSplitter class.
Top
Properties
Name | Description
Cranking
 Gets or sets the rebar cranking.
Lapping
 Gets or sets the rebar lapping.
SplitOffset
 Gets or sets the offset of the split from the location of the rebar splitter.
SplitType
 Gets or sets the split type.
StaggerOffset
 Gets or sets the additional offset (stagger) of the split location for every other split reinforcing bar.
StaggerType
 Gets or sets the stagger type.
Top
Methods
Name | Description
GetAffectedBars
 Gets the virtual bars affected by this splitter.
Top
Examples
 The following example shows how to create and add a RebarSplitter, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
            // Create and insert a rebarset (see the RebarSet example).
            var rebarSet = new RebarSet();
            // Create the RebarSplitter
            var strip = new RebarSplitter();
            strip.Father = rebarSet;
            strip.SplitType = RebarSplitter.SplitTypeEnum.LAPPING;
            strip.Lapping.LappingType = RebarLapping.LappingTypeEnum.CUSTOM_LAPPING;
            strip.Lapping.LapLength = 100;
            strip.StaggerType = RebarSplitter.StaggerTypeEnum.STAGGER_LEFT;
            strip.StaggerOffset = 200;
            strip.SplitOffset = 50;
            strip.Curve.AddContourPoint(new ContourPoint(new Point(400, 200, 0), null));
            strip.Curve.AddContourPoint(new ContourPoint(new Point(400, 1000, 0), null));
            strip.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace