Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem Class
 The ParametricProfileItem class contains information from parametric profiles in the catalog. Parametric profile items can be enumerated using a profile item enumerator.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ProfileItem
 Tekla.Structures.Catalogs.ParametricProfileItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class ParametricProfileItem : ProfileItem
Public NotInheritable Class ParametricProfileItem
	Inherits ProfileItem
The ParametricProfileItem type exposes the following members.
Constructors
Name | Description
ParametricProfileItem
 Creates a new parametric profile item instance.
Top
Properties
Name | Description
ProfilePrefix
 The parametric profile item prefix.
Top
Methods
Name | Description
CreateProfileString
 Gets the parametric profile item prefix and adds parameter values.
GetParametricProfilePrefix
 Gets the parametric profile item prefix using the given subtype. This can be used after retrieving a library profile that has a parametric user-defined type.
Select(String)
 Selects the parametric profile item in the profile database using the given name.
SelectByPrefix
 Selects the parametric profile item in the profile database using the given prefix.
SelectByProfileName
 Selects the parametric profile item in the profile database using the given name.
SelectByTypeAndSubtype
 Selects the parametric profile item in the profile database using the given type and subtype.
Top
Examples
 It is possible to select a parametric profile item by its name:
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           ParametricProfileItem ParametricProfileItem = new ParametricProfileItem();
           ParametricProfileItem.ProfilePrefix = "PHI";
           ParametricProfileItem.Select();
       }
}
See Also
Reference
Tekla.Structures.Catalogs Namespace