Tekla Open API Reference for Tekla Structures 2025
AngleDimensionAttributes Properties
The AngleDimensionAttributes type exposes the following members.
Properties
Name | Description
TriangleBase
 Gets or sets the triangle base length which controls the base dimension shown for bevel dimensions (only if Type is AngleTypes.Triangle).
Type
 The type of the angle.
Top
See Also
Reference
AngleDimensionAttributes Class
Tekla.Structures.Drawing Namespace