Tekla Open API Reference for Tekla Structures 2025
LibraryProfileItem Class
 The LibraryProfileItem class contains information from library profiles in the catalog. Library profile items can be enumerated using a profile item enumerator.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ProfileItem
 Tekla.Structures.Catalogs.LibraryProfileItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class LibraryProfileItem : ProfileItem
Public NotInheritable Class LibraryProfileItem
	Inherits ProfileItem
The LibraryProfileItem type exposes the following members.
Constructors
Name | Description
LibraryProfileItem
 Creates a new library profile item instance.
Top
Properties
Name | Description
aProfileItemAnalysisParameters
 An array list with the profile item analysis parameters.
aProfileItemUserParameters
 An array list with the profile item user parameters.
ProfileName
 The profile item name.
Top
Methods
Name | Description
Copy
 Copy the library profile item in the profile database to item with new name.
Delete
 Deletes the profile item in the profile database.
Modify
 Modifies the profile item in the profile database.
Select(String)
 Selects the profile item in the profile database using the given name.
Top
Examples
 It is possible to select a library profile item by its name:
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           LibraryProfileItem LibraryProfileItem = new LibraryProfileItem();
           LibraryProfileItem.ProfileName = "HEA300";
           LibraryProfileItem.Select();
           //Equivalent code:
           LibraryProfileItem LibraryProfileItem1 = new LibraryProfileItem();
           LibraryProfileItem1.Select("HEA300");
       }
}
See Also
Reference
Tekla.Structures.Catalogs Namespace