Tekla Open API Reference for Tekla Structures 2025
ControlPlane Methods
The ControlPlane type exposes the following members.
Methods
Name | Description
Delete
 Deletes the control plane with the given ID.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the control plane into the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the control plane with the given ID.
 (Overrides ModelObject.Modify().)
Select
 Selects the control plane with the given ID.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
ControlPlane Class
Tekla.Structures.Model Namespace