Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer Properties
The EdgeChamfer type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the edge chamfer. For more information see EdgeChamfer.EdgeChamferAttributes.
Top
See Also
Reference
EdgeChamfer Class
Tekla.Structures.Drawing Namespace