Tekla Open API Reference for Tekla Structures 2025
Fitting Properties
The Fitting type exposes the following members.
Properties
Name | Description
Plane
 The plane that fits the part.
Top
See Also
Reference
Fitting Class
Tekla.Structures.Model Namespace