Tekla Open API Reference for Tekla Structures 2025
ContourPoint Methods
The ContourPoint type exposes the following members.
Methods
Name | Description
SetPoint
 Sets the point's coordinates for the contour point.
Top
See Also
Reference
ContourPoint Class
Tekla.Structures.Model Namespace