Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadCombination Properties
The AnalysisLoadCombination type exposes the following members.
Properties
Name | Description
GroupIDs
 Gets or sets the identifiers of the groups of the analysis load combination.
Name
 Gets or sets the name of the analysis load combination.
PartialSafetyFactors
 Gets or sets the partial safety factors of the analysis load combination.
ReductionFactors
 Gets or sets the reduction factors of the analysis load combination.
ScalingFactors
 Gets or sets the scaling factors of the analysis load combination.
Type
 Gets or sets the combination type of the analysis load combination.
Top
See Also
Reference
AnalysisLoadCombination Class
Tekla.Structures.Analysis Namespace