Tekla Open API Reference for Tekla Structures 2025
ContourPlate Class
 The ContourPlate class represents a part made with a contour, such as, a concrete slab.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Part
 Tekla.Structures.Model.ContourPlate
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ContourPlate : Part
<SerializableAttribute>
Public NotInheritable Class ContourPlate
	Inherits Part
The ContourPlate type exposes the following members.
Constructors
Name | Description
ContourPlate
 Initializes a new instance of the ContourPlate class.
Top
Properties
Name | Description
Contour
 Gets or sets the contour for the contour plate.
Type
 Gets the read only type of the contour plate. In creation, the type is defined based on the material. If the material is concrete, the type will be slab, otherwise plate.
Top
Methods
Name | Description
AddContourPoint
 Adds a contour point to the contour plate.
Delete
 Deletes the contour plate instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetContourPolycurve
 Get contour as polycurve
Insert
 Inserts the contour plate into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing contour plate in the model database to match the current one. The identifier must be set.
 (Overrides ModelObject.Modify().)
Select
 Selects a contour plate from the model database. The identifier of the contour plate must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           ContourPoint point =  new ContourPoint(new Point(   0, 4000, 0), null);
           ContourPoint point2 = new ContourPoint(new Point(2000, 4000, 0), null);
           ContourPoint point3 = new ContourPoint(new Point(   0, 6000, 0), null);
           ContourPlate CP = new ContourPlate();
           CP.AddContourPoint(point);
           CP.AddContourPoint(point2);
           CP.AddContourPoint(point3);
           CP.Finish = "FOO";
           CP.Profile.ProfileString = "PL200";
           CP.Material.MaterialString = "Steel_Undefined";
           bool Result = false;
           Result = CP.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace