Tekla Open API Reference for Tekla Structures 2025
AnalysisNode Class
 The AnalysisNode class contains information related to analysis nodes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisNode
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisNode : AnalysisObject
Public NotInheritable Class AnalysisNode
	Inherits AnalysisObject
The AnalysisNode type exposes the following members.
Constructors
Name | Description
AnalysisNode
 Initializes a new instance of the AnalysisNode class.
Top
Properties
Name | Description
CoordinateSystem
 The coordinate system of the analysis node.
IsUserNode
 Indicates whether the analysis node is a user node.
IsUserSupport
 Indicates whether the analysis node has a user node.
Label
 The label of the analysis node.
Position
 The position of the analysis node (in the global coordinate system).
Support
 The support of the analysis node.
Top
Methods
Name | Description
Delete
 Deletes an analysis node. The ID has to be set.
GetAnalysisNodeLinks
 Get analysis nodelinks connected to node.
GetAnalysisParts
 Get analysis parts connected to node.
Insert
 Inserts an analysis node. The AnalysisModelName has to be set.
Modify
 Modifies an analysis node. The ID has to be set.
Select
 Selects an analysis node. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace