Tekla Open API Reference for Tekla Structures 2025
RebarMesh Properties
The RebarMesh type exposes the following members.
Properties
Name | Description
CatalogName
 The name of the rebar mesh catalog.
CrossBarLocation
 Defines the location of the crossing bars.
CrossDistances
 The crossing spacing double value(s).
CrossSize
 The size of the crossing rebar.
CutByFatherPartCuts
 Defines whether the rebar mesh is cut by father part cuts or not.
EndFromPlaneOffset
 The end offset value from the part surface.
EndHook
 The hook at the end of the reinforcing.
EndPoint
 The end point of the direction in which the longitudinal bars are distributed.
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
FromPlaneOffset
 The offset value from the part surface applied in both sides.
 (Overrides Reinforcement.FromPlaneOffset.)
LeftOverhangCross
 The overhang of the crossing part's left side.
LeftOverhangLongitudinal
 The overhang of the longitudinal bar's left side.
Length
 The length of the rectangle rebar mesh.
LongitudinalDistances
 The longitudinal spacing double value(s).
LongitudinalSize
 The size of the longitudinal rebar.
LongitudinalSpacingMethod
 The type of spacing between rebar mesh bars. Used both for longitudinal and crossing bars. The options are (RebarMesh.RebarMeshSpacingMethodEnum.):
SPACING_TYPE_SAME_DISTANCE
SPACING_TYPE_MULTIPLE_VARYING_DISTANCES
MeshType
 The type of the reinforcement mesh. The options are:
RECTANGULAR_MESH
POLYGON_MESH
BENT_MESH
Polygon
 The polygon of the mesh.
RightOverhangCross
 The right overhang of the crossing bar.
RightOverhangLongitudinal
 The right overhang of the longitudinal bar.
StartFromPlaneOffset
 The start offset value from the part surface.
StartHook
 The hook at the beginning of the reinforcing.
StartPoint
 The start point of the direction in which the longitudinal bars are distributed.
Width
 The width of the rectangle rebar mesh.
Top
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace