Tekla Open API Reference for Tekla Structures 2025
CurvedRebarGroup Methods
The CurvedRebarGroup type exposes the following members.
Methods
Name | Description
Delete
 Deletes the curved rebar group instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the curved rebar group into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing curved rebar group in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a curved rebar group from the model database. The identifier of the curved rebar group must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
CurvedRebarGroup Class
Tekla.Structures.Model Namespace