Tekla Open API Reference for Tekla Structures 2025
Load Properties
The Load type exposes the following members.
Properties
Name | Description
AutomaticPrimaryAxisWeight
 The automatic primary axis weight.
BoundingBoxDx
 The dimension of the bounding box in the X direction.
BoundingBoxDy
 The dimension of the bounding box in the Y direction.
BoundingBoxDz
 The dimension of the bounding box in the Z direction.
CreateFixedSupportConditionsAutomatically
 Indicates whether fixed support conditions are created automatically.
FatherId
 The identifier of the father object that the load is attached to.
Group
 The load group object for the load.
LoadAttachment
 The load attachment.
LoadDispersionAngle
 The load dispersion angle.
PartFilter
 The part filter.
PartNames
 The part names.
PrimaryAxisDirection
 The vector for the primary axis direction.
Spanning
 The load spanning.
Weight
 The weight.
Top
See Also
Reference
Load Class
Tekla.Structures.Model Namespace