Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroup Properties
The ReinforcementSetGroup type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementSetGroupAttributes.
ReinforcementCustomPosition
 Gets or sets the location of the reinforcement bar when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized. This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.
Top
See Also
Reference
ReinforcementSetGroup Class
Tekla.Structures.Drawing Namespace