Tekla Open API Reference for Tekla Structures 2025
PourUnit Methods
The PourUnit type exposes the following members.
Methods
Name | Description
Delete
 At the moment pour units cannot be deleted.
 (Overrides ModelObject.Delete().)
GetObjects
 Returns all objects related to pour unit, pour object not included.
GetPourObject
 Returns the pour object in pour unit.
Insert
 At the moment pour units cannot be inserted.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the pour unit with the given identifier.
 (Overrides ModelObject.Modify().)
Select
 Selects the pour unit instance from the model. The identifier of the instance must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
PourUnit Class
Tekla.Structures.Model Namespace