Tekla Open API Reference for Tekla Structures 2025
LoadArea Properties
The LoadArea type exposes the following members.
Properties
Name | Description
DistanceA
 The distance a (for enlarging or reducing the loaded area).
LoadForm
 The load form.
P1
 The load magnitude vector P1. The values are given in the local coordinate system of the load (not in the current coordinate system).
P2
 The load magnitude vector P2. The values are given in the local coordinate system of the load (not in the current coordinate system).
P3
 The load magnitude vector P3. The values are given in the local coordinate system of the load (not in the current coordinate system).
P4
 The load magnitude vector P4. This one cannot be set. The values are given in the local coordinate system of the load (not in the current coordinate system).
Position1
 The first position point.
Position2
 The second position point.
Position3
 The third position point.
Top
See Also
Reference
LoadArea Class
Tekla.Structures.Model Namespace