Tekla Open API Reference for Tekla Structures 2025
MarkAttributes Properties
The Mark.MarkAttributes type exposes the following members.
Properties
Name | Description
Content
 The mark content as a list of elements.
Top
See Also
Reference
Mark.MarkAttributes Class
Tekla.Structures.Drawing Namespace