Tekla Open API Reference for Tekla Structures 2025
AssemblyFilterExpressions.Level Class
 The Level class represents the level filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Level
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Level : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class Level
	Inherits StringFilterExpression
The AssemblyFilterExpressions.Level type exposes the following members.
Constructors
Name | Description
AssemblyFilterExpressions.Level
 Initializes a new instance of the Level class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace