Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadial Methods
The CurvedDimensionSetRadial type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Top
See Also
Reference
CurvedDimensionSetRadial Class
Tekla.Structures.Drawing Namespace