Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterBase Class
 The AnalysisDesignParameterBase class contains base information related to analysis design parameters.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDesignParameterBase
 Tekla.Structures.Analysis.AnalysisDesignParameter
 Tekla.Structures.Analysis.AnalysisDesignParameterMulti
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract class AnalysisDesignParameterBase : AnalysisObject
Public MustInherit Class AnalysisDesignParameterBase
	Inherits AnalysisObject
The AnalysisDesignParameterBase type exposes the following members.
Properties
Name | Description
IsGeneral
 Gets or sets a value indicating whether the design parameter is general.
Name
 Gets or sets the name of the analysis design parameter.
Unit
 Gets or sets the unit of the analysis design parameter.
Top
Methods
Name | Description
Modify
 Modifies an analysis design parameter at the database. Inserts if parameter does not exist.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace