Tekla Open API Reference for Tekla Structures 2025
AnalysisMaterial Class
 The AnalysisMaterial class contains the material information.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisMaterial
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisMaterial : AnalysisObject
Public NotInheritable Class AnalysisMaterial
	Inherits AnalysisObject
The AnalysisMaterial type exposes the following members.
Constructors
Name | Description
AnalysisMaterial
 Initializes a new instance of the AnalysisMaterial class.
Top
Properties
Name | Description
DampingFactor
 Gets or sets the damping factor of the material.
Density
 Gets or sets the density of the material.
MaterialType
 Gets or sets tThe type of the material.
ModulusOfElasticity
 Gets or sets the modulus of elasticity of the analysis material.
Name
 Gets or sets the name of the analysis material.
PoissonsRatio
 Gets or sets the Poisson's ratio of the analysis material.
ThermalDilatation
 Gets or sets the thermal dilatation of the analysis material.
Top
Methods
Name | Description
Select
 Selects an analysis material. The AnalysisModelName and Name have to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace