Tekla Open API Reference for Tekla Structures 2025
Connection Methods
The Connection type exposes the following members.
Methods
Name | Description
Delete
 Deletes the drawing connection from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing connection from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Connection Class
Tekla.Structures.Drawing Namespace