Tekla Open API Reference for Tekla Structures 2025
PluginFormBase Class
 The PluginFormBase class is the base class for plug-in dialogs. The class extends the FormBase class by adding communications with Tekla Structures.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.FormBase
 Tekla.Structures.Dialog.PluginFormBase
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PluginFormBase : FormBase
Public Class PluginFormBase
	Inherits FormBase
The PluginFormBase type exposes the following members.
Constructors
Name | Description
PluginFormBase
 Runs the FormBase constructor and loads the default .NET localization file (DotNetDialogStrings.ail).
Top
Properties
Name | Description
ShowInTaskbar
 Hides (shadows) the ShowInTaskbar property by setting the property to false.
Top
Methods
Name | Description
Get
 Gets the dialog values from the part that is currently selected in Tekla Structures.
ReloadForm
 Reloads the dialog values.
Top
Events
Name | Description
AttributesLoadedFromModel
 The AttributesLoadedFromModel event is triggered just after the attributes have been loaded from the model into the dialog.
Top
Examples
 The following example shows a situation where a class is created by using inheritance from the PluginFormBase. Due to limited space a better example is located in the Open API Start-up Package in Extranet. The name of the example is FormPlugin.
using System;
using System.Collections.Generic;
using System.Drawing;
using System.Text;
using System.Windows.Forms;
using Tekla.Structures.Datatype;
using Tekla.Structures.Dialog;
public class Example1 : PluginFormBase
{
    private void InitializeComponent()
    {
        this.OkButton = new System.Windows.Forms.Button();
        this.ModifyButton = new System.Windows.Forms.Button();
        this.SuspendLayout();
        //
        // OkButton
        //
        this.structuresExtender.SetAttributeName(this.OkButton, null);
        this.structuresExtender.SetAttributeTypeName(this.OkButton, null);
        this.structuresExtender.SetBindPropertyName(this.OkButton, null);
        this.OkButton.Name = "OkButton";
        this.OkButton.Text = "OK";
        this.OkButton.Click += new System.EventHandler(this.OkButton_Click);
        //
        // ModifyButton
        //
        this.structuresExtender.SetAttributeName(this.ModifyButton, null);
        this.structuresExtender.SetAttributeTypeName(this.ModifyButton, null);
        this.structuresExtender.SetBindPropertyName(this.ModifyButton, null);
        this.ModifyButton.Name = "ModifyButton";
        this.ModifyButton.Text = "Modify";
        this.ModifyButton.Click += new System.EventHandler(this.ModifyButton_Click);
        //
        // Example1
        //
        this.structuresExtender.SetAttributeName(this, null);
        this.structuresExtender.SetAttributeTypeName(this, null);
        this.structuresExtender.SetBindPropertyName(this, null);
        this.Controls.Add(this.ModifyButton);
        this.Controls.Add(this.OkButton);
        this.Name = "Example1";
        this.ResumeLayout(false);
    }
    public Example1()
    {
        InitializeComponent();
    }
    private void OkButton_Click(object sender, EventArgs e)
    {
        this.Apply();
        this.Close();
    }
    private void ModifyButton_Click(object sender, EventArgs e)
    {
        this.Modify();
    }
    private System.Windows.Forms.Button OkButton;
    private System.Windows.Forms.Button ModifyButton;
}
See Also
Reference
Tekla.Structures.Dialog Namespace