Tekla Open API Reference for Tekla Structures 2025
Polygon Class
 The Polygon class defines a polygon that is a multipoint line which is connected. It can also have a bulge (curved lines).
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.GraphicObject
 Tekla.Structures.Drawing.ClosedGraphicObject
 Tekla.Structures.Drawing.Polygon
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Polygon : ClosedGraphicObject
<SerializableAttribute>
Public NotInheritable Class Polygon
	Inherits ClosedGraphicObject
The Polygon type exposes the following members.
Constructors
Name | Description
Polygon(ViewBase, PointList)
 Creates a new polygon instance with the point list using standard attributes.
Polygon(ViewBase, PointList, Polygon.PolygonAttributes)
 Creates a new polygon instance with the point list using the given attributes.
Top
Properties
Name | Description
Attributes
 The attributes for the polygon.
Bulge
 The bulge (curve) to use for the polygon (a bulge is the ratio between the height and width of an object).
Bulges
 The list of individual bulges for the polygon.
Points
 The list of points for the polygon.
Top
Methods
Name | Description
Delete
 Calls the system to delete the object.
 (Overrides DatabaseObject.Delete().)
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if(MyDrawingHandler.GetConnectionStatus())
           {
               Polygon MyPolygon;
               PointList PolygonPoints = new PointList();
               PolygonPoints.Add(new Point(10,10));
               PolygonPoints.Add(new Point(50,10));
               PolygonPoints.Add(new Point(50,50));
               PolygonPoints.Add(new Point(10,50));
               DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
               while(views.MoveNext())
               {
                   MyPolygon = new Polygon(views.Current as ViewBase, PolygonPoints);
                   MyPolygon.Insert();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace