Tekla Open API Reference for Tekla Structures 2025
ObjectFilterExpressions.CustomNumber Class
 The CustomNumber class represents a custom numeric filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.CustomNumber
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CustomNumber : NumericFilterExpression
<SerializableAttribute>
Public Class CustomNumber
	Inherits NumericFilterExpression
The ObjectFilterExpressions.CustomNumber type exposes the following members.
Constructors
Name | Description
ObjectFilterExpressions.CustomNumber
 Initializes a new instance of the CustomNumber class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace