Tekla Open API Reference for Tekla Structures 2025
PourObjectFilterExpressions.ConcreteMixture Class
 The ConcreteMixture class represents the concrete mixture filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.PourObjectFilterExpressions.ConcreteMixture
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ConcreteMixture : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class ConcreteMixture
	Inherits StringFilterExpression
The PourObjectFilterExpressions.ConcreteMixture type exposes the following members.
Constructors
Name | Description
PourObjectFilterExpressions.ConcreteMixture
 Initializes a new instance of the ConcreteMixture class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace