Tekla Open API Reference for Tekla Structures 2025
CastUnitDrawing Properties
The CastUnitDrawing type exposes the following members.
Properties
Name | Description
CastUnitById
 Cast unit definition method. True means the cast unit definition method is by cast unit id. False means the cast unit definition method is by cast unit position.
CastUnitIdentifier
 The identifier of the model object cast unit.
SheetNumber
 The sheet number of the drawing.
Top
See Also
Reference
CastUnitDrawing Class
Tekla.Structures.Drawing Namespace