Tekla Open API Reference for Tekla Structures 2025
PickerInputTwoPoints Properties
The PickerInputTwoPoints type exposes the following members.
Properties
Name | Description
FirstPickedPoint
 The first picked point in the view coordinates.
SecondPickedPoint
 The second picked point in the view coordinates.
Top
See Also
Reference
PickerInputTwoPoints Class
Tekla.Structures.Drawing Namespace