Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier Class
 Represents a modifier that can modify the characteristics of RebarSet reinforcing bars that pass through it.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseRebarModifier
 Tekla.Structures.Model.RebarEndDetailModifier
 Tekla.Structures.Model.RebarPropertyModifier
 Tekla.Structures.Model.RebarSplitter
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class BaseRebarModifier : ModelObject
<SerializableAttribute>
Public MustInherit Class BaseRebarModifier
	Inherits ModelObject
The BaseRebarModifier type exposes the following members.
Properties
Name | Description
BarsAffected
 Gets or sets the reinforcing bars affected.
Curve
 Gets or sets the geometric Contour of the rebar modifier.
Father
 Gets or sets the RebarSet to which the modifier belongs. Only reinforcing bars generated by this RebarSet can be modified by this rebar modifier.
FirstAffectedBar
 Gets or sets the first affected bar. If set to zero, the first affected bar will be chosen automatically.
FollowEdges
 Gets or sets a flag that indicates whether the modifier should attempt to follow the leg face edges located between its end points.
Top
Methods
Name | Description
Delete
 Deletes the rebar modifier from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the rebar modifier into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing rebar modifier in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the rebar modifier from the model database. The identifier must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
Tekla.Structures.Model Namespace