Tekla Open API Reference for Tekla Structures 2025
LoadUniform Class
 The LoadUniform class defines a uniformly-distributed force bounded by a polygon.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Load
 Tekla.Structures.Model.LoadUniform
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LoadUniform : Load
<SerializableAttribute>
Public NotInheritable Class LoadUniform
	Inherits Load
The LoadUniform type exposes the following members.
Constructors
Name | Description
LoadUniform
 Creates a new load uniform instance.
Top
Properties
Name | Description
DistanceA
 The distance a (for enlarging or reducing the loaded area).
P1
 The load magnitude vector. The values are given in the local coordinate system of the load (not in the current coordinate system).
Polygon
 The position points for the uniform load.
Top
Methods
Name | Description
Delete
 Deletes the load uniform instance with the given ID from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the load uniform into the model database.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing load uniform in the model database to match the current one. At the moment it is not possible to change the load attachment or the father.
 (Overrides ModelObject.Modify().)
Select
 Selects a load uniform from the model database. The ID must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
       public void Example1()
       {
           LoadUniform L = new LoadUniform();
           L.P1 = new Vector(1000,2000,3000);
           L.DistanceA = 5;
           L.Polygon.Points.Add(new Point(9000, 12000, 0));
           L.Polygon.Points.Add(new Point(11000, 12000, 0));
           L.Polygon.Points.Add(new Point(11000, 15000, 0));
           L.Polygon.Points.Add(new Point(7000, 15000, 0));
           L.AutomaticPrimaryAxisWeight = true;
           L.BoundingBoxDx = 500;
           L.BoundingBoxDy = 500;
           L.BoundingBoxDz = 500;
           L.LoadDispersionAngle = 3;
           L.PartFilter = "testing";
           L.PartNames = Load.LoadPartNamesEnum.LOAD_PART_NAMES_INCLUDE;
           L.PrimaryAxisDirection = new Vector(1000, 500, 0);
           L.Spanning = Load.LoadSpanningEnum.LOAD_SPANNING_SINGLE;
           L.Weight = 2;
           L.CreateFixedSupportConditionsAutomatically = true;
           if (!L.Insert())
               Console.WriteLine("LoadUniform Insert failed!");
       }
}
See Also
Reference
Tekla.Structures.Model Namespace