Tekla Open API Reference for Tekla Structures 2025
AnalysisPosition Class
 The AnalysisPosition class contains information related to analysis positions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisPosition
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisPosition : AnalysisObject
Public NotInheritable Class AnalysisPosition
	Inherits AnalysisObject
The AnalysisPosition type exposes the following members.
Constructors
Name | Description
AnalysisPosition
Initializes a new instance of the AnalysisPosition class
Top
Properties
Name | Description
Node
 The node of the position.
Type
 The type of the position.
Top
Methods
Name | Description
Select
 Selects an analysis position.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace