Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectBase Methods
The EmbeddedObjectBase type exposes the following members.
Methods
Name | Description
Delete
 Deletes the embedded object.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Gets the bounding box for the current object in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Gets the bounding box for the current object in its local coordinate system.
Insert
 Inserts the embedded object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the embedded object.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object according to the given move vector.
Resize
 Resizes the object. The scaling type is changed to ScaleToFit.
Select
 Selects the embedded object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
EmbeddedObjectBase Class
Tekla.Structures.Drawing Namespace