Tekla Open API Reference for Tekla Structures 2025
DetailMark Properties
The DetailMark type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the detail mark.
BoundaryPoint
 The boundary point of the mark.
CenterPoint
 The center point of the mark.
LabelPoint
 The label point of the mark.
Top
See Also
Reference
DetailMark Class
Tekla.Structures.Drawing Namespace