Tekla Open API Reference for Tekla Structures 2025
SurfaceObject Methods
The SurfaceObject type exposes the following members.
Methods
Name | Description
Delete
 Deletes the model object from the model database.
 (Overrides ModelObject.Delete().)
Insert
 Inserts a new model object. The geometry of the object needs to be set by using the public Polymesh function, before calling insert.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing model object in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects the model object from the model by the identifier of this instance.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
SurfaceObject Class
Tekla.Structures.Model Namespace