Tekla Open API Reference for Tekla Structures 2025
PickerInputThreePoints Properties
The PickerInputThreePoints type exposes the following members.
Properties
Name | Description
FirstPickedPoint
 The first picked point in the view coordinates.
SecondPickedPoint
 The second picked point in the view coordinates.
ThirdPickedPoint
 The third picked point in the view coordinates.
Top
See Also
Reference
PickerInputThreePoints Class
Tekla.Structures.Drawing Namespace