Tekla Open API Reference for Tekla Structures 2025
PartFilterExpressions.StartNumber Class
 The StartNumber class represents the start number filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.PartFilterExpressions.StartNumber
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class StartNumber : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class StartNumber
	Inherits NumericFilterExpression
The PartFilterExpressions.StartNumber type exposes the following members.
Constructors
Name | Description
PartFilterExpressions.StartNumber
 Initializes a new instance of the StartNumber class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace