Tekla Open API Reference for Tekla Structures 2025
ContourPlate Methods
The ContourPlate type exposes the following members.
Methods
Name | Description
AddContourPoint
 Adds a contour point to the contour plate.
Delete
 Deletes the contour plate instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetContourPolycurve
 Get contour as polycurve
Insert
 Inserts the contour plate into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing contour plate in the model database to match the current one. The identifier must be set.
 (Overrides ModelObject.Modify().)
Select
 Selects a contour plate from the model database. The identifier of the contour plate must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
ContourPlate Class
Tekla.Structures.Model Namespace