Tekla Open API Reference for Tekla Structures 2025
ObjectFilterExpressions.IdNumber Class
 The IdNumber class represents the identifier number filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.ObjectFilterExpressions.IdNumber
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IdNumber : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class IdNumber
	Inherits NumericFilterExpression
The ObjectFilterExpressions.IdNumber type exposes the following members.
Constructors
Name | Description
ObjectFilterExpressions.IdNumber
 Initializes a new instance of the IdNumber class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace