Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_LShapeProfile Class
 The IFC2X3_ParametricObject_LShapeProfile class contains the L-shape profile definition.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_LShapeProfile
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IFC2X3_ParametricObject_LShapeProfile : ReferenceModelObjectAttribute
<SerializableAttribute>
Public NotInheritable Class IFC2X3_ParametricObject_LShapeProfile
	Inherits ReferenceModelObjectAttribute
The IFC2X3_ParametricObject_LShapeProfile type exposes the following members.
Properties
Name | Description
Depth
 The depth.
EdgeRadius
 The edge radius.
FilletRadius
 The fillet radius.
LegSlope
 The leg slope.
Thickness
 The thickness.
Width
 The width.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace