Tekla Open API Reference for Tekla Structures 2025
ReinforcementMeshAttributes Properties
The ReinforcementBase.ReinforcementMeshAttributes type exposes the following members.
Properties
Name | Description
MeshReinforcementSymbolIndex
 Defines the index for the mesh symbol to be used. The mesh symbol appears in the middle of the mesh line when ReinforcementRepresentation == OutLine. The index starts from 0 and corresponds to the symbol in the file mesh.sym.
MeshReinforcementSymbolSize
 Defines the size of the reinforcement mesh symbol.
MeshReinforcementVisibilityCrossing
 Defines which crossing bars in the mesh appear in drawings.
MeshReinforcementVisibilityLongitudinal
 Defines which longitudinal wires in the mesh appear in drawings.
Top
See Also
Reference
ReinforcementBase.ReinforcementMeshAttributes Class
Tekla.Structures.Drawing Namespace