Tekla Open API Reference for Tekla Structures 2025
SingleRebar Class
 The SingleRebar class represents a single reinforcing bar.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.Reinforcement
 Tekla.Structures.Model.SingleRebar
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SingleRebar : Reinforcement
<SerializableAttribute>
Public NotInheritable Class SingleRebar
	Inherits Reinforcement
The SingleRebar type exposes the following members.
Constructors
Name | Description
SingleRebar
 Initializes a new single rebar instance with empty attributes.
Top
Properties
Name | Description
EndHook
 The hook at the end of the reinforcing bar.
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
Polygon
 The polygon of the reinforcing bar.
Size
 The size of the reinforcement.
StartHook
 The hook at the beginning of the reinforcing bar.
Top
Methods
Name | Description
Delete
 Deletes the single rebar instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
GetRebarSet
 Gets the parent RebarSet of the single rebar.
Insert
 Inserts the single rebar into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing single rebar in the model database to match the current one.
 (Overrides ModelObject.Modify().)
Select
 Selects a single rebar from the model database. The reinforcement identifier must be set.
 (Overrides ModelObject.Select().)
Top
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
       public void Example1()
       {
           Beam Beam = new Beam(new Point(5000, 7000, 0), new Point(6000, 7000, 0));
           Beam.Profile.ProfileString = "250*250";
           Beam.Material.MaterialString = "K40-1";
           Beam.Finish = "PAINT";
           Beam.Insert();
           double MinimumY = Beam.GetSolid().MinimumPoint.Y;
           double MinimumX = Beam.GetSolid().MinimumPoint.X;
           double MinimumZ = Beam.GetSolid().MinimumPoint.Z;
           double MaximumY = Beam.GetSolid().MaximumPoint.Y;
           double MaximumX = Beam.GetSolid().MaximumPoint.X;
           double MaximumZ = Beam.GetSolid().MaximumPoint.Z;
           Polygon Polygon = new Polygon();
           Polygon.Points.Add(new Point(MinimumX, MaximumY, MaximumZ));
           Polygon.Points.Add(new Point(MaximumX, MaximumY, MaximumZ));
           SingleRebar SingleRebar = new SingleRebar();
           SingleRebar.Polygon = Polygon;
           SingleRebar.Father = Beam;
           SingleRebar.Name = "SingleRebar";
           SingleRebar.Class = 9;
           SingleRebar.Size = "12";
           SingleRebar.NumberingSeries.StartNumber = 0;
           SingleRebar.NumberingSeries.Prefix = "Single";
           SingleRebar.Grade = "A500HW";
           SingleRebar.OnPlaneOffsets = new ArrayList();
           SingleRebar.OnPlaneOffsets.Add(25.00);
           SingleRebar.StartHook.Angle = -90;
           SingleRebar.StartHook.Length = 10;
           SingleRebar.StartHook.Radius = 10;
           SingleRebar.StartHook.Shape = RebarHookData.RebarHookShapeEnum.CUSTOM_HOOK;
           SingleRebar.EndHook.Angle = 90;
           SingleRebar.EndHook.Length = 10;
           SingleRebar.EndHook.Radius = 10;
           SingleRebar.EndHook.Shape = RebarHookData.RebarHookShapeEnum.CUSTOM_HOOK;
           if(!SingleRebar.Insert())
               Console.WriteLine("Insert failed!");
       }
}
See Also
Reference
Tekla.Structures.Model Namespace