Tekla Open API Reference for Tekla Structures 2025
WeldFilterExpressions.TypeBelowLine Class
 The TypeBelowLine class represents the type below line filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.NumericFilterExpression
 Tekla.Structures.Filtering.Categories.WeldFilterExpressions.TypeBelowLine
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class TypeBelowLine : NumericFilterExpression
<SerializableAttribute>
Public NotInheritable Class TypeBelowLine
	Inherits NumericFilterExpression
The WeldFilterExpressions.TypeBelowLine type exposes the following members.
Constructors
Name | Description
WeldFilterExpressions.TypeBelowLine
 Initializes a new instance of the TypeBelowLine class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace