Tekla Open API Reference for Tekla Structures 2025
PolygonWeld Properties
The PolygonWeld type exposes the following members.
Properties
Name | Description
Polygon
 The polygon for the polygon weld.
Top
See Also
Reference
PolygonWeld Class
Tekla.Structures.Model Namespace