Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes Class
 The StraightDimensionSetAttributes class contains the attributes for managing all the attributes of the straight dimension.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes
 Tekla.Structures.Drawing.StraightDimensionSet.StraightDimensionSetAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class StraightDimensionSetAttributes : DimensionSetBaseAttributes
<SerializableAttribute>
Public NotInheritable Class StraightDimensionSetAttributes
	Inherits DimensionSetBaseAttributes
The StraightDimensionSet.StraightDimensionSetAttributes type exposes the following members.
Constructors
Name | Description
StraightDimensionSet.StraightDimensionSetAttributes() |  Obsolete.
 Creates a default straight dimension set attributes instance that loads standard attributes.
StraightDimensionSet.StraightDimensionSetAttributes(String) |  Obsolete.
 Creates a straight dimension set attributes instance that loads the specified attributes.
StraightDimensionSet.StraightDimensionSetAttributes(ModelObject)
 Creates a default straight dimension set attributes instance that loads standard attributes.
StraightDimensionSet.StraightDimensionSetAttributes(ModelObject, String)
 Creates a straight dimension set attributes instance that loads the specified attributes.
Top
Properties
Name | Description
CombinedDimension
 Combines the attributes of the dimension.
DimensionType
 The dimension type.
Exaggeration
 The exaggeration attributes of the dimension.
ExcludePartsAccordingToFilter
 Sets the filter to use for excluding parts from the tags. You may query the possible filters using StraightDimensionSet.GetAllExcludePartsAccordingToFilter()
ExtensionLine
 The extension line presentation of the dimension.
IncludePartCountInTag
 Gets or sets whether the part count is included in at least one of the tag position, or set part count flag for all tag positions.
IncludePartCountInTagA
 Gets or sets a value indicating whether the part count is included in the tag A.
IncludePartCountInTagB
 Gets or sets a value indicating whether the part count is included in the tag B.
IncludePartCountInTagC
 Gets or sets a value indicating whether the part count is included in the tag C.
IncludePartCountInTagD
 Gets or sets a value indicating whether the part count is included in the tag D.
IncludePartCountInTagE
 Gets or sets a value indicating whether the part count is included in the tag E.
IncludePartCountInTagF
 Gets or sets a value indicating whether the part count is included in the tag F.
IncludePartCountInTagG
 Gets or sets a value indicating whether the part count is included in the tag G.
LeftLowerTag
 The left lower dimension tag.
LeftMiddleTag
 The left middle dimension tag.
LeftUpperTag
 The left upper dimension tag.
RightLowerTag
 The right lower dimension tag.
RightMiddleTag
 The right middle dimension tag.
RightUpperTag
 The right upper dimension tag.
ShortDimension
 How short dimensions are shown.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
Examples
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           StraightDimensionSet.StraightDimensionSetAttributes attributes =
               new StraightDimensionSet.StraightDimensionSetAttributes(null, "MyAttributes");
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace