Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetBase Methods
The CurvedDimensionSetBase type exposes the following members.
Methods
Name | Description
Delete
 Deletes the dimension set and its child dimensions from the database.
 (Overrides DatabaseObject.Delete().)
Insert
 Curved dimensions are created using the curved dimension set handler.
 (Overrides DatabaseObject.Insert().)
Modify
 Modifies the existing dimension set in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the dimension set from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
CurvedDimensionSetBase Class
Tekla.Structures.Drawing Namespace