Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer Class
 The EdgeChamfer class contains methods related to edge chamfers. An edge chamfer is a drawing object derived from a model object. It represents a drawing chamfer that has a reference to the actual chamfer in the model database.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.ModelObject
 Tekla.Structures.Drawing.EdgeChamfer
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class EdgeChamfer : ModelObject
<SerializableAttribute>
Public NotInheritable Class EdgeChamfer
	Inherits ModelObject
The EdgeChamfer type exposes the following members.
Properties
Name | Description
Attributes
 The attributes of the edge chamfer. For more information see EdgeChamfer.EdgeChamferAttributes.
Top
Methods
Name | Description
Delete
 Deletes the drawing chamfer from the current drawing database.
 (Overrides DatabaseObject.Delete().)
Insert
 NOT YET IMPLEMENTED.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the drawing chamfer.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing chamfer from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace