Tekla Open API Reference for Tekla Structures 2025
PickerInputObjectAndAPoint Properties
The PickerInputObjectAndAPoint type exposes the following members.
Properties
Name | Description
PickedPoint
 Gets or sets the picked point in the view coordinates.
Top
See Also
Reference
PickerInputObjectAndAPoint Class
Tekla.Structures.Drawing Namespace