Tekla Open API Reference for Tekla Structures 2025
Connection Properties
The Connection type exposes the following members.
Properties
Name | Description
AutoDirectionType
 The auto direction type. Default value is AUTODIR_BASIC. Value should be AUTODIR_NA to set direction with UpVector property. Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with connection attribute file.
Class
 The class of the connection.
Code
 The code of the connection. The code can be used to classify the connection. The code of the connection can be reported and shown in drawings. The maximum length of the string is 20 characters.
PositionType
 The position type.
When creating custom connections this attribute is not applied, instead the position type used when creating the custom connection is used.
Status
 The read only status of the connection. The status can be reported and shown in drawings. The color of the connection symbol in the model indicates the status of the connection.
UpVector
 A vector indicating which direction is considered the up direction for the connection.
Top
See Also
Reference
Connection Class
Tekla.Structures.Model Namespace