Tekla Open API Reference for Tekla Structures 2025
HatchAttributes Class
 The HatchAttributes base class, inherited by ModelObjectHatchAttributes and GraphicObjectHatchAttributes, contains hatch attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.HatchAttributes
 Tekla.Structures.Drawing.GraphicObjectHatchAttributes
 Tekla.Structures.Drawing.ModelObjectHatchAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class HatchAttributes : GenericAttributesBase
<SerializableAttribute>
Public MustInherit Class HatchAttributes
	Inherits GenericAttributesBase
The HatchAttributes type exposes the following members.
Properties
Name | Description
Angle
 The angle in which to draw the hatch.
BackgroundColor
 The background color of the hatch.
Color
 The color of the hatch.
DrawBackgroundColor
 Sets whether the background color will be enabled or disabled for the hatch. See also: BackgroundColor.
FactorType
 The type of the hatch factor.
Name
 The name of the hatch. If an empty string is given as hatch name it will become "None".
ScaleX
 The scale value of the hatch in the X-direction.
ScaleY
 The scale value of the hatch in the Y-direction.
TrueBackgroundColor
 The true color (rgb enabled) of the hatch background.
TrueColor
 The true color (RGB enabled) of the hatch.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Drawing Namespace