Tekla Open API Reference for Tekla Structures 2025
Text Properties
The Text type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the text.
Hideable
 Accesses the information if this object is hidden or not or if it should be.
InsertionPoint
 The insertion point of the text.
Placing
 The current placing of the object. See the placing types for different placing options.
TextString
 The contents of the text.
Top
See Also
Reference
Text Class
Tekla.Structures.Drawing Namespace