Tekla Open API Reference for Tekla Structures 2025
MarkSet Properties
The MarkSet type exposes the following members.
Properties
Name | Description
Attributes
 Gets or sets the mark set attributes.
Top
See Also
Reference
MarkSet Class
Tekla.Structures.Drawing Namespace