Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier Properties
The BaseRebarModifier type exposes the following members.
Properties
Name | Description
BarsAffected
 Gets or sets the reinforcing bars affected.
Curve
 Gets or sets the geometric Contour of the rebar modifier.
Father
 Gets or sets the RebarSet to which the modifier belongs. Only reinforcing bars generated by this RebarSet can be modified by this rebar modifier.
FirstAffectedBar
 Gets or sets the first affected bar. If set to zero, the first affected bar will be chosen automatically.
FollowEdges
 Gets or sets a flag that indicates whether the modifier should attempt to follow the leg face edges located between its end points.
Top
See Also
Reference
BaseRebarModifier Class
Tekla.Structures.Model Namespace