Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment Properties
The SurfaceTreatment type exposes the following members.
Properties
Name | Description
Class
 The class of the surface treatment.
Color
 The color of the surfacing.
CutByFatherBooleans
 Defines if the part is cut by the father's cuts.
EndPoint
 Determines the direction the surfacing is filled in. The direction is from the start point towards the end point.
Father
 Defines the father part for the surface treatment: the part that the surface treatment is created on.
Material
 Defines the material for the surface treatment.
Name
 The name of the surface treatment.
Polygon
 Defines the area for the surface treatment.
Position
 Defines the position for the surface treatment.
StartPoint
 Determines the origin of the surfacing. The surfacing is then filled out from the start point towards the end point.
Thickness
 Defines how thick the surface treatment is.
Type
 The type of the surfacing.
TypeName
 The name of the surface treatment type. The valid names are defined in the product_finishes.dat file.
Top
See Also
Reference
SurfaceTreatment Class
Tekla.Structures.Model Namespace