Tekla Open API Reference for Tekla Structures 2025
AnalysisPart Properties
The AnalysisPart type exposes the following members.
Properties
Name | Description
AnalysisAreas
 The analysis areas of the analysis part.
AnalysisBars
 The analysis bars of the analysis part.
AnalysisDesignCode
 The analysis design code of the analysis part.
AnalysisPartAnalysisProperties
 The analysis part analysis properties.
AnalysisPartAreaAttributes
 The analysis part area attributes.
AnalysisPartBarAttributes
 The analysis part bar attributes.
AnalysisPartCompositeProperties
 The analysis part composite properties.
AnalysisPartLoadingProperties
 The analysis part loading properties.
AnalysisPartPositionProperties
 The analysis part position properties.
AnalysisPartSpanningProperties
 The analysis part spanning properties.
AnalysisType
 The analysis type of the analysis part.
AnalysisVolumes
 The analysis volumes of the analysis part.
CoordinateSystem
 The coordinate system of the analysis part.
Curvature
 The curvature of the analysis part.
LoadBearingOrder
 The load bearing order.
Material
 The material of the analysis part.
OverrideProfile
 The override profile of the analysis part. In case of tapered profile, only the name is available, and more details are available in the start/end properties of the analysis members.
PartID
 The identifier of the physical part.
PartName
 The name of the physical part.
PartType
 The type of the physical part.
Profile
 The profile of the analysis part. Note: OverrideProfile may exist to replace this. In case of tapered profile, only the name is available, ID is 0 and values are not returned. More details are available in the start/end properties of the analysis members.
SnapDistance
 The snap distance. Use 0.0 for manual connectivity, positive value for automatic connectivity.
UpDirection
 The up direction of the analysis part (in the global coordinate system). The axis vector (connecting member end nodes) and the up direction vector define the local XY plane of the member. The local Z can be calculated as localZ = localX x UpDirection (cross product), and after this localY = localZ x localX (cross product).
Top
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace