Tekla Open API Reference for Tekla Structures 2025
AnalysisVolumeItem Properties
The AnalysisVolumeItem type exposes the following members.
Properties
Name | Description
Faces
 The faces of the analysis volume item.
Top
See Also
Reference
AnalysisVolumeItem Class
Tekla.Structures.Analysis Namespace