Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedMemberLoad Class
 The AnalysisDecomposedMemberLoad class contains information related to decomposed member loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedMemberLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDecomposedMemberLoad : AnalysisDecomposedLoad
Public NotInheritable Class AnalysisDecomposedMemberLoad
	Inherits AnalysisDecomposedLoad
The AnalysisDecomposedMemberLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedMemberLoad
 Initializes a new instance of the AnalysisDecomposedMemberLoad class.
Top
Properties
Name | Description
CSCode
 Gets or sets the CS code of the decomposed member load.
EndDistance
 Gets or sets the end distance of the decomposed member load.
EndValue
 Gets or sets the end value of the decomposed member load.
StartDistance
 Gets or sets the start distance of the decomposed member load.
StartValue
 Gets or sets the start value of the decomposed member load.
Top
Methods
Name | Description
Select
 Selects the analysis decomposed member load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace