Tekla Open API Reference for Tekla Structures 2025
Mark Methods
The Mark type exposes the following members.
Methods
Name | Description
Delete
 Calls the system to delete the mark attached to a model object. After this operation, only associative notes can be attached to that model object.
 (Overrides DatabaseObject.Delete().)
Insert
 Calls the system to insert the new object.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Calls the system to update/modify the object.
 (Overrides DatabaseObject.Modify().)
Select
 Calls the system to select and retrieve the object.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Mark Class
Tekla.Structures.Drawing Namespace