Tekla Open API Reference for Tekla Structures 2025
MultiDrawing Class
 The MultiDrawing class is for handling multidrawings.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.Drawing
 Tekla.Structures.Drawing.MultiDrawing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class MultiDrawing : Drawing
<SerializableAttribute>
Public NotInheritable Class MultiDrawing
	Inherits Drawing
The MultiDrawing type exposes the following members.
Properties
Name | Description
Top
Methods
Name | Description
Insert
 Not supported.
 (Overrides DatabaseObject.Insert().)
Modify
 Applies the changes made to the drawing attributes.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace