Tekla Open API Reference for Tekla Structures 2025
AngleDimension Methods
The AngleDimension type exposes the following members.
Methods
Name | Description
Delete
 Deletes the dimension from the database.
 (Overrides DatabaseObject.Delete().)
GetAngle
 Gets the angle value (in degrees).
GetDimensionSet()
 The angle dimension doesn't have a dimension set.
 (Overrides DimensionBase.GetDimensionSet().)
GetDimensionSet(Boolean)
 The angle dimension doesn't have a dimension set.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Insert
 Inserts the dimension into the database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the existing dimension in the database.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the angle dimension from the database.
 (Overrides DatabaseObject.Select().)
Top
See Also
Reference
AngleDimension Class
Tekla.Structures.Drawing Namespace