Tekla Open API Reference for Tekla Structures 2025
BoltFilterExpressions.CustomString Class
 The CustomString class represents a custom string filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.BoltFilterExpressions.CustomString
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CustomString : StringFilterExpression
<SerializableAttribute>
Public Class CustomString
	Inherits StringFilterExpression
The BoltFilterExpressions.CustomString type exposes the following members.
Constructors
Name | Description
BoltFilterExpressions.CustomString
 Initializes a new instance of the CustomString class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace