Tekla Open API Reference for Tekla Structures 2025
LogicalWeld Class
 The LogicalWeld class represents a group of welds in the model. A logical weld contains a list of children welds. The primary properties need to be the same in all the children welds.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseWeld
 Tekla.Structures.Model.LogicalWeld
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LogicalWeld : BaseWeld
<SerializableAttribute>
Public NotInheritable Class LogicalWeld
	Inherits BaseWeld
The LogicalWeld type exposes the following members.
Constructors
Name | Description
LogicalWeld
 Creates a new logical weld instance.
Top
Properties
Name | Description
Top
Methods
Name | Description
AddWeld
 Adds a weld to the logical weld.
Delete
 Deletes the logical weld instance with the given identifier from the model database and also the children welds.
 (Overrides ModelObject.Delete().)
Explode
 Removes the logical weld from the model but not the children welds.
GetMainWeld
 Returns the main weld of the logical weld.
Insert
 Inserts the logical weld into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing logical weld in the model database to match the current one.
 (Overrides ModelObject.Modify().)
RemoveWeld
 Removes a weld from the logical weld.
Select()
 Selects a logical weld from the model database. The logical weld identifier must be set.
 (Overrides ModelObject.Select().)
Select(BaseWeld)
 Selects the logical weld that a child weld belongs to.
SetMainWeld
 Sets the main weld for the logical weld.
Top
Examples
using Tekla.Structures.Model;
public class Example
{
       public void Example1()
       {
           Weld Weld1 = new Weld();
           Weld Weld2 = new Weld();
           Weld1.TypeBelow = Weld.WeldTypeEnum.WELD_TYPE_SLOT;
           Weld2.TypeBelow = Weld.WeldTypeEnum.WELD_TYPE_SEAM;
           LogicalWeld LogicalWeld = new LogicalWeld(Weld1);
           LogicalWeld.AddWeld(Weld2);
           LogicalWeld.Insert();
           LogicalWeld.SetMainWeld(Weld2);
           LogicalWeld.RemoveWeld(Weld1);
           LogicalWeld.Modify();
           LogicalWeld.Explode();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace