Tekla Open API Reference for Tekla Structures 2025
AssemblyFilterExpressions.IdNumber Class
 The IdNumber class represents the identifier number filter expression.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.StringFilterExpression
 Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.IdNumber
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class IdNumber : StringFilterExpression
<SerializableAttribute>
Public NotInheritable Class IdNumber
	Inherits StringFilterExpression
The AssemblyFilterExpressions.IdNumber type exposes the following members.
Constructors
Name | Description
AssemblyFilterExpressions.IdNumber
 Initializes a new instance of the IdNumber class.
Top
Methods
Name | Description
Top
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace