Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_IShapeProfile Properties
The IFC2X3_ParametricObject_IShapeProfile type exposes the following members.
Properties
Name | Description
FilletRadius
 The fillet radius.
FlangeThickness
 The flange thickness.
OverallDepth
 The overall depth.
OverallWidth
 The overall width.
WebThickness
 The web thickness.
Top
See Also
Reference
IFC2X3_ParametricObject_IShapeProfile Class
Tekla.Structures.Model.Collaboration Namespace