Tekla Open API Reference for Tekla Structures 2025
AnalysisRigidDiaphragm Properties
The AnalysisRigidDiaphragm type exposes the following members.
Properties
Name | Description
ExtremaMaximum
 The maximum of the extrema (in the global coordinate system).
ExtremaMinimum
 The minimum of the extrema (in the global coordinate system).
MasterNodeID
 The identifier of the master node.
PartIDs
 The part identifier.
SlaveNodeIDs
 The slave node identifier.
Top
See Also
Reference
AnalysisRigidDiaphragm Class
Tekla.Structures.Analysis Namespace