Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier Class
 The RebarPropertyModifier class represents a modifier that can modify the characteristics of RebarSet reinforcing bars that pass through it.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Object
 Tekla.Structures.Model.ModelObject
 Tekla.Structures.Model.BaseRebarModifier
 Tekla.Structures.Model.RebarPropertyModifier
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class RebarPropertyModifier : BaseRebarModifier
<SerializableAttribute>
Public Class RebarPropertyModifier
	Inherits BaseRebarModifier
The RebarPropertyModifier type exposes the following members.
Constructors
Name | Description
RebarPropertyModifier
 Initializes a new instance of the RebarPropertyModifier class.
Top
Properties
Name | Description
AffectsWholeBarPlane
 Gets or sets a value indicating whether the modifier affects all bars in the plane or just those that it touches.
FatherPart
 Gets or sets the father part for all bars touching the property modifier.
GroupingType
 Gets or sets the grouping type.
RebarProperties
 Gets or sets the reinforcing bar properties.
SpacingOverride
 Gets or sets the spacing override.
Top
Methods
Name | Description
GetAffectedBars
 Gets the virtual bars affected by this modifier.
Top
Examples
 The following example shows how to create and add a RebarPropertyModifier, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
       public void Example1()
       {
            // Create and insert a rebarset (see the RebarSet example).
            var rebarSet = new RebarSet();
            // Create the RebarPropertyModifier
            var strip = new RebarPropertyModifier();
            strip.Father = rebarSet;
            strip.GroupingType = RebarPropertyModifier.GroupingTypeEnum.AUTOMATIC;
            strip.RebarProperties.Name = "REBAR";
            strip.RebarProperties.Class = 3;
            strip.RebarProperties.Grade = "H";
            strip.RebarProperties.Size = "12";
            strip.RebarProperties.BendingRadius = 24;
            strip.RebarProperties.NumberingSeries.StartNumber = 1;
            // Override the rebar set spacings in the region of the property modifier
            strip.SpacingOverride = RebarSpacing.Create(
                   RebarSpacing.SpacingType.EXACT_FLEXIBLE_LAST,
                   new RebarSpacing.Offset(true, 0.0),
                   new RebarSpacing.Offset(true, 0.0),
                   100.0);
            strip.Curve.AddContourPoint(new ContourPoint(new Point(200, 200, 0), null));
            strip.Curve.AddContourPoint(new ContourPoint(new Point(200, 1000, 0), null));
            strip.Insert();
       }
}
See Also
Reference
Tekla.Structures.Model Namespace