Tekla Open API Reference for Tekla Structures 2025
LevelMark Class
 The LevelMark class defines a drawing object that is displayed as a level mark in a drawing. See the Tekla Structures help for more information.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.DrawingObject
 Tekla.Structures.Drawing.LevelMark
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LevelMark : DrawingObject,
	IAxisAlignedBoundingBox, IObjectAlignedBoundingBox, IMovableRelative, IPlacing, IHasChildren,
	IHideable
<SerializableAttribute>
Public NotInheritable Class LevelMark
	Inherits DrawingObject
	Implements IAxisAlignedBoundingBox, IObjectAlignedBoundingBox, IMovableRelative, IPlacing,
	IHasChildren, IHideable
The LevelMark type exposes the following members.
Constructors
Name | Description
LevelMark(ViewBase, Point, Point)
 Initializes a new instance of the LevelMark class using the default standard attributes.
LevelMark(ViewBase, Point, Point, LevelMark.LevelMarkAttributes)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, ModelObject)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, PlacingBase)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, ModelObject, LevelMark.LevelMarkAttributes)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, PlacingBase, LevelMark.LevelMarkAttributes)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, PlacingBase, ModelObject)
 Initializes a new instance of the LevelMark class using the given attributes.
LevelMark(ViewBase, Point, Point, PlacingBase, ModelObject, LevelMark.LevelMarkAttributes)
 Initializes a new instance of the LevelMark class using the given attributes.
Top
Properties
Name | Description
Attributes
 Gets or sets the level mark attributes.
BasePoint
 Gets or sets the level mark base point.
Hideable
 Gets the information if this object is hidden or not or if it should be.
InsertionPoint
 Gets or sets the level mark insertion point.
ModelObjectIdentifier
 Gets the model object identifier
Placing
 Gets or sets the current placing of the object. See the placing types for different placing options.
SubType
 Gets or sets the subtype of the level mark.
Top
Methods
Name | Description
Delete
 Deletes the level mark from the current drawing database.
 (Overrides DatabaseObject.Delete().)
GetAxisAlignedBoundingBox
 Returns the axis aligned bounding box of the level mark (rectangle format).
GetObjectAlignedBoundingBox
 Returns the bounding box of the level mark (rectangle format).
GetObjects()
 Gets the children objects of the current object.
GetObjects(Type[])
 Gets the children objects of the current object that are of certain types.
Insert
 Inserts the level mark into the current drawing database.
 (Overrides DatabaseObject.Insert().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides DrawingObject.IsEqual(Object).)
Modify
 Modifies the level mark in the current drawing database.
 (Overrides DatabaseObject.Modify().)
MoveObjectRelative
 Moves the object using the move vector.
Select
 Selects the level mark from the current drawing database.
 (Overrides DatabaseObject.Select().)
Top
Examples
using Tekla.Structures.Drawing;
using Tekla.Structures.Drawing.UI;
using Tekla.Structures.Geometry3d;
namespace Example
{
    class Program
    {
        public static void LevelMarkModify()
        {
            DrawingHandler myDrawingHandler = new DrawingHandler();
            DrawingObjectSelector dos = myDrawingHandler.GetDrawingObjectSelector();
            DrawingObjectEnumerator allObjectsOnSheet = dos.GetSelected();
            while(allObjectsOnSheet.MoveNext())
            {
                if(allObjectsOnSheet.Current is Tekla.Structures.Drawing.LevelMark)
                {
                    LevelMark levelMark = allObjectsOnSheet.Current as Tekla.Structures.Drawing.LevelMark;
                    levelMark.Attributes.Font.Height = 5;
                    levelMark.Attributes.Font.Color = DrawingColors.Red;
                    levelMark.Attributes.Frame.Color = DrawingColors.Yellow;
                    levelMark.Attributes.Frame.Type = FrameTypes.Round;
                    bool res = levelMark.Modify();
                }
            }
        }
        public static LevelMark GetSelectedLevelMark()
        {
            DrawingHandler myDrawingHandler = new DrawingHandler();
            DrawingObjectSelector dos = myDrawingHandler.GetDrawingObjectSelector();
            DrawingObjectEnumerator allObjectsOnSheet = dos.GetSelected();
            while(allObjectsOnSheet.MoveNext())
            {
                if(allObjectsOnSheet.Current is Tekla.Structures.Drawing.LevelMark)
                {
                    LevelMark levelMark = allObjectsOnSheet.Current as Tekla.Structures.Drawing.LevelMark;
                    return levelMark;
                }
            }
            return null;
        }
        public static void LevelMarkCreateAsACopy()
        {
            var levelmark = GetSelectedLevelMark();
            levelmark.InsertionPoint.X += 100;
            levelmark.Insert();
        }
        public static void LevelMarkCreate()
        {
            DrawingHandler MyDrawingHandler = new DrawingHandler();
            var drawing1 = MyDrawingHandler.GetActiveDrawing();
            var sheet1 = drawing1.GetSheet();
            var allviews = sheet1.GetAllViews();
            foreach(var item in allviews)
            {
                ViewBase view = item as ViewBase;
                LeaderLinePlacing leaderLinePlacing = new LeaderLinePlacing(new Point(0000, 1000, 0));
                LevelMark levelMark = new LevelMark(view, new Point(1000, 2000, 0), leaderLinePlacing);
                levelMark.Attributes.Font.Height = 4.0;
                bool res = levelMark.Insert();
            }
        }
        static void Main(string[] args)
        {
            LevelMarkCreate();
            //LevelMarkCreateAsACopy();
            //LevelMarkModify();
            DrawingHandler myDrawingHandler = new DrawingHandler();
            myDrawingHandler.GetActiveDrawing().CommitChanges();
        }
    }
}
See Also
Reference
Tekla.Structures.Drawing Namespace