Tekla Open API Reference for Tekla Structures 2025
LoadUniform Properties
The LoadUniform type exposes the following members.
Properties
Name | Description
DistanceA
 The distance a (for enlarging or reducing the loaded area).
P1
 The load magnitude vector. The values are given in the local coordinate system of the load (not in the current coordinate system).
Polygon
 The position points for the uniform load.
Top
See Also
Reference
LoadUniform Class
Tekla.Structures.Model Namespace