Tekla Open API Reference for Tekla Structures 2025
Assembly.CompareTo Method
Overload List
Name | Description
CompareTo(Assembly)
 Compares the instantiated assembly with another one.
Top
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace