Tekla Open API Reference for Tekla Structures 2025
GADrawing Class
 The GADrawing class is for handling general arrangement drawings in Tekla Structures.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.DatabaseObject
 Tekla.Structures.Drawing.Drawing
 Tekla.Structures.Drawing.GADrawing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class GADrawing : Drawing
<SerializableAttribute>
Public NotInheritable Class GADrawing
	Inherits Drawing
The GADrawing type exposes the following members.
Constructors
Name | Description
GADrawing()
 Instantiates a new GA drawing using standard attributes.
GADrawing(String)
 Instantiates a new GA drawing with the given attributes.
GADrawing(String, String)
 Instantiates a new GA drawing with the given name and attribute file.
GADrawing(String, Size)
 Instantiates a new GA drawing with attributes. Loads the specified attribute file and overrides with the given layout attributes.
Top
Properties
Name | Description
Top
Methods
Name | Description
Insert
 Inserts an empty general arrangement drawing. Views must be added separately. A drawing can be inserted only when there is no active drawing.
 (Overrides DatabaseObject.Insert().)
Modify
 Applies the changes made to the drawing attributes.
 (Overrides DatabaseObject.Modify().)
Select
 Selects the drawing.
 (Overrides DatabaseObject.Select().)
Top
Examples
 Creates an empty GA drawing based on standard attributes and opens it:
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           DrawingHandler drawingHandler = new DrawingHandler();
           Drawing gaDrawing = new GADrawing();
           gaDrawing.Insert();
           drawingHandler.SetActiveDrawing(gaDrawing);
       }
}
 The following example shows how to insert an A3-sized GA drawing:
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           Size A3 = new Size(410.0, 287.0);
           Drawing newDrawing = new GADrawing("standard", A3);
           newDrawing.Insert();
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace