Tekla Open API Reference for Tekla Structures 2025
AnalysisArea Class
 The AnalysisArea class contains information related to analysis areas.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisArea
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisArea : AnalysisObject
Public NotInheritable Class AnalysisArea
	Inherits AnalysisObject
The AnalysisArea type exposes the following members.
Constructors
Name | Description
AnalysisArea
 Initializes a new instance of the AnalysisArea class.
Top
Properties
Name | Description
AnalysisDesignCode
 Gets or sets the design code of the analysis area.
AnalysisType
 Gets or sets the analysis type of the analysis area.
Area
 Gets or sets the area polygon of the analysis area.
AreaHoles
 Gets or sets the area holes of the analysis area.
InnerPositions
 Gets or sets the inner positions of the analysis area.
Label
 Gets or sets the label of the analysis area.
Material
 Gets or sets the material of the analysis area.
Profile
 Gets or sets the profile of the analysis area.
RigidDiaphragm
 Gets or sets the rigid diaphragm of the analysis area.
Thickness
 Gets or sets the thickness of the analysis area.
Top
Methods
Name | Description
Delete
 Deletes an analysis area. Method is not implemented yet.
GetAreaHoles
 Gets the area holes of the analysis area.
GetInnerPositions
 Gets the inner positions of the analysis area.
Modify
 Modifies an analysis area. Method is not implemented yet.
Select
 Selects an analysis area. The AnalysisModelName and ID have to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace