Tekla Open API Reference for Tekla Structures 2025
Arc.ArcAttributes Class
 The ArcAttributes class is the attributes class for the arc.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.OpenGraphicObject.OpenGraphicObjectAttributes
 Tekla.Structures.Drawing.Arc.ArcAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ArcAttributes : OpenGraphicObject.OpenGraphicObjectAttributes
<SerializableAttribute>
Public NotInheritable Class ArcAttributes
	Inherits OpenGraphicObject.OpenGraphicObjectAttributes
The Arc.ArcAttributes type exposes the following members.
Constructors
Name | Description
Arc.ArcAttributes()
 Creates a new default arc attributes instance that loads standard attributes.
Arc.ArcAttributes(String)
 Creates a new arc attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace