Tekla Open API Reference for Tekla Structures 2025
Beam Properties
The Beam type exposes the following members.
Properties
Name | Description
EndPoint
 Gets or sets the end point of the beam.
EndPointOffset
 Gets or sets the beam's end point offset.
StartPoint
 Gets or sets the start point of the beam.
StartPointOffset
 Gets or sets the beam's start point offset.
Type
 Gets the read-only type of the beam. The default type for a new beam instance is beam.
Top
See Also
Reference
Beam Class
Tekla.Structures.Model Namespace