Tekla Open API Reference for Tekla Structures 2025
ContainerView Methods
The ContainerView type exposes the following members.
Methods
Name | Description
GetAllViews
 Gets all the views that are placed on the container view and their children views.
GetViews
 Gets all the views that are placed on the container view.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewBase.IsEqual(Object).)
Top
See Also
Reference
ContainerView Class
Tekla.Structures.Drawing Namespace