Tekla Open API Reference for Tekla Structures 2025
HierarchicObject Methods
The HierarchicObject type exposes the following members.
Methods
Name | Description
AddObjects
 Associates model objects with the hierarchical object. Fails if the hierarchical definition doesn't exist in the model.
Delete
 Deletes the hierarchical object instance from the model. The ID must be set.
 (Overrides ModelObject.Delete().)
Insert
 Inserts the hierarchical object instance in the model.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the hierarchical object instance in the model. The ID must be set.
 (Overrides ModelObject.Modify().)
RemoveObjects
 Removes associations to the given list of model objects. Fails if the hierarchical definition doesn't exist in the model.
Select
 Selects the hierarchical object instance from the model. The ID must be set.
 (Overrides ModelObject.Select().)
Top
See Also
Reference
HierarchicObject Class
Tekla.Structures.Model Namespace