Tekla Open API Reference for Tekla Structures 2025
AnalysisFace Class
 The AnalysisFace class contains information related to analysis faces.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisFace
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisFace : AnalysisObject
Public NotInheritable Class AnalysisFace
	Inherits AnalysisObject
The AnalysisFace type exposes the following members.
Constructors
Name | Description
AnalysisFace
Initializes a new instance of the AnalysisFace class
Top
Properties
Name | Description
Positions
 The positions of the analysis face.
Top
Methods
Name | Description
Select
 Selects an analysis face.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace