Tekla Open API Reference for Tekla Structures 2025
AssemblyDrawing Properties
The AssemblyDrawing type exposes the following members.
Properties
Name | Description
AssemblyIdentifier
 The identifier of the model object assembly.
SheetNumber
 The sheet number of the drawing.
Top
See Also
Reference
AssemblyDrawing Class
Tekla.Structures.Drawing Namespace